{
  "id": "a1419cac-26b6-4b98-a40a-2cea7a5503a8",
  "name": "Francis Ed",
  "url": "https://www.facebook.com/edgabz29",
  "text": "parang nakakarelate po ako sa kwento....maaar i po bang magtanong?...nu ng pinatalsik po ba ung nanay meron po bang kasong kriminal kung saan sya naconvict, kung tama ang pgkakaintindi ko 6 na taon ang lumipas bago siya namatay?..kung meron po anu pong mga kaso un?...kung wala naman po bakit po hindi siya naconvict, or anu po ang naging resulta ng kaso kung patay na ung nanay?...nais ko lang po lumawak ang aking kaalaman wag niyo po sana masamain ung tanong ko...",
  "date": "2016-11-20 00:00:01",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155106943493912#10155107392698912",
  "source_obj": {
    "id": "10155107392698912",
    "poster": "Francis Ed",
    "poster_url": "/edgabz29?refid=52&_ft_=mf_story_key.10155106943493912%3Atop_level_post_id.10155106943493912%3Atl_objid.10155106943493912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155106943493912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "parang nakakarelate po ako sa kwento....maaar i po bang magtanong?...nu ng pinatalsik po ba ung nanay meron po bang kasong kriminal kung saan sya naconvict, kung tama ang pgkakaintindi ko 6 na taon ang lumipas bago siya namatay?..kung meron po anu pong mga kaso un?...kung wala naman po bakit po hindi siya naconvict, or anu po ang naging resulta ng kaso kung patay na ung nanay?...nais ko lang po lumawak ang aking kaalaman wag niyo po sana masamain ung tanong ko...",
    "attachments": [],
    "date": "Nov 20, 2016",
    "replies": [
      {
        "id": "10155107407673912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Sa pagkakaalam ko, 3 taon lang ang lumipas bago siya namatay. Ang criminal conviction does not apply to the dead, only civil forfeiture",
        "attachments": [],
        "date": "Nov 20, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107423493912",
        "poster": "Jon Limjap",
        "poster_url": "/LaTtEX?__tn__=R",
        "text": "Hindi maaaring isakdal sa isang criminal case ang isang patay; pag namatay ang akusado, laglag ang lahat ng kanyang kaso.     Ang kahulugan n'un, hindi maaaring matagpuang nagkasala sa isang krimeng kabilang sa mga akto ng \"moral turpitude\" ang isang taong yumao na.    Ang pagpapatunay ng isang kasong kriminal na kabilang sa mga aktong may \"moral turpitude\" ang natatanging bagay na haharang sa paglibing ng isang yumao sa LNMB.",
        "attachments": [],
        "date": "Nov 20, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107470853912",
        "poster": "Francis Ed",
        "poster_url": "/edgabz29?__tn__=R",
        "text": "ah ipagpaumanhin niyo po 3yrs nga lang pla ung lumipas bago sya namatay...hindi  po ba siya nakasuhan ng kriminal sa loob ng 3taon?...    sa palagay niyo po ba, wala syang karapatang mahimlay sa lnmb kung mamarapatin ng kanyang pamilya?..bkit?",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107472238912",
        "poster": "Francis Ed",
        "poster_url": "/edgabz29?__tn__=R",
        "text": "wag niyo po sana masamain ang mga tanong ko, nais ko lang maunawaan ang mga bagay bagay...",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107523098912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "legal na legal po. at wala po talagang makakaalis ng karapatan na yun - lalo na't namatay yung kasambahay bago siya ma-convict.    sadyang tarantado lang talaga yung kasambahay na yun. at kung tunay kong mahal ang tahanan ko, di ko malilimutan mga kasamaan na ginawa niya habang naninilbihan pa siya sa bahay ko.    kahit saan pa siya ilibing.    pasensiya po, wag niyo sanang masamain yung sagot ko. nadala ako ng emosyon ko. at sa tahanan ko kasi ang katapatan ko - hindi sa kasambahay. pasensya na.",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107528053912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=CR",
        "text": "Walang masama sa maayos na pagtalakay ng mga pangyayari sa ating bansa, bakit naman ito mamasamain?    (Iiwanan ko na yung thinly-veiled allegory, since nabanggit na ang LNMB)    Sa aking palagay, ang paglibing ng dating pangulong Marcos sa Libingan ng mga Bayani ay taliwas sa ispirito ng batas na nagtaguyod sa LNMB.     Ayon sa republic act 289: \"To perpetuate the memory of all the Presidents of the Philippines, national heroes and patriots for the inspiration and emulation of this generation and of generations still unborn, there shall be constructed a National Pantheon which shall be the burial place of their mortal remains.\" Yung parte na \"for the inspiration and emulation of this generation and of generations still unborn\" ang pinakamahirap na iugnay sa dating pangulong Marcos.    Bagamat naglabas ng ruling ang ating Korte Suprema na hindi illegal ang utos ng ating kasalukuyang pangulo na ituloy ang libing, alam naman natin mula sa kasaysayan na ang isang bagay na legal ay hindi parating tama (See: Slavery, racism, apartheid, holocaust, etc).     Maaring simpleng pangalan lang ng sementeryo ang \"Libingan ng mga Bayani\", na para sa mga matatalinong kagaya natin ay alam natin na hindi nito ibig sabihin na lahat ng nakalibing dyan ay bayani, alam ng pamilya Marcos ang simbolismo ng paglibing dito ay magkakaron ng malaking epekto sa paghugas kamay ng kanilang pamilya sa mga krimen at abuso na nangyari nuong panahon ng dating pangulong Marcos. Mayroon akong mas mahabang pagtalakay sa paksang ito sa isang nakaraang post (Pero English na ha):  https://www.facebook.com/stephen.roy.tang/posts/1015510415085891 2    Re: yung mga kasong criminal, sa aking pagkakaalam meron namang mga kaso na finile, pero dahil (alam naman natin lahat na) mabagal ang proceso ng hustisya sa ating bayan (isang sa pinakamalaki nating problem hanggang sa kasalukuyang panahon) at ang pagnanais ng pangulong Cory Aquino na bigyan ng due process ang Marcoses at mga cronies, inabot ng madaming taon ang PCGG sa kanilang mga imbestigasyon. Isa talaga ito sa malaking pagkukulang ng mga sumunod na administration pagkatapos ang EDSA revolution.",
        "attachments": [
          {
            "url": "https://scontent.fmnl3-2.fna.fbcdn.net/v/t1.0-1/cp0/e15/q65/p32x32/92818738_10158355718528912_3562588141246218240_n.jpg?_nc_cat=102&_nc_sid=dbb9e7&efg=eyJpIjoiYiJ9&_nc_eui2=AeEaF2MwTPL_8vLDd1M6sJE6sNZ9GBri5luw1n0YGuLmW9wtlEgISTlmjvQhLH-4W7w&_nc_ohc=UYKBDpJqrLgAX9__JNH&_nc_ht=scontent.fmnl3-2.fna&_nc_tp=3&oh=d1e9e8a0e31f530e6c7f277a895aba5b&oe=5EF7C0D8",
            "downloaded": "D:\\temp\\stephen.roy.tang\\cache\\dls\\92818738_10158355718528912_3562588141246218240_n.jpg"
          }
        ],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107808688912",
        "poster": "Jon Limjap",
        "poster_url": "/LaTtEX?__tn__=R",
        "text": "Ed Gabon Nakasuhan naman siya, pero hindi pa ata nagsisimula ang paglilitis nang siya'y yumao. Nasa Amerika ang akusado, may sakit na lupus at hindi maiharap sa korte dito. Nang tuluyan siyang namatay, maski pa't nasimulan na ang isang paglilitis ay hindi na ito maipagpapatuloy  sa konklusyon, sa prinsipyong wala nang pagkakataon ang nasasakdal na ipagtanggol ang kanyang sarili, at wala nang tatanggap ng hatol at sentensya.     Hindi rin ito naimadali sapagkat napuno ang atensyon ng pamahalaan sa sunod-sunod na hamon sa istabilidad at survival nito. Di bababa sa sampung insidente ng pagaalsa at coup d'etat ang naganap sa loob ng apat na taon, mula 1986 hanggang 1990.    Sa pagpapatuloy ng mga paglilitis napatunayan sa iba't ibang pagkakataon na una, may tahasang paglabag sa karapatang pantao na sistematikong naganap, pinahintulutan at ginamit ng pamahalaang diktatoryal, at pangalawa, may malawakang pagnanakaw na naganap at nararapat na ibalik ang mga salaping nakamkam. Ang mga desisyon na ito ay naipanalo sa Pilipinas, sa US, at maging sa Switzerland, subalit civil cases na lamang ito laban sa Estate of the Late Ferdinand Marcos.",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107817743912",
        "poster": "Francis Ed",
        "poster_url": "/edgabz29?__tn__=R",
        "text": "marami pong salamat sa inyong pang unawa...napapan sin ko kasi sa panahon ngayun, kadalasan ng mga ganitong pgtalakay hindi nagiging mabuti ang kinalalabasan, nagkakaroon ng alitan at galit...bihira na ang matinong pagpapalitan ng opinion at kaalaman na may kapupulutan ng aral...    Hindi naman po sa maka marcos o aquino ako, ninanais ko lang balansihin kung anu man ang aking nalalaman sa kasalukuyan, ng sa gayon ay maunawan ko sa aking sarili ang mga ganitong usapin...    Ang pagkakaalam ko po kung ang isang tao ay may kasong kriminal, kinakailangan na itoy knyang sagutin kyat ngkakaroon ng subpoena...kung  si marcos ay nakasuhan ng kriminal, dapat ay pinauwi siya sa pilipinas para sagutin ang mga kasong ito sa bisa ng subpoena. Kung sakaling minarapat ni marcos na hindi pansinin ang subpoena at hindi dumalo sa pagdinig, maaari siyang hatulan ng korte pabor sa mga umuusig s knya. Sa pagkakaalam ko, ay ninais ni marcos na makabalik ng pilipinas, subalit ito ang isang bagay na hindi pinahintulutan ni Cory. Kaya maaaring hindi kinasuhan ng kriminal si marcos ng mga panahong iyon sapagkat ayaw ni Cory na bumalik siya ng pilipinas? Binuo ang PCGG upang habulin ang mga ill gotten wealth ng mga marcos, kinailangan itong daanin sa legal na paraan sapagkat ang malalaking perang ninakaw umano ay sa bangko ng ibang mga bansa nakadeposito. Ito po ay base lamang sa aking kaalaman.     Para sa akin, malaki ang pagkukulang ng mga sumunod na presidente, hindi lang para sa mga biktima ng martial law, kundi sa lahat ng pilipino.     Patungkol nmn po sa lnmb, salamat po sa inyong impormasyon tungkol sa republic act 289, at sa inyong interpretasyon sa hatol ng korte suprema. Para sa akin, mas malaki ang kasalanan ng mga sumunod na presidente kay marcos, lalo na si Pnoy...kung kanilang mamarapatin, maaari nilang amendahan/ linawin ang batas patungkol sa kwalipikasyon ng kung sino ang maaaring ilibing sa lnmb. Alam nila na taong 1992 pa lamang ay binalak na ng mga marcos ang pagpapalibing dito subalit wla silang ginawa upang baguhin ito. Ito ang isa sa mga hindi nakikita ng ibang pilipino.",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107847788912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Ang mga pagkukulang ng sumunod na administration ay hango sa negligence o di kaya at worst ay katangahan. Sa aking palagay, mas magaan na kasalanan yun kaysa yung sinadyang pagsamantalahan  ang taong bayan.     Magagalit ka pag nakalimutan ng kapatid mo na ilock ung bahay, pero hindi mo naman siguro iisipin na mas masama sya kesa sa mga magnanakaw na piniling pagsamantalahan  ung di nakalock na pinto di ba?",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107869523912",
        "poster": "Francis Ed",
        "poster_url": "/edgabz29?__tn__=R",
        "text": "sir  Roy, mas magagalit po ako kung alam ng kapatid ko na merong magnanakaw, na kumatok at ipinaalam na siyay magnanakaw ngunit wala siyang ginawa at hinayaan niyang manakawan ang aming tahanan sa kanya mismong harapan....mas masakit ito kung ihahambing ko sa rape....    Alam ko po na 1992 pa pinipilit ng mga marcos na malibing sa lnmb, alam ni fvr, ni erap, ni gma at ni pnoy...",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107878873912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "tama ka. sa ganyang sitwasyon, karapat dapat na magalit ka sa kapatid mo. pero yung mga pangulong binanggit mo, bagamat nakalimutan nilang ilock ung pinto, nakabantay naman sila dun sa bahay at di nila hinayaang makapasok yung magnanakaw. di naman nila akalain na magkakaron tayo ng pangulo na bukod sa hindi nilock ang pinto ay binuksan pa at winelcome ang mga magnanakaw dahil sinuportahan sya nung eleksyon. sa ganyang sitwasyon, maiintindihan ko talaga pag nagalit ka!",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107911488912",
        "poster": "Francis Ed",
        "poster_url": "/edgabz29?__tn__=R",
        "text": "sir Roy medyo nagdadalawang isip ako kung totoong nakabantay tlg sila...ang napapansin ko sa mga ngdaang presidente, sa harap lng sila magaling, pero sa likod hindi ka na sigurado kung gnun p din ba sila...isa pa sa katibayan ung yolanda, may kapamilya akong ksama sa nasalanta ng bagyo, at hindi tlg nila nagustuhan ang ginawa ni mar roxas, masasabi kong isa un sa dhilan kung bkt nanalo si duterte...",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107926818912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "well, sa kaso nung libing alam nating nakabantay sila kasi hindi naman natuloy nung kapanahunan nila. sa mga iba nilang pagkukulang, hindi na ata yun related sa alamat sa aking post. hindi tayo mauubusan ng paguusapan kung uungkatin natin dito lahat ng pagkukulang ng ating mga politiko (alam naman nating napakadami nyan), mabuti pang matulog na lang tayo. bagamat nagalak ako sa aking usapan ay alas tres na pala  :)",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155107933638912",
        "poster": "Francis Ed",
        "poster_url": "/edgabz29?__tn__=R",
        "text": "hahaha...salama t po..",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155108823098912",
        "poster": "Ralph Tribaco",
        "poster_url": "/ralpolipo?__tn__=R",
        "text": "Ed Gabon, sinasabi mo na may kasalanan yung mga nakaraang administrasyon dahil hindi nila na amendahan ang batas sa pagpapalibing kay Marcos sa LNMB. Malinaw sa argumento mo na pagbaling ng sisi sa mga nakaraang pangulo na hindi ka rin pabor sa pagpapalibing doon. Pero ni minsan hindi mo nabanggit ang pagpayag ng kasalukuyang administrasyon sa pagpapalibing kay Marcos sa LNMB. Pakilinaw kung po bakit ganoon. Kapag po ba galing kay Duterte ang desisyon tama na? Kasi ang pinahihiwatig ng mga sinabi mo eh hindi ka pabor pero noong si Duterte na ang nagpasya, hindi kana sumalungat.",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155108969448912",
        "poster": "Francis Ed",
        "poster_url": "/edgabz29?__tn__=R",
        "text": "Marami pong salamat sir Ralph sa inyong kumento.    Ang nais ko po sana ay makita ng iba na sapagkat ang mga Aquino, si FVR at Enrile ang naging \"mukha\" ng EDSA1, dapat minarapat nilang tulungan ng \"totoo\" ang mga biktima ng martial law, - isa sa mga ito ang gumawa ng batas na pipigil pra makabalik sa pwesto ang mga marcos, at ang mailibing sa lnmb si ferdinanand marcos, sapagkat ipinagkatiwala sa kanila ng sambayanan ang pamamalakad sa bansa, upang mabigyan ng hustisya at hindi na muli maulit ang martial law. Kung inyong pong susuriin, alam nila mula noong 1992 na ninanais ng mga marcos na doon maihimlay si fm.   Subalit aking ipinagtataka kahit isa sa mga nagrarally o media, walang bumanggit ng kapabayaan ng mga sumunod na umupo sa kapangyarihan. Bakit po kaya ganun?    Sa usapin naman po ukol kay Duterte, mula sa umpisa, makikita mo na ang kanyang supporta dito kayat hindi ko na pinagtakhan na nagyari ito. Hindi ko po sinasabi na tama ito, sapagkat magiging submissive ako, kasi ang \"tama\" ay nakadepende sa interpretasyon ng bumabasa at umiintindi nito - sa palagay ni Duterte tama siya ayon sa saligang batas, sa palagay naman ng iba tama sila ayon sa moral standard.    Sa ganitong sitwasyon, sa aking palagay, ay mas kailangan natin maintindihan ang bawat isa kaysa igiit natin kung sino ang tama at mali. Naintindihan ko kung anu ang inihayag ng mga naunang nagkumento, sa gayon ay inihayag ko rin ang aking kaisipan. At ako po ay natutuwa at hindi nila minasama ang aking mga pahayag.    Kung nais niyo pong malaman kung anu ang aking opinion sa usaping \"paghimlay kay FM sa LNMB\", ito po ang aking opinion:    May karapatan ang mga Marcos kung nanaisin nilang maihimlay si FM sa libingan ng mga bayani base sa kwalipikasyong nababatay alinsunod sa AFP. Pinagtibay lamang ito ng utos na inilabas ng korte suprema sapagkat walang batas na tumutuligsa dito. Tama bang igiit ng mga marcos ito? - marahil hindi, sapagkat marami ang tumutuligsa dito. Para sa akin mas makabubuti kung sa ibang libingan na lamang siya nahimlay.   Bakit po kaya hindi ako sumalungat? Ito po ay dahil sa ginagamit ng mga marcos ang saligang batas upang mgawa ang nais nila, at sa pagkakataong ito ay kinatigan sila ng korte suprema. Bakit po kaya hindi ako sumama sa rally? Sapagkat uulitin na naman nating maging disbalanse ang ating bansa, at lulubog na naman tyo sa kahirapan pag naulit pa ang EDSA1.",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155108994108912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Tama lang naman na basta may nakikita tayong pagkukulang sa mga ginagawa ng ating mga politiko ay ipapahiwatig natin ang ating pagtutol. Karapatan at tungkulin natin yan bilang mamamayang Pilipino. Tiwala lang na sa pagsulong natin ng tamang gawain at pagbatikos sa maling gawain ay unti-unti din natin maisusulong ang ating bayan.    Para lang sa akin, eto na nga at madami na nga tayong problema na hinaharap, sinasayang pa ng mga Marcoses ang oras ng bansa sa isang gawain na alam naman nilang madaming tututol (at nagkunsinti naman ang kasalukuyang pangulo) para malamang mahugasan ang bahid ng pamilya at baliktarin ang pagkahusga ng kasaysayan. Eto ay malaking hakbang paatras dahil pag pinilit mong limutin ng bayan ang mga abuso nung panahon ng dating pangulo at diktador, magiging mas madaling maulit ang mga pagkakamali ng nakaraan.    Minsanan na nga lang tayo makapagpatalsik  ng politikong umaabuso sa kapangyarihan at gusto pang hugasan ang kasaysayan nito. Madami na nga tayong nawaldas na pagkmakataon at nahihirapan tayong umabante pero gusto pang humakbang ng paatras!",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155109027338912",
        "poster": "Francis Ed",
        "poster_url": "/edgabz29?__tn__=R",
        "text": "Sang-ayon po ako sa inyo na tama lamang na ihayag natin ang ating kaisipian - hangat wala po tyong tinatapakan na karapatan ng ibang tao, malaya po tyong ihayag ang ating sarili.    Sa akin pong pananaw hindi lamang ito ang daan sa pagsulong sa kinabukasan. Kapag inulit natin ang EDSA1, malulugmok na naman tayo sa kahirapan. Suriin po ninyo kung anu ang nangyari sa panahon ni Cory, at sa history ng ibang bansa. Kasunod ng pagpapabagsak ng isang administrasyon ay magulo at mahirap na bansa. Kaya kong tanggapin na nanaig ang mga Marcos sa usapin ng pghihimlay kay FM sa libingan ng mga bayani, subalit hindi ko kyang tanggapin na muling maging distabilisado ang ating bansa. Nasasabi ko po ito sapagkat nakikita kong marami at madamdamin ang mga sumusuporta sa bawat panig : anti-marcos, marcos loyalist, anti-duterte, pro-duterte, at kung ang lahat ng ito ay mglabas ng kanilang damdamin, anu na ang mangyayari sa ating bansa? Sino ang higit na makikinabang?",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155109030963912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Tama ka na huwag nating hangaring ma destablisado ang bansa. Kaya dapat lang na maging mapagbantay tayo at wag kalimutan ang ating kasaysayan para hindi na maulit ang mga pagkakamali ng nakaraan",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155109034898912",
        "poster": "Francis Ed",
        "poster_url": "/edgabz29?__tn__=R",
        "text": "Marami pong salamat sa inyong pagsang-ayon. Ihayag po natin ang ating kaisipan sa isang maayos na paraan at naaayon sa ating karapatan.. 👍",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155109689558912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Marie Yssa Belle request lang po, ayaw ko po ng text-speak or jeje-speak sa mga thread ko. Nag-eencourage po ako ng diskusyon pero sana po maayos po ang pagtype natin. Kahit English or Tagalog ayos lang. Ok lang naman po magtake ng time sa pagcompose ng message, hindi naman tayo nagmamadali sa diskusyon.    Si Cory Aquino may declared policy na gusto nya dumaan sa due process ang lahat ng mga akusasyon laban sa mga Marcoses at kanilang mga crony kaya sadyang mabagal ang mga proceso dahil nga sa mga pagkukulang ng ating sistemang judicial. Ayaw kasi nya maging vindictive, medyo naive talaga.     Hindi ko po alam kung ano po yung sinasabi ninyo na \"totoo\", kung maari nyo pong ipaliwanag at meron po kayong verifiable source tungkol diyan ay handa po akong basahin.",
        "attachments": [],
        "date": "Nov 21, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155124117253912",
        "poster": "PSSAP Underground Media",
        "poster_url": "/PSSAP-Underground-Media-526965450801338/?__tn__=CR",
        "text": "mga kaibigan, isa po ito sa mga videos na nakita ko, dahilan upang mabuo sa aking isipan na hindi talaga naghain ng kasong kriminal noong buhay pa si Marcos - isang patunay ang nais ni Marcos na umuwi upang makadalo sa libing ng kanyang ina subalit ipinagkait ito sa kanya ni Cory Aquino:     https://www.facebook.com/526965450801338/videos/696792100485338/",
        "attachments": [
          {
            "url": "https://scontent.fmnl3-2.fna.fbcdn.net/v/t1.0-1/cp0/e15/q65/c0.0.32.32a/p32x32/12143106_526967884134428_185101845233366842_n.jpg?_nc_cat=108&_nc_sid=dbb9e7&efg=eyJpIjoiYiJ9&_nc_eui2=AeHH2t9zr7c39imaZa9E-ZJ6BkmitKNF8-gGSaK0o0Xz6DeGOi2YpwVKrOkzBEWhMc4&_nc_ohc=y8WrDL_ScvUAX_YaGFC&_nc_ht=scontent.fmnl3-2.fna&_nc_tp=5&oh=77a86c36983a27bf5798a9e1e3a7fda6&oe=5EF65C69",
            "downloaded": "D:\\temp\\stephen.roy.tang\\cache\\dls\\12143106_526967884134428_185101845233366842_n.jpg"
          },
          {
            "url": "https://scontent.fmnl3-1.fna.fbcdn.net/v/t15.5256-10/cp0/e15/q65/s350x350/14926507_696792647151950_8964175841487486976_n.jpg?_nc_cat=103&_nc_sid=08861d&efg=eyJpIjoiYiJ9&_nc_eui2=AeF4QU5jY52_DX7UU1vHUjKfhbjI1slWbH6FuMjWyVZsfr8qxBBssOwN4-JslUMD-6o&_nc_ohc=ec4VpxG5hnsAX-JK2Zv&_nc_ht=scontent.fmnl3-1.fna&_nc_tp=9&oh=6fcc91d1fac1a2a645e77167ddbae321&oe=5EF6FD16",
            "downloaded": "D:\\temp\\stephen.roy.tang\\cache\\dls\\14926507_696792647151950_8964175841487486976_n.jpg"
          }
        ],
        "date": "Nov 27, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155124565763912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Ayaw talaga siya pauwiin ni Cory. Ang pumayag na umuwi sya ay si pangulong FVR, pagkatapos nang mamatay nung dating diktador at mandarambong, sa kundisyon na agad-agad siyang ilibing na sa Ilocos, isang kasunduan na hindi nila tinupad.    Hindi ko naiintindihan bakit mo brini-bring up yung posibilidad na hindi naghain ng kasong kriminal ang pangulong Cory Aquino laban dun sa dating diktador at mandarambong. Sabihin nating totoo nga na walang naghain ng kaso nung tatlong taon na nasa exile pa sya (hindi ko alam kung may nahain ba talaga o wala, or kung ano yung rason for the delay), what does that change, how is it relevant, bukod sa either pagkukulang or katangahan yun ni Cory? Alam pa rin naman natin na laganap ang abuso nung panahon ng Martial Law at alam pa rin natin na madami silang ninakaw na pera sa kaban ng bayan (dahil nahusgahan na sila ng civil forfeiture nung ill-gotten wealth at nahusgahan na rin na award-an ng pera ang mga biktima ng Martial Law), bukod pa sa mga published na libro at pag-aaral na nagcocover sa mga krimen ng diktador at mandarambong na si Marcos. Ang nahahalata ko lang (lalo sa caption nung above na video) is that talagang may seryosong effort na magkalat ng pagdududa sa mga krimen ng dating diktador, kaya talaga importante sa kanila ang mailibing sya dyan sa LNMB",
        "attachments": [],
        "date": "Nov 27, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155124662613912",
        "poster": "Arthur Abon",
        "poster_url": "/arthur.abon?__tn__=R",
        "text": "Di man sila gumawa ng batas na nagbabawal sa paglibing ni Marcos na LNMB, di rin naman sila pumayag na gawin ito sa termino nila.",
        "attachments": [],
        "date": "Nov 27, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155124663373912",
        "poster": "Arthur Abon",
        "poster_url": "/arthur.abon?__tn__=R",
        "text": "I think ang pagsabi ng hindi at pag-oo ay parehong aksiyon?",
        "attachments": [],
        "date": "Nov 27, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155124663723912",
        "poster": "Francis Ed",
        "poster_url": "/edgabz29?__tn__=R",
        "text": "ang kumento ko ay supporta sa mga nauna kong payahag, iyon ang aking tinutumbok...an g pagkakaroon ng kasong kriminal ang isa sa mga daan na maaaring katigan ng korte suprema upang mapigil ang pghihimlay sa LNMB, un ang punto!..    Hindi ko sinabing walang umabuso noong panahon ng martial law. kung nais mong maunawaan ang kabilang panig, buksan mo ang iyong isipan at maging mapanuri...wala  akong sinabi na tama lahat ang mga nangyari, ang nais ko lang ihayag ang ilang mga bagay na wala sa libro, sa pahayagan at commentaryo.    It's up to you to determine...",
        "attachments": [],
        "date": "Nov 27, 2016",
        "replyto": "10155107392698912"
      },
      {
        "id": "10155124665803912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Ako, personally, hindi ko naman kinikwestyon ang desisyon ng korte. Kung sinabi nilang legal e di legal (although sana nag-antay nung MR). Legal din namang kumain nang tae, pero kung gagawin mo ito, pipigilan pa rin kita  :D",
        "attachments": [],
        "date": "Nov 27, 2016",
        "replyto": "10155107392698912"
      }
    ]
  }
}