{
  "id": "7bb1a79d-4b4f-474b-b4fb-6b7ad5f63a14",
  "name": "Jon Limjap",
  "url": "https://www.facebook.com/LaTtEX",
  "text": "Ed Gabon Nakasuhan naman siya, pero hindi pa ata nagsisimula ang paglilitis nang siya&#x27;y yumao. Nasa Amerika ang akusado, may sakit na lupus at hindi maiharap sa korte dito. Nang tuluyan siyang namatay, maski pa&#x27;t nasimulan na ang isang paglilitis ay hindi na ito maipagpapatuloy  sa konklusyon, sa prinsipyong wala nang pagkakataon ang nasasakdal na ipagtanggol ang kanyang sarili, at wala nang tatanggap ng hatol at sentensya.     Hindi rin ito naimadali sapagkat napuno ang atensyon ng pamahalaan sa sunod-sunod na hamon sa istabilidad at survival nito. Di bababa sa sampung insidente ng pagaalsa at coup d&#x27;etat ang naganap sa loob ng apat na taon, mula 1986 hanggang 1990.    Sa pagpapatuloy ng mga paglilitis napatunayan sa iba&#x27;t ibang pagkakataon na una, may tahasang paglabag sa karapatang pantao na sistematikong naganap, pinahintulutan at ginamit ng pamahalaang diktatoryal, at pangalawa, may malawakang pagnanakaw na naganap at nararapat na ibalik ang mga salaping nakamkam. Ang mga desisyon na ito ay naipanalo sa Pilipinas, sa US, at maging sa Switzerland, subalit civil cases na lamang ito laban sa Estate of the Late Ferdinand Marcos.",
  "date": "2016-11-21 00:01:46",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155106943493912#10155107808688912",
  "source_obj": {
    "id": "10155107808688912",
    "poster": "Jon Limjap",
    "poster_url": "/LaTtEX?__tn__=R",
    "text": "Ed Gabon Nakasuhan naman siya, pero hindi pa ata nagsisimula ang paglilitis nang siya'y yumao. Nasa Amerika ang akusado, may sakit na lupus at hindi maiharap sa korte dito. Nang tuluyan siyang namatay, maski pa't nasimulan na ang isang paglilitis ay hindi na ito maipagpapatuloy  sa konklusyon, sa prinsipyong wala nang pagkakataon ang nasasakdal na ipagtanggol ang kanyang sarili, at wala nang tatanggap ng hatol at sentensya.     Hindi rin ito naimadali sapagkat napuno ang atensyon ng pamahalaan sa sunod-sunod na hamon sa istabilidad at survival nito. Di bababa sa sampung insidente ng pagaalsa at coup d'etat ang naganap sa loob ng apat na taon, mula 1986 hanggang 1990.    Sa pagpapatuloy ng mga paglilitis napatunayan sa iba't ibang pagkakataon na una, may tahasang paglabag sa karapatang pantao na sistematikong naganap, pinahintulutan at ginamit ng pamahalaang diktatoryal, at pangalawa, may malawakang pagnanakaw na naganap at nararapat na ibalik ang mga salaping nakamkam. Ang mga desisyon na ito ay naipanalo sa Pilipinas, sa US, at maging sa Switzerland, subalit civil cases na lamang ito laban sa Estate of the Late Ferdinand Marcos.",
    "attachments": [],
    "date": "Nov 21, 2016",
    "replyto": "10155107392698912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10155106943493912#10155107528053912"
}