{
  "id": "61916ac0-2065-412d-922d-718b6fe6b22d",
  "name": "hungryroy",
  "url": "https://www.reddit.com/u/hungryroy",
  "text": "Thank you for replying! Some follow-ups, if I may:\n\n&#x200B;\n\n>Three words. Geopolitical Power Play\n\nShould I take this to mean you are okay with his tolerance of China's taking over our islands?\n\n&#x200B;\n\n>Why the hell would I convince you to support him? I can only present from my own perspective and that's about it. It's you who should decide whether you support him or not.\n\nI'm not expecting you to be able to convince me. For me, the purpose of this exercise is to foster more understanding across divides; maybe you have something you can say that would be able to convince the skeptics to support the president or at least improve their appreciation of him. It's okay if you don't have any such statement. But would you not think it's important for Filipinos to have a better understanding of where our fellow citizens are coming from? Or convincing other people to understand your perspective better is not a priority for you? This part is not a criticism - you have certainly been generous with your replies; but I have observed that few people are willing to reach out to those they tag as \"dilawan\" etc to explain their POV, so I wonder if people just don't care about that kind of thing.\n\n&#x200B;\n\n\\>  What would be a dealbreaker for you\n\nWould you have a response for this part?\n\n&#x200B;\n\n\\>  Ugh. As I said. Everyone is in cahoots for political favors. It always has been.\n\nGiven this and some other things in your response, my main takeaway is that you believe that Duterte is just being honest with how things are in reality, and that the issues people have with him are issues that would be true regardless of whoever is in power. Would this be accurate?\n\n&#x200B;\n\nIf the above is accurate, do you think we (as a country) deserve better? Would it be better to have leadership that does not use rhetoric to glorify the bad things about our reality?",
  "date": "2019-05-15 16:36:26",
  "photo": null,
  "source_url": "https://www.reddit.com/r/Philippines/comments/botnry/are_there_real_admin_supporters_here_on_rph/enmxkb9/",
  "source": "reddit",
  "reply_to": "https://www.reddit.com/r/Philippines/comments/botnry/are_there_real_admin_supporters_here_on_rph/enmp589/"
}