{
  "id": "8048a791-961e-4d1f-9f50-4e15f7368f7e",
  "name": "la_yker",
  "url": "https://www.reddit.com/u/la_yker",
  "text": "> how do you feel about the way the admin is handling our relationship with China?\n\nThree words. Geopolitical Power Play\n\n\n> how do you feel about the alliances with known or perceived corrupt politicos/families like the Marcoses or GMA?\n\nNeutral. Since everyone is in cahoots with anyone who already has dirt in the system.\n\n\n> how do you feel about the way the president plays fast and loose with the facts, pulls out allegations out of nowhere without explanation, attacks the press, the church, etc\n\nRefer to my last answer.\n\n\n> how do you feel about the death of Kian? do you think such abuses by the cops are common or rare?\n\nNothing. It's an unprecedented consequence anyway from Duterte's rhetoric, the police are gung-ho due to the fact that they thought Duterte gave them a free pass. In our history alone? Common. Way before it was even called the P.N.P.\n\n\n> do you think the senate should remain independent? do you think it will?\n\nUgh. As I said. Everyone is in cahoots for political favors. It always has been.\n\n\n> My top 3 issues with Duterte are: (a) encouragement of a culture of violence; and (b) support for GMA and the Marcoses; (c) apparent willingness to submit to the Chinese govt. For me the vast number of killings (including those done by vigilantes and those of cops trying to fill quotas, imagined or otherwise, and those of innocents) is completely unacceptable. Is there something you can tell me to convince me to support him?\n\n(a) His mouth encourages violence when it's the other way round in reality. The only difference is the rhetoric is used as an excuse to do such violence. Violence has no need of words. People down south just do it.\n\n(c) The past administration was willing to be a yes-man to the Americans. What makes this so different? I can only see power play and a good use of it. I liked how it's played out.\n\nRe:killings, wasn't this also the case even in the past? Not just Duterte. I will be surprised if people tell me it's only happening now. As if they completely forgot digging our own history.\n\nWhy the hell would I convince you to support him? I can only present from my own perspective and that's about it. It's you who should decide whether you support him or not.\n\n\n> How do you feel about the liberal party? If you hate them, why? I personally feel they are no more worse than other poltical parties like the NPC, Lakas-CMD, PDP-LABAN etc\n\nIn what timeline of the liberal party's existence are you referring to?\n\n\n> do you feel like the opposition candidates were not qualified to be senators?\n\nI can only agree on certain aspirants for certain matters. Other than the fact that the Yellow Cult as what the mainstream supporters are referring to are in cahoots with the Reds. There's nothing I hate more than the communist filth of old.\n\n\n> Have there been instances that made you doubt your support for the administration?\n\nDoubt? No. It doesn't surprise me at all. Same old, same old.\n\n\n> What would be a dealbreaker for you, i.e. something this administration would do that would end your support? In my opinion, the president has personally expressed support and/or tolerance for murder, lying, planting evidence, suppressing the press, political dynasties, vote-buying, making allegations without proof, and so on, so I find it difficult to imagine what could be worse than all of these.\n\nAll you said is his rhetoric. I laughed it out every single time saying to myself he's complete gone mad. I find it difficult that most people can't discern his way of sarcasm, a southern flavor. There's truth to it. It's no different from the past because it was only discreet. I'm surprised people are getting woke now and only pointing fingers in this administration when the ones in past should also be liable. He just made people realize that it's the cultural norm. Hypocrisy. Every. Single. One. No exceptions.",
  "date": "2019-05-15 15:44:43",
  "photo": null,
  "source_url": "https://www.reddit.com/r/Philippines/comments/botnry/are_there_real_admin_supporters_here_on_rph/enmp589/",
  "source": "reddit"
}