{
  "id": "bb2f9f7e-cbcd-4ed3-9c3c-947fc4fc9ee7",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "Mmm. The car part of your plan is okay, except it punishes the middle class. Those with the money can ignore it, essentially, at little cost. It really only reduces the volume of families that can only afford to keep one old car going, borderline middle class families.     The biggest thing that would help is an extensive rail system like NY&#x27;s subway (or the London tube, or Tokyo), where there are stations every few blocks and many crisscrossing lines and transfer points for extensive coverage, but it would take decades and cost billions. But in building it, we could also vastly improve the drainage system for the entire Metro Manila area (because we&#x27;d need it to keep the trains from being out of service for the entire rainy season), so it would be a dual-purpose public works project.    In the near term, there are just no easy solutions  =P",
  "date": "2013-07-11 00:00:00",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10152338298388912#10152338307863912",
  "source_obj": {
    "id": "10152338307863912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&refid=52&_ft_=mf_story_key.10152338298388912%3Atop_level_post_id.10152338298388912%3Atl_objid.10152338298388912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10152338298388912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Mmm. The car part of your plan is okay, except it punishes the middle class. Those with the money can ignore it, essentially, at little cost. It really only reduces the volume of families that can only afford to keep one old car going, borderline middle class families.     The biggest thing that would help is an extensive rail system like NY's subway (or the London tube, or Tokyo), where there are stations every few blocks and many crisscrossing lines and transfer points for extensive coverage, but it would take decades and cost billions. But in building it, we could also vastly improve the drainage system for the entire Metro Manila area (because we'd need it to keep the trains from being out of service for the entire rainy season), so it would be a dual-purpose public works project.    In the near term, there are just no easy solutions  =P",
    "attachments": [],
    "date": "Jul 11, 2013"
  }
}