{
  "id": "a08d7ea5-cb17-4a50-91a7-0a332491a5cd",
  "name": "Oliver Quiray",
  "url": "https://www.facebook.com/oliver.quiray",
  "text": "1. community     2. tbbt     3. (tied) chuck, goldbergs, silicon valley, brooklyn 9-9, kevin can wait, veep, superior donuts, you&#x27;re the worst, man with a plan, crazy ex-gf, growing pains, will and grace, charles in charge, wonder years, IT crowd, 2 broke girls, doogie howser, happy endings, better off ted, good place, outsourced, ben and kate, izombie, new girl, white collar, sta clarita diet, undeclared, librarians, superstore, impastor, apartment 23, eureka, house of lies, go on, odd couple, dr ken, powerless, ted, great indoors    -di pwedeng tanggalin yung mga tied, kasi na-enjoy ko mga ito once upon a time. yung iba hindi situational, pero comedy pa rin all the same",
  "date": "2017-06-28 00:00:17",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155790578278912#10155800829313912",
  "source_obj": {
    "id": "10155800829313912",
    "poster": "Oliver Quiray",
    "poster_url": "/oliver.quiray?refid=52&_ft_=mf_story_key.10155790578278912%3Atop_level_post_id.10155790578278912%3Atl_objid.10155790578278912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155790578278912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "1. community     2. tbbt     3. (tied) chuck, goldbergs, silicon valley, brooklyn 9-9, kevin can wait, veep, superior donuts, you're the worst, man with a plan, crazy ex-gf, growing pains, will and grace, charles in charge, wonder years, IT crowd, 2 broke girls, doogie howser, happy endings, better off ted, good place, outsourced, ben and kate, izombie, new girl, white collar, sta clarita diet, undeclared, librarians, superstore, impastor, apartment 23, eureka, house of lies, go on, odd couple, dr ken, powerless, ted, great indoors    -di pwedeng tanggalin yung mga tied, kasi na-enjoy ko mga ito once upon a time. yung iba hindi situational, pero comedy pa rin all the same",
    "attachments": [],
    "date": "Jun 28, 2017"
  }
}