{"id": 45633380, "name": "Michael Gardner", "url": "https://stackoverflow.com/users/1630893/michael-gardner", "text": "Based on the instructions you referenced, it looks like you are using immediate replication, which will replicate any new/updated records in your database, but will not replicate existing records.\r\n\r\nTo enable replication of existing documents in the database (0 Day documents), you will need to change the replication setting from immediate push to scheduled task in the Flexible Replication Target configuration page ( **Databases > [database name] > Flexible Replication > Domain > [domain name] > [target name] : Summary** )\r\n\r\nAt the bottom of the page there you will see the ***immediate push*** option, which is *true* by default.  If you set it to **false**, then the replication will be handled by the push-local-forest process, and it will start to pickup the 0 Day documents.\r\n\r\nAs for increasing the rate at which documents will replicate from the source to the target, the primary setting is **Documents Per Batch**.  The guidance I've heard on this is to increase the value, while watching the execution time of the push-local-forest.xqy process ( **Configure > Groups > [group name] > Task Server: *Status*** and click *show more* button; or *http://servername:8002/dashboard* on the *Query Execution* tab).\r\n\r\nTypically the *push-local-forest* process runs every minute, so you want to make sure that your batch size is optimized to be able to complete within that minute, otherwise you can run into situations where the next *push-local-forest* process will start before the first has finished, and they have the potential to start stacking up and dead locking.\r\n\r\nOther tips for increasing the throughput is to reduce the number of indexes on the target (if possible), and/or use a VLAN with jumbo frames for the inter-cluster communication.", "date": "2017-08-11 10:49:25", "photo": "https://i.stack.imgur.com/QENPz.jpg?s=128&g=1", "source_url": "https://stackoverflow.com/questions/45623599/marklogic-flexible-replication", "mention_url": "https://stackoverflow.com/questions/45623599/marklogic-flexible-replication", "source": "stackexchange"}