{
  "id": "202ae0ee-931a-4136-b908-31f28039d521",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "As there are different campuses in different places, it would be more sensible for them to be state-funded.    Though, it really depends on how federal the federalism really is.    The &#x27;real&#x27; federal countries are federal because historically they were separate areas that were unified, so there&#x27;s a thing of state&#x27;s rights where they try to hold as much power as possible with the states and minimize federal powers, with the federal powers increasing in lurches based on case to case historical happenings.    For a country that arbitrarily becomes federal, like we would be, it is completely whatever TF the new constitution says.    We can have a national police system or we can have no national police and every state has its own police or have national and state police with all the jurisdictional headaches that entails. States could hypothetically have their own laws (and thus require their own state specific licensure exams and all the other ensuing consequences) or we could still have a completely nationalized system of laws. States could have the power of taxation or they could be allocated a budget from national taxes that&#x27;s under state government control.",
  "date": "2018-03-05 00:00:01",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10156467835138912#10156467857378912",
  "source_obj": {
    "id": "10156467857378912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&refid=52&_ft_=mf_story_key.10156467835138912%3Atop_level_post_id.10156467835138912%3Atl_objid.10156467835138912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10156467835138912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "As there are different campuses in different places, it would be more sensible for them to be state-funded.    Though, it really depends on how federal the federalism really is.    The 'real' federal countries are federal because historically they were separate areas that were unified, so there's a thing of state's rights where they try to hold as much power as possible with the states and minimize federal powers, with the federal powers increasing in lurches based on case to case historical happenings.    For a country that arbitrarily becomes federal, like we would be, it is completely whatever TF the new constitution says.    We can have a national police system or we can have no national police and every state has its own police or have national and state police with all the jurisdictional headaches that entails. States could hypothetically have their own laws (and thus require their own state specific licensure exams and all the other ensuing consequences) or we could still have a completely nationalized system of laws. States could have the power of taxation or they could be allocated a budget from national taxes that's under state government control.",
    "attachments": [],
    "date": "Mar 5, 2018"
  }
}