{
  "id": "3b6d6adb-0558-44c2-9f41-0efd7ad48701",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "Ohh, for movies. For movies, they&#x27;ll just ignore it and say &quot;The explanation&#x27;s in the comics.&quot;  =P    ----spoiler for others----    It&#x27;s been a while since I&#x27;ve seen it, but I kinda felt like they didn&#x27;t draw out the drama of Erik&#x27;s confrontation with Shaw well. The guy was in a room surrounded by metal. Erik should have peeked in, seen he was there, sealed off all the exits and squashed him like a bug. This is after Erik was skilled and strong enough to lift the enormous tonnage of the sub right into the air; turning the entire secret room into a trash-compactor  would have been trivial.    And if he really had to do the dramatic screw-you speech, he could have just stopped once Shaw was encased in 10 tons of steel and then opened a little window to gloat through.",
  "date": "2013-04-06 00:00:03",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10152178706118912#10152178754183912",
  "source_obj": {
    "id": "10152178754183912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&refid=52&_ft_=mf_story_key.10152178706118912%3Atop_level_post_id.10152178706118912%3Atl_objid.10152178706118912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10152178706118912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Ohh, for movies. For movies, they'll just ignore it and say \"The explanation's in the comics.\"  =P    ----spoiler for others----    It's been a while since I've seen it, but I kinda felt like they didn't draw out the drama of Erik's confrontation with Shaw well. The guy was in a room surrounded by metal. Erik should have peeked in, seen he was there, sealed off all the exits and squashed him like a bug. This is after Erik was skilled and strong enough to lift the enormous tonnage of the sub right into the air; turning the entire secret room into a trash-compactor  would have been trivial.    And if he really had to do the dramatic screw-you speech, he could have just stopped once Shaw was encased in 10 tons of steel and then opened a little window to gloat through.",
    "attachments": [],
    "date": "Apr 6, 2013"
  }
}