{
  "id": "28d95645-d16e-4fc2-9e2e-6f0bd32d3360",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "Bill Gates money? Let&#x27;s see. 2014, according to Forbes, Gates is at $80 billion. That&#x27;s 3.2 trillion pesos.    1) It&#x27;s not just buy the bus companies, it&#x27;s buy all the transportation companies: taxis, buses, the LRT/MRT.    2) Integrate existing transpo so everything can be paid with a single card. Optimize travel times, add GPS and internal cameras (for security and passenger safety--cameras  also prevent bullshit tickets from the MMDA) to all taxis and buses, prevent lots of buses idling waiting for commuters, and near empty buses in motion. Integrate apps that allow people to use cell phones to call a taxi to his/her location. This doesn&#x27;t require too much time, it&#x27;s relatively small upgrades. Gradually convert all buses and taxis to electric as electric charging stations are set up at the various PUV terminals throughout the city.    3) Build a series of giant storm drains throughout Metro Manila to handle the flooding. Build levees to protect the coast of Metro Manila. I&#x27;m not a hydrologist, but I imagine the storm drains can be directed to an artificial catchment basin that will also have to be built.    4) Step 3 allows for the construction of a large subway system with multiple crisscrossing and parallel lines.    3&amp;4 take years, but 1&amp;2 are relatively fast.    Less legal expenditures: buy a majority of senators, congressmen, judges and cops so you can pay them to do their f&#x27;ing jobs. Destroy those that are too greedy. Buy all newspapers, news channels, etc, so that the media can be directed to reveal whatever is necessary or win the public with propaganda for difficult projects (like the giant storm drains + levees + pump system required to keep the city from flooding), or to prevent anyone from cracking the transportation monopoly that is being set up.    This includes putting surveillance on as many politicians and high ranking officials as possible. Possibly, use purchased politicians to institute zero privacy government service facilities--all  areas where ordinary citizens come into contact with govt employees are continuously monitored by the same camera system used in Las Vegas casinos to look for cheaters.    Longer term: pay for a giant STEM facility with scholarships for students + giant enough salaries to attract top class staff from other countries + give them large budgets so they can buy the toys they want for their labs. Integrate the school with a series of actual factories, fabrication plants, etc, so it goes school-&gt;researc h-&gt;product. All technologies developed by students are automatically licensed to the facility for 10 years for 10% of profits, after which point full control of the patents revert to the graduates.     After the huge initial dump of capital expenditures, Roy Tang with Gates money makes back much more than he spent after 15ish to 20 years. Becomes King of the Philippines.",
  "date": "2014-12-13 00:00:11",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10153411694413912#10153412046878912",
  "source_obj": {
    "id": "10153412046878912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&refid=52&_ft_=mf_story_key.10153411694413912%3Atop_level_post_id.10153411694413912%3Atl_objid.10153411694413912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10153411694413912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Bill Gates money? Let's see. 2014, according to Forbes, Gates is at $80 billion. That's 3.2 trillion pesos.    1) It's not just buy the bus companies, it's buy all the transportation companies: taxis, buses, the LRT/MRT.    2) Integrate existing transpo so everything can be paid with a single card. Optimize travel times, add GPS and internal cameras (for security and passenger safety--cameras  also prevent bullshit tickets from the MMDA) to all taxis and buses, prevent lots of buses idling waiting for commuters, and near empty buses in motion. Integrate apps that allow people to use cell phones to call a taxi to his/her location. This doesn't require too much time, it's relatively small upgrades. Gradually convert all buses and taxis to electric as electric charging stations are set up at the various PUV terminals throughout the city.    3) Build a series of giant storm drains throughout Metro Manila to handle the flooding. Build levees to protect the coast of Metro Manila. I'm not a hydrologist, but I imagine the storm drains can be directed to an artificial catchment basin that will also have to be built.    4) Step 3 allows for the construction of a large subway system with multiple crisscrossing and parallel lines.    3&4 take years, but 1&2 are relatively fast.    Less legal expenditures: buy a majority of senators, congressmen, judges and cops so you can pay them to do their f'ing jobs. Destroy those that are too greedy. Buy all newspapers, news channels, etc, so that the media can be directed to reveal whatever is necessary or win the public with propaganda for difficult projects (like the giant storm drains + levees + pump system required to keep the city from flooding), or to prevent anyone from cracking the transportation monopoly that is being set up.    This includes putting surveillance on as many politicians and high ranking officials as possible. Possibly, use purchased politicians to institute zero privacy government service facilities--all  areas where ordinary citizens come into contact with govt employees are continuously monitored by the same camera system used in Las Vegas casinos to look for cheaters.    Longer term: pay for a giant STEM facility with scholarships for students + giant enough salaries to attract top class staff from other countries + give them large budgets so they can buy the toys they want for their labs. Integrate the school with a series of actual factories, fabrication plants, etc, so it goes school->researc h->product. All technologies developed by students are automatically licensed to the facility for 10 years for 10% of profits, after which point full control of the patents revert to the graduates.     After the huge initial dump of capital expenditures, Roy Tang with Gates money makes back much more than he spent after 15ish to 20 years. Becomes King of the Philippines.",
    "attachments": [],
    "date": "Dec 13, 2014"
  }
}