{
  "id": "f4e2ad6f-15a1-4b50-b262-a3f3a7412fe9",
  "name": "Roy Tang",
  "url": "https://www.facebook.com/stephen.roy.tang",
  "text": "Well, I can't change the definition that either you or the president have for the words \"proven\" and \"competent\", so we can just leave that at that. (I am not competent to comment on the legal aspect of the term \"jurisdiction\", so I make my judgment on the layman understanding that it has been proven as such in a court of law, such as it is)  The systems we have in place are far too easy to overcome for people like the Marcoses and their allies (something that current and past administrations have done nothing about as far as I can tell). There is a significant possibility that no legal judgment in this country will ever come down upon the Marcoses, all we have left are the memories of their abuses. All the more reason for the topmost government official to not be issuing statements in support of their historical revisionism.  I'm not dismissing everything he says, only the things that are outright hypocritical. To use the words \"not yet proven by a competent court\" when referring to allegations against the family of his political allies, but at the same time to willy-nilly throw out allegations against those he has deemed as enemies of his so-called \"drug war\" is something I have no qualms about criticizing. Yung American massacre nga from a hundred years ago cinicite ng presidente even though abuses there have not been \"proven by a competent court\" AFAIK, simply because he's ticked off at US criticism. If you want to cite a disconnect between \"rule of law\" and \"rule of emotion\", you don't have to look very far, the best example is right there at the very top, making great example speeches every day",
  "date": "2016-11-11 10:35:00 +0800",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155075434033912#10155080330358912",
  "source": "facebook",
  "spam": false,
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10155075434033912#10155078346288912"
}