{
  "id": "156df634-0fe1-4228-a852-d7811c8bad86",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "Watched Star Wars movie, went home, ate taho.    Yes, Rogue 1 was great, and better than TFA. There&#x27;s a plus to being freed from the Skywalker saga. I hope they feel free to do some other cool stories that don&#x27;t have to do with the Jedi.    The uncanny valley moments--it&#x27;s getting closer. What do you think, 5 more years, or 10 more years before SFX clears it?",
  "date": "2016-12-17 00:00:05",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155193559958912#10155193627988912",
  "source_obj": {
    "id": "10155193627988912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&refid=52&_ft_=mf_story_key.10155193559958912%3Atop_level_post_id.10155193559958912%3Atl_objid.10155193559958912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155193559958912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Watched Star Wars movie, went home, ate taho.    Yes, Rogue 1 was great, and better than TFA. There's a plus to being freed from the Skywalker saga. I hope they feel free to do some other cool stories that don't have to do with the Jedi.    The uncanny valley moments--it's getting closer. What do you think, 5 more years, or 10 more years before SFX clears it?",
    "attachments": [],
    "date": "Dec 17, 2016",
    "replies": [
      {
        "id": "10155193631548912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "I found out that deads na pala actor ni Tarkin and CG'ed in na lang sya. Kaya pala he looked a bit off. Uncanny valley is very, very close to being traversed I think. 5 years may be too much.",
        "attachments": [],
        "date": "Dec 17, 2016",
        "replyto": "10155193627988912"
      },
      {
        "id": "10155193644303912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "I don't know--it's not detail anymore that's causing it, so just adding higher quality texture won't do it. It's something in the movements under the skin. I don't think straightforward  hardware and software improvements will take it the rest of the way.    Although who knows, maybe they just need to do some mocap with tissue penetrating lasers that can read the muscles underneath the skin of an actor doing expressions and it'll be right there next year.",
        "attachments": [],
        "date": "Dec 17, 2016",
        "replyto": "10155193627988912"
      },
      {
        "id": "10155193647788912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Think about facial recognition software that can recognize expressions/ emotions. From there, some sort of neural net that can extrapolate to a full range of expression",
        "attachments": [],
        "date": "Dec 17, 2016",
        "replyto": "10155193627988912"
      },
      {
        "id": "10155193651283912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "Yeah, I guess they could just read in a massive amount of expression data. That would be interesting if they can eventually make a system that can read in all of a dead actor's scenes over his career and reconstruct his face and expressions perfectly. Well, wouldn't need to be an actor--could be anybody if there's enough film of them, so public figures.",
        "attachments": [],
        "date": "Dec 17, 2016",
        "replyto": "10155193627988912"
      },
      {
        "id": "10155193749758912",
        "poster": "Maui Listana",
        "poster_url": "/maui.listana?__tn__=R",
        "text": "Kaya pala. i thought i just remembered wrong that peter cushing died already. Galing pa din ha. Mas cold pagkaportray sa kanya sa rogue 1.i thought it was because of age  :P",
        "attachments": [],
        "date": "Dec 18, 2016",
        "replyto": "10155193627988912"
      },
      {
        "id": "10155194954153912",
        "poster": "Kenneth Flores",
        "poster_url": "/kennethmflores?__tn__=R",
        "text": "Roy  I've been wondering about that throughput the movie. I thought he looked good for an old guy but kept thinking there's something not quite adding up. Yun pala yun!",
        "attachments": [],
        "date": "Dec 18, 2016",
        "replyto": "10155193627988912"
      }
    ]
  }
}