{
  "id": "c5a9c298-cd6d-4f7b-b7b3-a3716229236d",
  "name": "Jaime L. Garcia",
  "url": "https://www.facebook.com/jaime.l.garcia.779",
  "text": "Likely, this tell-all book would have not told all, but regarding your question:    I wouldn&#x27;t say they&#x27;re all in it together, but I&#x27;d wager they likely share the same methods.    Exposing and unraveling that might paint a target on their back.    The only thing that stops everyone else from removing you through unity or through focusing their resources on you is the lack of a unifying agent.     By even threatening to expose such secrets, you become everyone&#x27;s enemy.    -----    Also, what, you expect people who have dark secrets to admit to all of them (and go to jail)? Even if they decide to publish to book on their deathbed, I don&#x27;t think anyone wants to be vilified in a version of history they wrote - unless you&#x27;re doing it to spite certain people, or you have a sudden change of heart.    -----    Finally, it&#x27;s pretty common for people who work in the higher echelons of non-elected gov&#x27;t service to be swapped out with each administration,  so I don&#x27;t think there&#x27;d be much to tell outside of one admin.",
  "date": "2018-04-18 00:00:00",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10156578314033912#10156578371343912",
  "source_obj": {
    "id": "10156578371343912",
    "poster": "Jaime L. Garcia",
    "poster_url": "/jaime.l.garcia.779?refid=52&_ft_=mf_story_key.10156578314033912%3Atop_level_post_id.10156578314033912%3Atl_objid.10156578314033912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10156578314033912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Likely, this tell-all book would have not told all, but regarding your question:    I wouldn't say they're all in it together, but I'd wager they likely share the same methods.    Exposing and unraveling that might paint a target on their back.    The only thing that stops everyone else from removing you through unity or through focusing their resources on you is the lack of a unifying agent.     By even threatening to expose such secrets, you become everyone's enemy.    -----    Also, what, you expect people who have dark secrets to admit to all of them (and go to jail)? Even if they decide to publish to book on their deathbed, I don't think anyone wants to be vilified in a version of history they wrote - unless you're doing it to spite certain people, or you have a sudden change of heart.    -----    Finally, it's pretty common for people who work in the higher echelons of non-elected gov't service to be swapped out with each administration,  so I don't think there'd be much to tell outside of one admin.",
    "attachments": [],
    "date": "Apr 18, 2018"
  }
}