{
  "id": "ed4265e8-574f-406a-b0db-472e0a9cf417",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "Human law is imperfect,  Wes .  Maybe someday there will be a better legal system, like the robots you mentioned, that is always fair and equal while still shielding us from every hurtful or evil thing.    But until then, I&#x27;m just a pro trying to earn a living, while trying to stay faithful to my personal beliefs, which is a battle in itself because I swore an oath to be obedient of the law, to delay no man for malice or money, to interpose every possible legal argument regardless of my personal convictions.  I&#x27;m just trying to contribute to the betterment of this country by taking part in the administration of justice, on the premise that without lawyers to fight for the unpopular clients, there is no justice for anyone, even the righteous.    And  Roy  is correct, that I come from the legal perspective.  When I took my oath, part of the responsibilitie s it imposed on me was to recognize that my actions as a citizen is the same as my actions as a lawyer.    That&#x27;s why I try to stay away from Facebook arguments; also why I don&#x27;t comment my unpopular legalistic view on people&#x27;s posts.  Well, except now, and last night on  Nathanael &#x27;s post.  But because I broke my silence, I accept all the &quot;ridiculous&quot; branding coming way.    Because as a lawyer, I will also defend to the death your right to free speech.",
  "date": "2016-11-19 00:10:03",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155102720598912#10155103377578912",
  "source_obj": {
    "id": "10155103377578912",
    "poster": "Weng Santos",
    "poster_url": "/weng.santos.9?__tn__=R",
    "text": "Human law is imperfect,  Wes .  Maybe someday there will be a better legal system, like the robots you mentioned, that is always fair and equal while still shielding us from every hurtful or evil thing.    But until then, I'm just a pro trying to earn a living, while trying to stay faithful to my personal beliefs, which is a battle in itself because I swore an oath to be obedient of the law, to delay no man for malice or money, to interpose every possible legal argument regardless of my personal convictions.  I'm just trying to contribute to the betterment of this country by taking part in the administration of justice, on the premise that without lawyers to fight for the unpopular clients, there is no justice for anyone, even the righteous.    And  Roy  is correct, that I come from the legal perspective.  When I took my oath, part of the responsibilitie s it imposed on me was to recognize that my actions as a citizen is the same as my actions as a lawyer.    That's why I try to stay away from Facebook arguments; also why I don't comment my unpopular legalistic view on people's posts.  Well, except now, and last night on  Nathanael 's post.  But because I broke my silence, I accept all the \"ridiculous\" branding coming way.    Because as a lawyer, I will also defend to the death your right to free speech.",
    "attachments": [],
    "date": "Nov 19, 2016",
    "replyto": "10155103289888912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10155102720598912#10155103367218912"
}