{
  "id": "4fbc7689-ee39-4cdf-968d-c6da451310cf",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "Personally, I blame the failure to pass a law within the past 30 years for this.    Maybe that makes me dumb or ridiculous in your eyes, so be it.  I believe I am telling it like it is.  My take comes from the actual experience of helping a friend who worked on this case.  I am pro-Robredo, but a friend of mine from the firm is the sole lawyer on record for the Marcoses on this case.  Ironically, she is also pro-Robredo.    Up front, we set our 2 basic ground rules:  (1) There would be no claims that Marcos was a hero.  It will only be about the law; an examination of the legality of the President&#x27;s order.  And (2) that when she argues this before the SC, that she ask only for what is legal, and she fights any notion raised by the petitioners that this is a battle on morals.  Non-secular morality is for another cathedral, not the Supreme Court.    I learned early on that you survive this lawyer life by separating personal politics from professional practice.  Lawyers, we&#x27;re pros; we are expected to play offense and defense, for any team, at home or away.  You can live with yourself if you only make it about the law.    While she was working on the case, and in discussing the legal aspects with her over coffee (of counsel discussion, like a &quot;consult&quot; among doctors, but with lawyers), as well as proofing, practicing, and editing her opening speech and answers to interpellation questions, it became obvious to us that the law was on the side of burial.  And that the law was on the side of presidential prerogative.  And no amount of public sentiment that falls short of governmental policy will change that, no matter how much crying goes on in court.    I think you will agree with me that a biased court who disregards the rights granted by law is worse than a despotic president who does not believe in due process.  Because then, when the president wants to put a bullet in your head, who do you run to without an impartial final arbiter?    They say that when the law is against you, you pound on the facts.  However, we are a civil law country and laws here are codified, and the judge&#x27;s hands are tied to that law.  So I say, when the law is against you, you change the damned law.  And you do it before there is a chance that law is invoked against you in a court of law.    Any lawyer worth his salt will see that gaping hole in the legal system.  I honestly regret that we didn&#x27;t find a way to cover that up for 30 years.  We felt that every President after Cory would be angry at the Marcoses.  A Duterte presidency and an almost Bongbong Marcos vice-presidency  made me realize that not everyone is angry.  And that is their right not to be, for the right to believe is absolute.  But the right to act on a belief?  That is limited by law.  A law, which, sadly, we failed to create when we had the chance.    This is what I&#x27;m thinking.  I concede that I am ridiculous.",
  "date": "2016-11-19 00:00:06",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155102720598912#10155103289888912",
  "source_obj": {
    "id": "10155103289888912",
    "poster": "Weng Santos",
    "poster_url": "/weng.santos.9?refid=52&_ft_=mf_story_key.10155102720598912%3Atop_level_post_id.10155102720598912%3Atl_objid.10155102720598912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155102720598912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Personally, I blame the failure to pass a law within the past 30 years for this.    Maybe that makes me dumb or ridiculous in your eyes, so be it.  I believe I am telling it like it is.  My take comes from the actual experience of helping a friend who worked on this case.  I am pro-Robredo, but a friend of mine from the firm is the sole lawyer on record for the Marcoses on this case.  Ironically, she is also pro-Robredo.    Up front, we set our 2 basic ground rules:  (1) There would be no claims that Marcos was a hero.  It will only be about the law; an examination of the legality of the President's order.  And (2) that when she argues this before the SC, that she ask only for what is legal, and she fights any notion raised by the petitioners that this is a battle on morals.  Non-secular morality is for another cathedral, not the Supreme Court.    I learned early on that you survive this lawyer life by separating personal politics from professional practice.  Lawyers, we're pros; we are expected to play offense and defense, for any team, at home or away.  You can live with yourself if you only make it about the law.    While she was working on the case, and in discussing the legal aspects with her over coffee (of counsel discussion, like a \"consult\" among doctors, but with lawyers), as well as proofing, practicing, and editing her opening speech and answers to interpellation questions, it became obvious to us that the law was on the side of burial.  And that the law was on the side of presidential prerogative.  And no amount of public sentiment that falls short of governmental policy will change that, no matter how much crying goes on in court.    I think you will agree with me that a biased court who disregards the rights granted by law is worse than a despotic president who does not believe in due process.  Because then, when the president wants to put a bullet in your head, who do you run to without an impartial final arbiter?    They say that when the law is against you, you pound on the facts.  However, we are a civil law country and laws here are codified, and the judge's hands are tied to that law.  So I say, when the law is against you, you change the damned law.  And you do it before there is a chance that law is invoked against you in a court of law.    Any lawyer worth his salt will see that gaping hole in the legal system.  I honestly regret that we didn't find a way to cover that up for 30 years.  We felt that every President after Cory would be angry at the Marcoses.  A Duterte presidency and an almost Bongbong Marcos vice-presidency  made me realize that not everyone is angry.  And that is their right not to be, for the right to believe is absolute.  But the right to act on a belief?  That is limited by law.  A law, which, sadly, we failed to create when we had the chance.    This is what I'm thinking.  I concede that I am ridiculous.",
    "attachments": [],
    "date": "Nov 19, 2016",
    "replies": [
      {
        "id": "10155103332983912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "you can only live with yourself if you make it only about the law.    i grew up with you,  Weng Santos . and we've disagreed on a ton of things.    but you've always been a straight arrow. and fought fairly. and sometimes avoided the fight altogether.    that makes you a goddamn brilliant lawyer.    but your argument is also why i believe robots will replace perfect lawyers in the future.    and i will have my human cousin back, and maybe, for once, beat him in an argument.",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103360653912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "From a legal perspective kasi ang analysis mo e  :)",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103367218912",
        "poster": "Bruno Yonzon",
        "poster_url": "/zrialkilla?__tn__=R",
        "text": "ganda ng sagot wes! of ROBOT lawyers and human cousins. naiisip ko na lang ang isang mundo na may robot traffic enforcers and robot sports referees. more efficient and fair, but so... SAD.",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103377578912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Human law is imperfect,  Wes .  Maybe someday there will be a better legal system, like the robots you mentioned, that is always fair and equal while still shielding us from every hurtful or evil thing.    But until then, I'm just a pro trying to earn a living, while trying to stay faithful to my personal beliefs, which is a battle in itself because I swore an oath to be obedient of the law, to delay no man for malice or money, to interpose every possible legal argument regardless of my personal convictions.  I'm just trying to contribute to the betterment of this country by taking part in the administration of justice, on the premise that without lawyers to fight for the unpopular clients, there is no justice for anyone, even the righteous.    And  Roy  is correct, that I come from the legal perspective.  When I took my oath, part of the responsibilitie s it imposed on me was to recognize that my actions as a citizen is the same as my actions as a lawyer.    That's why I try to stay away from Facebook arguments; also why I don't comment my unpopular legalistic view on people's posts.  Well, except now, and last night on  Nathanael 's post.  But because I broke my silence, I accept all the \"ridiculous\" branding coming way.    Because as a lawyer, I will also defend to the death your right to free speech.",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103389158912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "oh. you don't need to worry about that. the legalistic view is quite popular this time. :)",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103390268912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Also, I'm still your human cousin.  At least I think I am LOL.    It just so happens that I am also a lawyer, but a lawyer who will fight for you legally, tooth and nail in any legal proceeding, for free, no matter how big the opponent, because that's what human cousins do  =)",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103394588912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Okay, back to my shell now.    Sometimes, having peace in your life is more important than being right.",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103397443912",
        "poster": "Nathanael Alim Alviso",
        "poster_url": "/nathanael.alviso?__tn__=R",
        "text": "I hate to comment on Roy's post since I have many antagonist here. But since I was tagged I'm happy to see that  Weng Santos  is holding the front on the legal side. I defended the moral side and got almost branded as blasphemous.",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103403213912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Sorry I didn't know that or I wouldn't have tagged you.    Anyway, to my batchmates here, and to Bik  Yonzon , pag na-tokhang kayo call me.  Not as efficient as a robot, but due process goes both ways and I will uphold your right to it.",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103404873912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Eligible din ba kami for free service? Lol",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103407593912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "kung madukot pa namin cellphone namin weng...",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103410758912",
        "poster": "Nathanael Alim Alviso",
        "poster_url": "/nathanael.alviso?__tn__=R",
        "text": "Nakafree consultation na ako jan kay  Weng Santos . Pwede ka rin jan Roy. Gagawa ka ba ng cybercrime? 😜",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103413818912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Wes Platon  yun lang. In that case, hihingi na lang ako ng kung anumang hustisya ang mabibigay ng sistema.",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103417328912",
        "poster": "Nathanael Alim Alviso",
        "poster_url": "/nathanael.alviso?__tn__=R",
        "text": "Wes Platon  wag ka kasi manlalaban.",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103434168912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Roy Tang , 09175299073 pag natokhang ka G.    I'm still optimistic about the law.  I believe that in its plain words there is justice.  And your right to due process, that is in the plain words of no less than the Constitution.",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103440868912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "I'll add you to my phone and take you up on that  :D",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155103547623912",
        "poster": "Daniel Rey Cimafranca",
        "poster_url": "/danielrey.cimafranca?__tn__=R",
        "text": "Any system we come up with will have its flaws.  To err is human after all and we are living in the kingdom of man, not in the perfect kingdom of God.  Ganun talaga sa separation of church and state, it becomes a legal issue.  Let's not forget why such separation is in our Constitution.  My personal take on it, dont get mad get even kasi nandyan na yan eh.  What can we do legally para bwisitin ang mga Marcos ü",
        "attachments": [],
        "date": "Nov 19, 2016",
        "replyto": "10155103289888912"
      },
      {
        "id": "10155107228648912",
        "poster": "Arthur Abon",
        "poster_url": "/arthur.abon?__tn__=R",
        "text": "Nakow, para kang nag-setup ng pro-bono office for tokhang nyan  Weng . Ubra rin ba kami?",
        "attachments": [],
        "date": "Nov 20, 2016",
        "replyto": "10155103289888912"
      }
    ]
  }
}