{
  "id": "b113e0c5-1bb2-423b-8006-9fbe4f913d5d",
  "name": "[deleted]",
  "url": "https://www.reddit.com/r/Philippines/comments/4cvks2/some_examples_of_cognitive_dissonance_ive/d1mnxzi/",
  "text": "What I meant was, there were people who were misinformed regarding issues and were enlightened. Naging receptive ba sila sa info dahil pro-admin yung thread? Bakit hindi pwedeng maayos naman ang pagpapaliwanag ng mga tao? Plus, di lang naman pag kukumbinse ang point ng pagsshare ng info. Pwede rin namang kahit alam mo na hindi si Mar ang may kasalanan sa Yolanda pero iboboto mo parin si Poe kasi mas may tiwala ka sa kanya ah. Okay lang yan as long as hawak mo ang tamang information kasi karapatan mong iboto ang gusto mo. Sana nga lang vote wisely. By wisely, with proper and accurate info.\n\nWhy would I create threads like that? Are they my choice of candidates? Yan nga sinasabi ko sayo. Bakit di ikaw sumubok instead of acting like a defeatist kasi sa isip mo puro downvotes nalang ang makukuha mo. Anong klaseng attitude yan kung gusto mo kaming kumbinsehin na si Digong ang dadala satin sa kaunlaran? Ikaw dapat ang may mas alam tungkol sa plano at dahilan para si Digong ang maging pangulo.\n\nAs to sa missing LTO plates, ano pa ba ang mapaguusapan dun? We hardly have any info to go on apart from the initial news report. Was it bad? Yes. Should someone be held accountable? Definitely. Is it the fault of the LTO? Siguro pero kailangan pa imbestigahan to be definitive. Ano pa ba dapat pagusapan dyan?\n\nOo, meron ding mga Roxas supporters na sarado na ang utak pero does that mean lahat ganun na? I'm trying to engage others dito na makipag debate tungkol sa issues with facts. Ive seen others do the same pero theyre met with the same fate papi. Laging nadidismiss lang o natatawag na taga-chupa ng admin. Tama ba naman yan? Kinakausap ng maayos tapos ganun ang mangyayare?\n\nSo? Does that mean you have to act the same? If you read my posts from waaay back, i tried to be understanding and calm with my posts at first. Its normally the other party who spews personal and non-sensical attacks. Tapos when I fire back magiging anti-admin persecution na kasi nagpakita na rin ako ng hostility? \n\nTo be honest, I like Digong's federalism. I agree that we need that type of system to industrialize the country-side. But then it has its own weaknesses. Weaknesses that so far, Digong has yet to address like empowering local dynasties with more control over their own funds. That's why I was looking forward for a supporter here to discuss that topic extensively. \n\nI do not blame this sub for dubbing Duterte supporters retards because so far yan ang pinapakita eh. Imagine, ito na ang pinaka may sense na discussion ko with a Digong supporter. ITO NA. Tapos we're not even talking about the platforms themselves pero issues pa that should have been long resolved kung maayos lang ang pag tatanggap natin ng information. ",
  "date": "2016-04-02 04:07:05",
  "photo": null,
  "source_url": "https://www.reddit.com/r/Philippines/comments/4cvks2/some_examples_of_cognitive_dissonance_ive/d1mnxzi/",
  "source": "reddit",
  "reply_to": "https://www.reddit.com/r/Philippines/comments/4cvks2/some_examples_of_cognitive_dissonance_ive/d1lqsfo/"
}