{
  "id": "edcd0302-564f-4837-8b0f-b81fe947ee01",
  "name": "Daniel Rey Cimafranca",
  "url": "https://www.facebook.com/danielrey.cimafranca",
  "text": "IMO regarding Occam&#x27;s Razor.  Mas malamang na ang dati nang walanghiyang kriminal ang gagawa pa ulit ng kawalanghiyaan sa kapwa na kunwaro EJK.  We need to have more faith in our fellowmen.  It&#x27;s more of a trust issue, we just need to strengthen the checks and balances.  Imbestigahan dapat with due diligence, stricter hiring criteria for policemen, give the CHR more bite (puro pa interview lang impression ko to be frank), etc reforms.  Once we trust the system more, it won&#x27;t be that hard to consider the possibility that shameless people are simply taking advantage of the situation to do their killings.      Mahirap kasi kung ang premise lagi everyone is easily corruptible, anything we put into place will fail.  San ba papunta ang ganun, di ba?  And its unfair to those who do their job properly.",
  "date": "2016-07-27 00:00:00",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154776078928912#10154776107588912",
  "source_obj": {
    "id": "10154776107588912",
    "poster": "Daniel Rey Cimafranca",
    "poster_url": "/danielrey.cimafranca?refid=52&_ft_=mf_story_key.10154776078928912%3Atop_level_post_id.10154776078928912%3Atl_objid.10154776078928912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10154776078928912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "IMO regarding Occam's Razor.  Mas malamang na ang dati nang walanghiyang kriminal ang gagawa pa ulit ng kawalanghiyaan sa kapwa na kunwaro EJK.  We need to have more faith in our fellowmen.  It's more of a trust issue, we just need to strengthen the checks and balances.  Imbestigahan dapat with due diligence, stricter hiring criteria for policemen, give the CHR more bite (puro pa interview lang impression ko to be frank), etc reforms.  Once we trust the system more, it won't be that hard to consider the possibility that shameless people are simply taking advantage of the situation to do their killings.      Mahirap kasi kung ang premise lagi everyone is easily corruptible, anything we put into place will fail.  San ba papunta ang ganun, di ba?  And its unfair to those who do their job properly.",
    "attachments": [],
    "date": "Jul 27, 2016",
    "replies": [
      {
        "id": "10154776115503912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "The fact that we are in a situation where it is possible to take advantage of it and people cheer on the killings is in itself deplorable, and pretty much facilitated by the admin's pronouncements such as encouraging even citizens to shoot drug suspects when they have even less training than police",
        "attachments": [],
        "date": "Jul 27, 2016",
        "replyto": "10154776107588912"
      },
      {
        "id": "10154776121733912",
        "poster": "Daniel Rey Cimafranca",
        "poster_url": "/danielrey.cimafranca?__tn__=R",
        "text": "Well we've been here for several years now.  Scam capital of the world ata tayo.  It is expected that there will be people who will take advantage whatevr the ppolitical situation, regardless of who are in office.  So paano nga ba sila mahuhuli kung hindi ang pulis?    And yes dapat may nahuhuli.  Minority Report is just fiction ü  Once a person decides to kill someone it's difficult to prevent.  Dapat lang mahuli.",
        "attachments": [],
        "date": "Jul 27, 2016",
        "replyto": "10154776107588912"
      },
      {
        "id": "10154776305658912",
        "poster": "Nick Solana",
        "poster_url": "/nicksolana?__tn__=R",
        "text": "strengthen checks and balances is the right way to go about it rather than assuming or baselessly accusing irregularity of our law enforcers.. understandable na wala tayong tiwala sa gobyerno (identified na ni Digong na yan ang primary problem sa pilipinas). strengthen institutions rather than go with the flow of mere opinion that consciously or unconsciously seeks to discredit or undermine efforts to implement the law. (the serious attempt to implement the law is ground zero of these killings.. whether by legit police operations, rubouts, internal purging by the drug trade, community vigilante killings, etc). but we should never lose sight of the fact crimes are never to be tolerated. kaya importante yung gathering of data for evidence purposes para maayos mga procedures KUNG kulang.",
        "attachments": [],
        "date": "Jul 27, 2016",
        "replyto": "10154776107588912"
      },
      {
        "id": "10154776446438912",
        "poster": "Daniel Rey Cimafranca",
        "poster_url": "/danielrey.cimafranca?__tn__=R",
        "text": "Actually I'm just waiting, curious if Du30 will one day make an announcement along those lines. He's supposed to be a good strategist.  When he does, the wind will be taken out of the sails of the extreme haters/ bashers;  imagine if the one accused is the one with political will to strengthen the checks and balances on top of already signing off the FOI.  Nganga na lang pag nangyari yun ü  But everyone will benefit ü",
        "attachments": [],
        "date": "Jul 27, 2016",
        "replyto": "10154776107588912"
      },
      {
        "id": "10154776624718912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Lahat naman tayo matutuwa if i-strengthen yung institutions, hindi yung tipong inuundermine yung independent bodies for example by attacking senators when they propose to investigate, or telling the CHR chain to shut up, etc. I'm not sure if the PNP has come out with any statement saying they are investigating the cardboard killings or if they have any leads, etc. Understandably mahirap talaga sya ma-trace, but they should let the people know they are doing something. They claim to have a lot of intelligence re: drug lords so if attributable to drug lords talaga yung cardboard killings, baka naman meron na silang idea",
        "attachments": [],
        "date": "Jul 28, 2016",
        "replyto": "10154776107588912"
      },
      {
        "id": "10154776628358912",
        "poster": "Daniel Rey Cimafranca",
        "poster_url": "/danielrey.cimafranca?__tn__=R",
        "text": "Kanina sa news parang may balita na nakasuhan na ng rubout. Wasn't paying attention.  If so, at least may closure. Several more salvage cases to go.",
        "attachments": [],
        "date": "Jul 28, 2016",
        "replyto": "10154776107588912"
      },
      {
        "id": "10154776632023912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Yan ata yung may father and son na nabaril ng pulis sa station, kakasuhan daw yung mga pulis, yun yung naalala ko sa news kanina",
        "attachments": [],
        "date": "Jul 28, 2016",
        "replyto": "10154776107588912"
      },
      {
        "id": "10154776982383912",
        "poster": "Nick Solana",
        "poster_url": "/nicksolana?__tn__=R",
        "text": "mainitindihan ko kung hindi priority yung mga killings outside of police operations  dahil nga it's a question of resources for the pnp diba? i mean, if you have a highly prioritized war going on, and you're pursuing a watchlist of 3million people. The danger is real na mawala sa process yung  vigilante killings lalo na kung yung victim nasa watchlist na rin ng mga pulis.  They can be treated as one less suspect to pursue. important work talaga yung keeping track of these killings to make the police account for them soonest. CSO work yan (mga HR groups or groups like VACC)",
        "attachments": [],
        "date": "Jul 28, 2016",
        "replyto": "10154776107588912"
      },
      {
        "id": "10154777335453912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Wait, I'm not sure I got that last one. Are you saying maybe these killings are not important enough for the police at the moment because they're too busy chasing after drugs?",
        "attachments": [],
        "date": "Jul 28, 2016",
        "replyto": "10154776107588912"
      },
      {
        "id": "10154777796033912",
        "poster": "Nick Solana",
        "poster_url": "/nicksolana?__tn__=R",
        "text": "that chance of that situation is real, yes. \",,,,They can be treated as one less suspect to pursue. Important work talaga yung keeping track of these killings to make the police account for them soonest. CSO work yan (mga HR groups or groups like VACC)\"",
        "attachments": [],
        "date": "Jul 28, 2016",
        "replyto": "10154776107588912"
      },
      {
        "id": "10154777862468912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "If such were true, it would certainly contribute to the perception that the administration is tacitly allowing such killings",
        "attachments": [],
        "date": "Jul 28, 2016",
        "replyto": "10154776107588912"
      },
      {
        "id": "10154777888858912",
        "poster": "Nick Solana",
        "poster_url": "/nicksolana?__tn__=R",
        "text": "i'm sure it does, shall we work with perceptions or would it be better to build something constructive  on something more solid than perceptions?",
        "attachments": [],
        "date": "Jul 28, 2016",
        "replyto": "10154776107588912"
      },
      {
        "id": "10154777897183912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Perceptions matter since they influence culture. As I've often stated, one of my main concerns is that many in the public at large seem to see these killings as right and/or justified, not just silently accepting but in many cases even openly cheering them on. The longer that both these cardboard killings and the large number of fatalities from police operations continue, the more the public will come to accept these as normal, which is not a situation I want to be in",
        "attachments": [],
        "date": "Jul 28, 2016",
        "replyto": "10154776107588912"
      }
    ]
  }
}