{
  "id": "ccf05970-2d14-47c9-8c9f-4c80ac0e7539",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php?id=827533990",
  "text": "Even the out of context tweet description in the original post is not as bad as things Duterte has said.<br/>Like threatening to kill a hundred thousand, then millions, saying that human rights advocates are the natural enemy of the state, etc.<br/>Changing the legal burden to investigate doesn't make conducting the investigation any easier either. Cops are *still* supposed to investigate legally, which means not doing anything like planting evidence, something that Duterte has boasted about doing.<br/><hr/>\"So sabi ng mga nagtatrabaho sa gabi, wala na yung mga istambay. O, how do we make it permanent? Well, in the coming days, I will make it a mandate that lahat kayo na natamaan ng droga, wag kayong lumabas ng bahay (So those who are taking graveyard shifts said people who lurk at night are no longer there. O, how do we make it permanent? Well, in the coming days, I will make it a mandate that all drug addicts, do not step outside of your homes),” Mr. Duterte said, addressing fellow alumni of the San Beda College at a homecoming in Taguig.<br/>\"Wala man akong presohan, pumasok kayo sa bahay niyo mag lock kayo. Pagka lumabas kayo, p***** ina kayo, papatayin ko kayo (I may not have enough prisons but you should all lock yourselves in. If you go out, you son of a bitch, I will kill you all),” he added.<br/><hr/>\"The problem with this government is some people were asking or demanding whether I am telling you the truth or not, if they want proof beyond reasonable doubt. Eh paghuli lang nga (When they are caught is the) probable cause eh so when you’re [the] President, you do not do that because it is not your duty to collect evidence. That’s for the prosecutors and the police.”<br/><hr/>So what is he saying here? He is saying that he is going to declare that even on just sufficient cause for investigation, he will mandate that if they do not impose house arrest on themselves, they will be killed.<br/>He is saying that as president, even without doing the work of collecting evidence like the prosecutors and the police, probable cause is enough for him to deprive suspects of liberty on pain of death, completely bypassing the courts.<br/>So if anything, the tweet *undersells* what Duterte said.<br/> https://www.bworldonline.com/content.php?section=Nation&title=duterte-to-issue-order-on-drug-addicts-to-stay-home&id=136945",
  "date": "2016-11-28 21:07:00 +0800",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155124537923912#10",
  "source": "facebook",
  "spam": false
}