{
  "id": "3e38047b-a672-410e-8bb0-33ac3381d54b",
  "name": "Luc Valencia",
  "url": "https://www.facebook.com/luc.valencia",
  "text": "A Du30 presidency would have the opposite effect of what these supporters expect: instead of bringing peace and order it would just bring chaos and anarchy. Imagine a president flaunting his murderous credentials - he will set a bad example to local politicians, police and military! Extra judicial killings will spike and  tolerated: politicians and police/ military men would think - if the president can do it and be praised for doing it, why can&#x27;t we? They would disregard human rights! Just like in Iraq, Mexico, Guatemala, Honduras, Nigeria, etc where extra judicial killings is a norm, there will be revenge attacks against authorities and escalation of  insurgency. Things will spiral out of control and before you know it, someone close to you will just be part of the statistics of unexplained murders.",
  "date": "2015-12-10 00:00:06",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154239469608912#10154239599473912",
  "source_obj": {
    "id": "10154239599473912",
    "poster": "Luc Valencia",
    "poster_url": "/luc.valencia?refid=52&_ft_=mf_story_key.10154239469608912%3Atop_level_post_id.10154239469608912%3Atl_objid.10154239469608912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10154239469608912%3Aphoto_id.10154239469193912%3Astory_location.4%3Astory_attachment_style.photo%3Athid.632418911&__tn__=R",
    "text": "A Du30 presidency would have the opposite effect of what these supporters expect: instead of bringing peace and order it would just bring chaos and anarchy. Imagine a president flaunting his murderous credentials - he will set a bad example to local politicians, police and military! Extra judicial killings will spike and  tolerated: politicians and police/ military men would think - if the president can do it and be praised for doing it, why can't we? They would disregard human rights! Just like in Iraq, Mexico, Guatemala, Honduras, Nigeria, etc where extra judicial killings is a norm, there will be revenge attacks against authorities and escalation of  insurgency. Things will spiral out of control and before you know it, someone close to you will just be part of the statistics of unexplained murders.",
    "attachments": [],
    "date": "Dec 10, 2015"
  }
}