{
  "id": "e2eddcea-fe0b-4b5a-b46e-6606baba0312",
  "name": "Roy Tang",
  "url": "https://www.facebook.com/stephen.roy.tang",
  "text": "Jaime L. Garcia  dont you find team starcraft less stressful than 1v1? nakaka high blood ung 1v1 e lol.",
  "date": "2017-01-11 00:00:04",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155266619368912#10155266667218912",
  "source_obj": {
    "id": "10155266667218912",
    "poster": "Roy Tang",
    "poster_url": "/stephen.roy.tang?refid=52&_ft_=mf_story_key.10155266619368912%3Atop_level_post_id.10155266619368912%3Atl_objid.10155266619368912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155266619368912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Jaime L. Garcia  dont you find team starcraft less stressful than 1v1? nakaka high blood ung 1v1 e lol.",
    "attachments": [],
    "date": "Jan 11, 2017",
    "replies": [
      {
        "id": "10155266689053912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "On the stress matter, yes. I've never been a really good SC player, just decent. I happen to have allied with people who are more than a tier of skill higher than me, so curbstomp happens. The Ace ally more than makes up for my lack of skill, and my opponents are also out of their league against him.    Stress might be less, but there is no reward. When I do win with such an ally, the victory is often hollow for me, since you can clearly tell that I'm just being a load on the team. When I lose, I know it's because I didn't deliver. Lose-lose, either way.    -----    Team-based RTSs are slightly different cases, since each faction is designed to work on its own first, instead of being designed in synergy with other team variables.  (contrast MOBAs that have roles, and one bad player playing healer cannot easily have someone covering his back, since they're playing tank / carry / DPS).    A bad casual player can be offset by an extremely good ally, but if the enemy team was likewise equally skilled (ala Conservation of Ninjutsu), then the good ally should still be curbstomped by the remaining opponents since the bad teammate did not deliver.",
        "attachments": [],
        "date": "Jan 11, 2017",
        "replyto": "10155266667218912"
      },
      {
        "id": "10155266691848912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "hindi naman kasi necesarilly curbstomp ang situation. more of may averaging kasi ng skill levels so even if a single team member in a five man team is suddenly 5% less efficient, the team only takes a 1% drop in efficiency (conversely, extra efficiency is equally distributed as well)",
        "attachments": [],
        "date": "Jan 11, 2017",
        "replyto": "10155266667218912"
      },
      {
        "id": "10155266694668912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Or like, in a DOTA game it is more likely for a team to be able to survive one team member getting distracted by something IRL for 2 secs (or IDK pausing to eat a sandwich). In Street Fighter, those 2 seconds will cost you the game",
        "attachments": [],
        "date": "Jan 11, 2017",
        "replyto": "10155266667218912"
      },
      {
        "id": "10155266698103912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "If that's the case, it's not so different than playing a 1v1 and expecting your opponent to be -5% to +5% better than you, and winning / losing accordingly.    You will probably not even feel na mabigat ka in those team scenarios where you are 5% less efficient.    The only scenarios I can conjure na medyo pabigat ka and your team wins the game is if the enemy goes all in and attacks your base, leaving their bases wide open to reprisal from your friends. In which case, you were the distracting bait and while you feel bad on getting 4v1'd, you did your job.",
        "attachments": [],
        "date": "Jan 11, 2017",
        "replyto": "10155266667218912"
      },
      {
        "id": "10155266706753912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "Re: DOTA Game, I'm not an expert, but turnarounds happen a lot. The game has a lot of math involved, but generally speaking, if a losing team plays defensively, they only need to succeed once to semi-balance the odds.    The game has a built-in snowball and counter-snowbal l effect. Teams that win clashes tend to carry more gold post fight, but heroes with killstreaks also get juicier, with their gold bounty increasing when they do get killed in the next clash.    The game also has several different metas depending on team compositions that are being run. Some team comps have phases where they just suck, but once the game matures and everyone has some measure of gold and levels, their golden age kicks in (like when key players get key items or have ultimate skills go online as a natural course of levelling) where the tables can turn.    Sometimes, yes, the enemy team can screw up, misfiring a spell or being caught out of place, or some teammate can miraculously initiate perfectly.    I'm sure our mutual DOTA player friends have more to say on this subject.",
        "attachments": [],
        "date": "Jan 11, 2017",
        "replyto": "10155266667218912"
      }
    ]
  }
}