{
  "id": "027382f1-2719-44d1-80bc-c69cf995ae6c",
  "name": "Jaime L. Garcia",
  "url": "https://www.facebook.com/jaime.l.garcia.779",
  "text": "On the stress matter, yes. I&#x27;ve never been a really good SC player, just decent. I happen to have allied with people who are more than a tier of skill higher than me, so curbstomp happens. The Ace ally more than makes up for my lack of skill, and my opponents are also out of their league against him.    Stress might be less, but there is no reward. When I do win with such an ally, the victory is often hollow for me, since you can clearly tell that I&#x27;m just being a load on the team. When I lose, I know it&#x27;s because I didn&#x27;t deliver. Lose-lose, either way.    -----    Team-based RTSs are slightly different cases, since each faction is designed to work on its own first, instead of being designed in synergy with other team variables.  (contrast MOBAs that have roles, and one bad player playing healer cannot easily have someone covering his back, since they&#x27;re playing tank / carry / DPS).    A bad casual player can be offset by an extremely good ally, but if the enemy team was likewise equally skilled (ala Conservation of Ninjutsu), then the good ally should still be curbstomped by the remaining opponents since the bad teammate did not deliver.",
  "date": "2017-01-11 00:08:20",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155266619368912#10155266689053912",
  "source_obj": {
    "id": "10155266689053912",
    "poster": "Jaime L. Garcia",
    "poster_url": "/jaime.l.garcia.779?__tn__=R",
    "text": "On the stress matter, yes. I've never been a really good SC player, just decent. I happen to have allied with people who are more than a tier of skill higher than me, so curbstomp happens. The Ace ally more than makes up for my lack of skill, and my opponents are also out of their league against him.    Stress might be less, but there is no reward. When I do win with such an ally, the victory is often hollow for me, since you can clearly tell that I'm just being a load on the team. When I lose, I know it's because I didn't deliver. Lose-lose, either way.    -----    Team-based RTSs are slightly different cases, since each faction is designed to work on its own first, instead of being designed in synergy with other team variables.  (contrast MOBAs that have roles, and one bad player playing healer cannot easily have someone covering his back, since they're playing tank / carry / DPS).    A bad casual player can be offset by an extremely good ally, but if the enemy team was likewise equally skilled (ala Conservation of Ninjutsu), then the good ally should still be curbstomped by the remaining opponents since the bad teammate did not deliver.",
    "attachments": [],
    "date": "Jan 11, 2017",
    "replyto": "10155266667218912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10155266619368912#10155266667218912"
}