{
  "id": "3e7b9808-79d7-4485-98f7-29d6d0f7e326",
  "name": "Jaime L. Garcia",
  "url": "https://www.facebook.com/jaime.l.garcia.779",
  "text": "Actually, I have a question, since you play a lot of fighting games. If you find that you are having a bad run in game because either:    a) you gambled on high risk moves and lost,  b) you &#x27;played&#x27; the correct strat, but failed to execute.    is it usually possible to turn the tables and change strategies mid-fighting, or is there not enough HitPoints to allow for a solid transition and win the game?",
  "date": "2017-01-11 00:00:05",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155266619368912#10155266691773912",
  "source_obj": {
    "id": "10155266691773912",
    "poster": "Jaime L. Garcia",
    "poster_url": "/jaime.l.garcia.779?refid=52&_ft_=mf_story_key.10155266619368912%3Atop_level_post_id.10155266619368912%3Atl_objid.10155266619368912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155266619368912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Actually, I have a question, since you play a lot of fighting games. If you find that you are having a bad run in game because either:    a) you gambled on high risk moves and lost,  b) you 'played' the correct strat, but failed to execute.    is it usually possible to turn the tables and change strategies mid-fighting, or is there not enough HitPoints to allow for a solid transition and win the game?",
    "attachments": [],
    "date": "Jan 11, 2017",
    "replies": [
      {
        "id": "10155266695658912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Hm, mahabang reply. Wait.",
        "attachments": [],
        "date": "Jan 11, 2017",
        "replyto": "10155266691773912"
      },
      {
        "id": "10155266706913912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Hindi pala mahabang reply. In fighting games, you can win with even a sliver of life (Google the famous EVO moment #37) given perfect defense, mind-reading and execution. Fighting games also typically implement some sort of comeback mechanism that allow a player in a losing situation to turn things around. I highly recommend reading  http://www.sirlin.net/articles/slippery-slope-and-perpetual-comeback  and the rest of Sirlin's articles on playing competitively (he's a former competitive SF player who is now a board game designer - he created Puzzle Strike and that Panda poker game we used to play)",
        "attachments": [],
        "date": "Jan 11, 2017",
        "replyto": "10155266691773912"
      },
      {
        "id": "10155266709623912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Wala naman \"levels\" like DOTA in-game, you are as strong at 1% HP as you were at 100% (well ok merong fighting games for which this isnt strictly true), so comebacks are easier. But I think dahil one-on-one siya, mas vulnerable yung losing side to psychological damage, i.e. going on tilt, panicking etc. With a team kasi you can have the other team members calm you down or keep you focused.",
        "attachments": [],
        "date": "Jan 11, 2017",
        "replyto": "10155266691773912"
      },
      {
        "id": "10155266712478912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "Opposite is also true though, depending on the stage of the moba game where you need teammates or not (if you've snowballed with a carry / core hero, some players will argue that you don't need your friends... as much other than for spell absorption).    Morale is still a big factor, and while a solid leader can keep people in line and in the game, an unled team with one fatalist or doomsayer can easily ruin any chances as well.",
        "attachments": [],
        "date": "Jan 11, 2017",
        "replyto": "10155266691773912"
      },
      {
        "id": "10155266715463912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "I'd argue that if you play with the same set of friends, then support, solidarity, and discipline are more likely.     But playing with a bunch of random people will have a higher chance of screwing up the chances you have of winning, assuming you're an average player, because you need to make \"more rolls on character creation\" to see if you can succeed.",
        "attachments": [],
        "date": "Jan 11, 2017",
        "replyto": "10155266691773912"
      }
    ]
  }
}