{
  "id": "4038e73e-a54e-4dc4-abd6-ad6363b60693",
  "name": "Jaime L. Garcia",
  "url": "https://www.facebook.com/jaime.l.garcia.779",
  "text": "The team-based aspect of said online multiplayer games is another barrier to entry, so I&#x27;d argue that it&#x27;s easier to enter as a casual in a fighting game where the individual controls approximately half the variables (i.e. your character/s and your skill level).     There&#x27;s no communications overhead with learning how to play with your team&#x27;s character comp, and learning your teammate&#x27;s skills. (eg. Reinhardt&#x27;s a good Overwatch knight-tank, and your comp looks good on paper with him around, but if the player decides to flank instead of leading the vanguard...). There&#x27;s only you and the enemy.    If, in a casual team-based online multiplayer game, a good player (&#x27;expert&#x27;) can carry the rest of the team, then that expert is simply an ace, and should not be playing at that skill level (or the game is terribly broken because a solo player of similar skill choosing the right character can curbstomp all opposition regardless of how poorly their teammates are playing).    If the game is balanced, and the curbstomping still happens, then in a levelling / item-based MOBA game like DOTA, then it means the other characters have simply bought space and farm for their golden-boy hero, and carry&#x27;s coming to collect.    TL;DR: Learning team variables and communications overhead make team-based games less casual-friendly . A team-based game where a player overcompensates  for weak teammates and owns the enemy team is either playing in a game where his skill level is too high, the game is unbalanced, or his &quot;weak teammates&quot; have actually done their job, sacrificing themselves so that their ace in a hole can develop unimpeded.",
  "date": "2017-01-11 00:00:03",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155266619368912#10155266666063912",
  "source_obj": {
    "id": "10155266666063912",
    "poster": "Jaime L. Garcia",
    "poster_url": "/jaime.l.garcia.779?refid=52&_ft_=mf_story_key.10155266619368912%3Atop_level_post_id.10155266619368912%3Atl_objid.10155266619368912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155266619368912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "The team-based aspect of said online multiplayer games is another barrier to entry, so I'd argue that it's easier to enter as a casual in a fighting game where the individual controls approximately half the variables (i.e. your character/s and your skill level).     There's no communications overhead with learning how to play with your team's character comp, and learning your teammate's skills. (eg. Reinhardt's a good Overwatch knight-tank, and your comp looks good on paper with him around, but if the player decides to flank instead of leading the vanguard...). There's only you and the enemy.    If, in a casual team-based online multiplayer game, a good player ('expert') can carry the rest of the team, then that expert is simply an ace, and should not be playing at that skill level (or the game is terribly broken because a solo player of similar skill choosing the right character can curbstomp all opposition regardless of how poorly their teammates are playing).    If the game is balanced, and the curbstomping still happens, then in a levelling / item-based MOBA game like DOTA, then it means the other characters have simply bought space and farm for their golden-boy hero, and carry's coming to collect.    TL;DR: Learning team variables and communications overhead make team-based games less casual-friendly . A team-based game where a player overcompensates  for weak teammates and owns the enemy team is either playing in a game where his skill level is too high, the game is unbalanced, or his \"weak teammates\" have actually done their job, sacrificing themselves so that their ace in a hole can develop unimpeded.",
    "attachments": [],
    "date": "Jan 11, 2017"
  }
}