{
  "id": "6b6f49d9-3ba2-4048-96eb-5ba3f3864756",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "OK! I couldn&#x27;t help it.     GTA: Metro Manila!    You start off as a lowly, ordinary security guard for a mall. It begins with small things--helping  old ladies find their way around the mall, taking care of lost children, etc. Then it picks up as you take on a gang of pickpockets that have targeted the mall. After you beat them down and send them to the long, long justice of the courts, all seems to be going well...    And then the gang&#x27;s brods go after you after work. They steal your scooter, and you try to chase them down. You&#x27;re trapped by the lousy legal system as they screw with your barangay. They get you fired when they plant drugs in your locker.    And then you go off the rails and become...    MANG JOSE.    You chase down the gang in steadily escalating fashion, getting caught up in a web that spreads across the country due to the gang&#x27;s links with politicians in the capitol, communists in the North and Muslim insurgents in the south, all the while getting paid by the people you save! You issue receipts even, and can be hired for parties... And because so much of the action happens late at night, the traffic is light enough to allow high speed chases...    And Parokya ni Edgar does the title theme!     http://www.youtube.com/watch?v=YigbBgs76ag    ...Sorry. I just love that video so much.",
  "date": "2013-05-29 00:00:03",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10152257404178912#10152257524538912",
  "source_obj": {
    "id": "10152257524538912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&refid=52&_ft_=mf_story_key.10152257404178912%3Atop_level_post_id.10152257404178912%3Atl_objid.10152257404178912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10152257404178912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "OK! I couldn't help it.     GTA: Metro Manila!    You start off as a lowly, ordinary security guard for a mall. It begins with small things--helping  old ladies find their way around the mall, taking care of lost children, etc. Then it picks up as you take on a gang of pickpockets that have targeted the mall. After you beat them down and send them to the long, long justice of the courts, all seems to be going well...    And then the gang's brods go after you after work. They steal your scooter, and you try to chase them down. You're trapped by the lousy legal system as they screw with your barangay. They get you fired when they plant drugs in your locker.    And then you go off the rails and become...    MANG JOSE.    You chase down the gang in steadily escalating fashion, getting caught up in a web that spreads across the country due to the gang's links with politicians in the capitol, communists in the North and Muslim insurgents in the south, all the while getting paid by the people you save! You issue receipts even, and can be hired for parties... And because so much of the action happens late at night, the traffic is light enough to allow high speed chases...    And Parokya ni Edgar does the title theme!     http://www.youtube.com/watch?v=YigbBgs76ag    ...Sorry. I just love that video so much.",
    "attachments": [],
    "date": "May 29, 2013"
  }
}