{"id": 1834596, "name": "Keibosh", "url": "https://stackoverflow.com/users/143942/keibosh", "text": "My experience with applets in an enterprise environment usually leads down 1 of 3 paths in regards to problems. \r\n\r\nIncorrect or conflicting JRE versions on the client\r\n\r\nCorrupt JRE on the client. \r\n\r\nCorrupt IE Cache\r\n\r\nI have found uninstalling a single JRE is usually not enough, Its often required to uninstall all JRE's on the machine and reinstall only the ones you need.\r\n\r\nAnother trick is to reset their NT profile. This does wonders to correct IE cache issues as well. Done this so often I have documented the procedure. I generally perform this when a JRE uninstall reinstall doesnt work.\r\n\r\n    This can only be done by an administrator off the workstation. \r\n    Meaning a user with Admin access cannot delete their own profile.\r\n\r\n    Before a user profile is deleted good practice is to back up the following folders found in: \r\n    C:\\Documents and Settings\\<USERNAME>\r\n\r\n    Desktop\r\n    Favorites\r\n    My Documents\r\n\r\n    These folders could be copied to the user’s H:\\ drive then can be copied back to the same folder\r\n    after the user logs back on to the system.\r\n\r\n    1.\tReboot the workstation. When you are back to the log on screen log in as the administrator.\r\n\r\n    2.\tRight click on My Computer and choose properties.\r\n\r\n    3.\tChoose the Advanced Tab then, under User Profiles, click on Settings.\r\n\r\n    4.\tHighlight the user profile you would like to remove then click Delete. Close all the way out of the properties box.\r\n\r\n    5.\tGo to Windows Explorer and navigate to C:\\Documents and Settings. The folder named after the USERNAME\r\n    should have been removed. If it still remains manually delete the folder, \r\n    then empty the recycling bin to make sure it’s been fully removed from the system.\r\n\r\n    6.\tReboot the workstation. At the log on prompt the user can log back in as themselves. \r\n    This will create a brand new NT profile with their username. \r\n    This will recreate certain OS settings as well as Internet Explorer settings \r\n    that might have been corrupted in the old profile.\r\n\r\n    7.\tAt this point the three folders copied to the users H:\\ drive can now be copied back to \r\n    C:\\Documents and Settings\\<USERNAME>\r\n", "date": "2009-12-02 17:43:41", "photo": "https://www.gravatar.com/avatar/34dfb6015d360f438587142da988f03c?s=128&d=identicon&r=PG", "source_url": "https://stackoverflow.com/questions/1801804/applets-failing-to-load", "mention_url": "https://stackoverflow.com/questions/1801804/applets-failing-to-load", "source": "stackexchange"}