{
  "id": "0d9c5712-cdbf-4e99-a960-9fe2b9f0baaf",
  "name": "Nick Solana",
  "url": "https://www.facebook.com/nicksolana",
  "text": "Ok na sana yung Point mo kaso it appears these iskolar ng Bayan are decidedly well-informed only with leftist idealogy. They seem so brainwashed by it that they can&#x27;t even come up with new or better slogans. This kind of activism is a symptom of the lack of critical/ creative thinking as well as a lack of proper perspective. But I don&#x27;t expect a lot from tools of the progressive left  😉",
  "date": "2018-02-24 00:00:00",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10156441354968912#10156442188183912",
  "source_obj": {
    "id": "10156442188183912",
    "poster": "Nick Solana",
    "poster_url": "/nicksolana?refid=52&_ft_=mf_story_key.10156441354968912%3Atop_level_post_id.10156441354968912%3Atl_objid.10156441354968912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10156441354968912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Ok na sana yung Point mo kaso it appears these iskolar ng Bayan are decidedly well-informed only with leftist idealogy. They seem so brainwashed by it that they can't even come up with new or better slogans. This kind of activism is a symptom of the lack of critical/ creative thinking as well as a lack of proper perspective. But I don't expect a lot from tools of the progressive left  😉",
    "attachments": [],
    "date": "Feb 24, 2018",
    "replies": [
      {
        "id": "10156442229163912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "The point should stand whether you find the specific cause agreeable or not. If what you term as the \"progressive left\" seems to be repeating the same demands over and over again perhaps it is an indication that these are some issues that are never fully addressed in our society. Yesterday's walkouts in particular seem to be focused on press freedom and human rights, things that I would hope to be universally valued regardless of left or right leanings. Hopefully we can agree that such things are worth fighting for.",
        "attachments": [],
        "date": "Feb 24, 2018",
        "replyto": "10156442188183912"
      }
    ]
  }
}