{
  "id": "673c440a-e03d-408c-982c-ef8f69a11048",
  "name": "Roy Tang",
  "url": "https://www.facebook.com/stephen.roy.tang",
  "text": "Now that I&#x27;ve had a nap, some more comments:  - Superman characterizatio n problems from Man of Steel continue, he just doesn&#x27;t seem like he cares. Parang napipilitan lang maging Superman  - overall very poor character development for Batman and Superman  - Laurence Fishburne as Perry White was great, I think his dialog really captures the character  - I think the movie really suffers from having too much stuff to tell. They just hand-wave over a bunch of stuff that might have made some of the plot choices make more sense (yet somehow have the time to have dozens of scenes of people walking or falling in slow motion or bruce wayne looking longingly over the water or clark talking to a ghost)",
  "date": "2016-03-26 00:00:03",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154478639818912#10154478994453912",
  "source_obj": {
    "id": "10154478994453912",
    "poster": "Roy Tang",
    "poster_url": "/stephen.roy.tang?refid=52&_ft_=mf_story_key.10154478639818912%3Atop_level_post_id.10154478639818912%3Atl_objid.10154478639818912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10154478639818912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Now that I've had a nap, some more comments:  - Superman characterizatio n problems from Man of Steel continue, he just doesn't seem like he cares. Parang napipilitan lang maging Superman  - overall very poor character development for Batman and Superman  - Laurence Fishburne as Perry White was great, I think his dialog really captures the character  - I think the movie really suffers from having too much stuff to tell. They just hand-wave over a bunch of stuff that might have made some of the plot choices make more sense (yet somehow have the time to have dozens of scenes of people walking or falling in slow motion or bruce wayne looking longingly over the water or clark talking to a ghost)",
    "attachments": [],
    "date": "Mar 26, 2016"
  }
}