{
  "id": "c034b8f1-546d-4c71-9e26-cea2fe902dd0",
  "name": "hungryroy",
  "url": "https://www.reddit.com/u/hungryroy",
  "text": "Hello! Thank you for responding!\n\n&#x200B;\n\nRe: China, I don't think there are only two options where it is either war or bilateral relations. We can maintain bilateral relations while at the same time asserting our rights. I believe Indonesia has blown up Chinese fishing boats they have caught illegally fishing in their claimed territories, yet there is no talk of war being declared there. China will not go into a war with us over the WPS, this is an unfounded fear; they have not even started any hostilities over Taiwan despite decades of saber-rattling. I think the main reason this admin is afraid to piss off China is that their programs have become dependent on Chinese loans since Duterte dislikes loans from western countries that come with silly conditions like needing to abide by human rights etc\n\n&#x200B;\n\nRe: Rappler, I agree they have a particular style of journalism, but I think this is more of the nature of people online being more attracted to clickbait-y articles than any actual bias against Duterte specifically. Even during the time of PNoy, they would have various articles criticizing him. It is the nature of the press to highlight problems and scandals, since this acts as a check on power. I think also the admin supporters have some level of selective bias as well in that they only see or remember those articles critical of the administration. The top article on the [Rappler.com](https://Rappler.com) frontpage right now is \"Philippines recalls envoys after Canada misses deadline for garbage shipment\" which is surely positive for the admin. I think you would also agree that compared to the past admin, the current admin also tends to say more controversial things/statements which are more likely to make the news cycle, which furthers the sense of 'bias'.\n\n&#x200B;\n\nThank you again for the discussion. What I generally see is that there is some sort of divide over idealistic/morally-driven views vs more pragmatic/\"we need to get things done\" views. Ultimately, both kinds of views would be needed to drive a country forward, my main worry is that under Duterte we are giving up too much and sacrificing too many things such as checks and balances, innocent lives, and things like abuse of police power may become institutionalized.",
  "date": "2019-05-16 04:54:59",
  "photo": null,
  "source_url": "https://www.reddit.com/r/Philippines/comments/botnry/are_there_real_admin_supporters_here_on_rph/enpw1jz/",
  "source": "reddit",
  "reply_to": "https://www.reddit.com/r/Philippines/comments/botnry/are_there_real_admin_supporters_here_on_rph/enns3qj/"
}