{
  "id": "56a22f5e-d180-43cb-84a3-cdb6f41c7d5f",
  "name": "Vagrxnt",
  "url": "https://www.reddit.com/u/Vagrxnt",
  "text": "Can I answer too? :))\n\n> how do you feel about the way the admin is handling our relationship with China?\n\nThere is very little room to work on this matter. The Hague ruling is literally nothing right now given that China does not recognize it and the arbitrating body has nothing to enforce its ruling. I understand the frustration, but there is really nothing we can do as of the moment. Not to mention, China is using the Belt and Road Initiative to make us think twice of doing another legalistic and/or political move to try to get them out of our backyard. For me, there are two solid options: fight a losing war for our islands and waste the lives of the military (which will definitely go down in history as the \"Mamasapano 2.0\") or maintain bilateral relations with China and help us fund infrastructure and social development while we attempt to soften the negotiation on our islands. I heard people say that we must ask the UN and the international communities for help against China-- we can. But how can we be sure that when we compromise our position with China, there will be a surefire way to get them out of our islands without any economic backlash on our part? For me, this is a chess game and playing it carefully is in our best interest. \n\n>how do you feel about the alliances with known or perceived corrupt politicos/families like the Marcoses or GMA?\n\nI think these alliances are more political than personal. However, I do think that Duterte is prone to cronyism, but as long as it does not backfire at his plans for the country (like it did with Marcos), I will hold my reservations for it. \n\n>how do you feel about the way the president plays fast and loose with the facts, pulls out allegations out of nowhere without explanation, attacks the press, the church, etc\n\nWell, these are minor quirks for me as long as there is no actual blatant and evident  illegal persecutions happening. Kumbaga, these are just words and after his term, these will fade in history because they have little value to whether he did or did not do something for the country. I'd like to talk about the press, particularly Rappler, I think Rappler is really very biased in reporting about the administration. You can readily see it through the choice of words, illustrations and insertion of statements that does not seem to fit with the theme of a certain topic just to insert an attack into the government. Responsible journalism, for me, is giving the facts, and facts alone, to the people and allow them to decide how they feel about it. \n\n>how do you feel about the death of Kian? do you think such abuses by the cops are common or rare?\n\nKian is a collateral damage of this war on drugs. But I think that it is more a reflection on the lack of discipline of the police, which is probably a factor of the lack of funding for PNP modernization among others, than the war on drugs. I think these have happened hundreds of times before but this time, it has been greatly magnified due to the war on drugs. I dont necessarily like the war on drugs. War connotates lawlessness and violence. But I would advocate for a systematic crackdown on drugs with police accountability maintained as a core value.\n\n>\" I hope a REAL opposition will be formed in the senate roster for check and balance. Not the 8D type of opposition. \" What does this mean? What makes 8D not \"REAL opposition\"?\n\nI echo him in this. I think a real opposition would constitute senators such as Mar Roxas, Gordon, Lacson or Poe, who think independently from their parties or are independent candidates themselves. I heard Mar say he is not really comfortable being called the \"opposition\" because he is not running for senate to simply say \"no\", which is what Trillanes has been doing for 3 years now. Lacson, in his interviews, often appears as skeptic of Duterte but does not go off the handle in attempting to discredit him. Gordon showed he is not a yes-man to Duterte by still fighting for his doble-plaka law because he genuinely believes it is best for the people. I think if you fill the senate with 8D type of opposition, there will only be a tug-of-war of interests and we, Filipinos, lose. \n\n>In spite of all the negatives you mentioned, you still feel like this admin is a net positive?\n\nPersonally, the TRAIN Law is massive for me and for many Filipinos who had to pay personal income tax prior to the signing of the law, knowing that the ramped-up prices would be used to fund social services such as improved 4Ps, rice subsidies, and unconditional cash grants for the poorest 10 million families in the country. I am happy with him firing officials for corruption and incompetence. I am happy for the possible devolution of power and development from Imperial Manila. I am happy about him being rational about the WPS issue and taking it very carefully rather than patriotically rash. I am happy about him poking the hornet's nest that is the hidden drug problem in the country. I am happy about the signing of the Free Tuition Act, Universal Health Care Act, 2000-peso increase in SSS pension, signing of the Energy Efficiency and Conservation Act which is conjoined with discouraging the unsustainable use of petroleum. Lastly, and probably his greatest achievement, is the signing of the Bangsamoro Organic Law (BOL). Duterte is still in his third year, and I think there will be more to this list by 2022.  \n\n>Is there something you can tell me to convince me to support him?\n\nI dont think I can, to be honest. Most of your reasons to not support him are moral in nature. Most of my reasons why I like him are practical and real. I did not vote for him to be moral. I voted for him to brings results. The one thing I hated most about PNoy is incompetence. He is the model of an ideal citizen: decent, clean, polite, respectful (much like how Chel Diokno, the youth bet, is) and all that Duterte is not. But he was incompetent. That is when I realized the presidency is not simply for anyone. \n\n>Have there been instances that made you doubt your support for the administration?\n\nIf I was morally-driven, I would have condemned him from the very beginning. However, I lean more towards people who give results. Maybe one instance that made me doubt the administration is his tendency from cronyism. Yet, so far, I have not seen anything that convinced me that he prioritized his cronies over the welfare of the country. \n\n>What would be a dealbreaker for you, i.e. something this administration would do that would end your support? In my opinion, the president has personally expressed support and/or tolerance for murder, lying, planting evidence, suppressing the press, political dynasties, vote-buying, making allegations without proof, and so on, so I find it difficult to imagine what could be worse than all of these.\n\nReally?? Try \"declaring Martial Law all over the Philippine over no real threat\" and \"taking the powers of the three branches of government to enforce his own sense of government\". You know, I always look at things in the context of time: Is he better than the PNoy? Gloria? Estrada?. This is the only way by which you can locate yourself and your expectation on the ground and in reality. So, to answer your question, the dealbreaker for me, aside from him becoming another Marcos of course, is if he regressed to a level of Estrada, so bad that he inspires another EDSA Revolution. \n\nI hope you are satisfied with my answers to your interesting questions! And thank you to both you and OP for attempting to understand us. That is very very rare :)",
  "date": "2019-05-15 19:59:59",
  "photo": null,
  "source_url": "https://www.reddit.com/r/Philippines/comments/botnry/are_there_real_admin_supporters_here_on_rph/enns3qj/",
  "source": "reddit"
}