{
  "id": "3c27a0f3-8e84-4f13-acd0-7a078509eef2",
  "name": "dandans0y",
  "url": "https://www.reddit.com/u/dandans0y",
  "text": "**- how do you feel about the way the admin is handling our relationship with China?**\n\nWe all know what happened during PNoy's term that led to China's aggressive actions in WPS. I think PDuts having a good relationship with China would benefit PH. Though I disagree with just allowing China to occupy islands in WPS, but it is a sensitive issue and China's Xi Jinping already made it clear that they would go to war for it. Can we win? Is it worth it? I'm being practical. As far as we can't win, I'd prefer that we stay quiet, build up strength. Also, Vietnam occupies more than China and other countries combined. But why is noone calling out Vietnam? Because China sounds better for black propaganda. Carpio's wife is also Vietnamese, go figure. \n\n**- how do you feel about the alliances with known or perceived corrupt politicos/families like the Marcoses or GMA?**\n\nGMA was PDuts' mentor based on his own stories. And (allegedly) GMA is not the corrupt one, it is his husband, Mike Arroyo. Nepotism needs to end. GMA saved our economy during the time of US recession (this is based on what I read on news, so please feel free to correct me if I am wrong). She is smart and knows what she is doing, but what I don't like about her is her tendency to tolerate corrupt officials. \n\nFor Marcoses, I've been influenced by my grandparents on this, the Marcos era was great according to them. It's just that the last few years were really fucked up because Marcos fell ill and other people were already in charge of a lot of things. Let's not forget who controls the police and military back then.. wasn't it Fidel Marcos and JPE? So why are they not answering the ML era abuses? Because \"Marcos\" is a better excuse. \n\nI don't really care about the ML era anymore. For me, based on old people stories and what I read on history, and how the economy got fucked up in the past 30 years, the People Power was a mistake. \n\n**- how do you feel about the way the president plays fast and loose with the facts, pulls out allegations out of nowhere without explanation, attacks the press, the church, etc**\n\nI wish for it to stop. He needs better staff as well. Lagi na lang nakukuryente. For press, I know a lot of people getting paid, I have relatives in ABS CBN. I don't fully trust the news nowadays. Half truths are the best lies. For the Church, CBCP is a joke, sorry. \n\n**- how do you feel about the death of Kian? do you think such abuses by the cops are common or rare?**\n\nUnfortunate collateral damage. Cases were filed, I hope they get justice. For the LPs that tried to parade his corpse in EDSA by bribing the parents, shame on you guys. \n\n**- \" I hope a REAL opposition will be formed in the senate roster for check and balance. Not the 8D type of opposition. \" What does this mean? What makes 8D not \"REAL opposition\"?**\n\nThey don't offer alternative solution. And if they did, I didn't hear about it. If they have focused on providing an alternative for all our current problems, maybe they could have won few seats in the senate. Chel is a leftist, his legal pro bono work was mostly for leftist people as well. Do we even have a list of cases he won, at least for the past 10 years? Colmenares was a known leftist as well. People died due to NPA violence, you can't blame them not voting for these people. Some 8D people were endorsed by leftist groups as well, that gave a very negative image for them. We can't have a leftist opposition in the Senate. We need an opposition that offers sound and reasonable alternatives.  And the debate episodes in the TV backfired, 8D just showed how toxic they are. \n\n**- you mentioned opposing corruption, what about his appointees who had stolen from the public and have never been punished, like the Tulfos? I am not aware of any significant anticorruption successes by this administration (which means prosecution, cases filed etc), forgive my ignorance. I know he has removed some officials for corruption, but have they been prosecuted?**\n\nPeople get fired and cases were filed iirc. Do you have anyone in mind? I have some means to get information. \n\n**- In spite of all the negatives you mentioned, you still feel like this admin is a net positive?**\n\nYes.\n\n**- My top 3 issues with Duterte are: (a) encouragement of a culture of violence; and (b) support for GMA and the Marcoses; (c) apparent willingness to submit to the Chinese govt. For me the vast number of killings (including those done by vigilantes and those of cops trying to fill quotas, imagined or otherwise, and those of innocents) is completely unacceptable. Is there something you can tell me to convince me to support him?**\n\na. I agree with you on this one. But he warned us before the election, it will be bloody, which I hoped was just a joke but was true. Let's not forget the police had over 100 casualties as well. \n\nb. Again, I agree with you on this one. I hope he would start utilizing other brilliant minds to get things done. I respect GMA's knowledge in economics and gov't transition, I respect the Marcos' knowledge in country side development and infra, but there are also other people qualified for this. \n\nc. Fake vigilante groups, drug syndicate infighting, police scalawags are just few of the problems. They are now being addressed by PNP. We just have to have faith in the process. \n\n**- Have there been instances that made you doubt your support for the administration?**\n\nYes, when they appointed some shady people in the cabinet. \n\n**- What would be a dealbreaker for you, i.e. something this administration would do that would end your support? In my opinion, the president has personally expressed support and/or tolerance for murder, lying, planting evidence, suppressing the press, political dynasties, vote-buying, making allegations without proof, and so on, so I find it difficult to imagine what could be worse than all of these.**\n\nFirst, I would suggest that you watch the full speech for all the instances the president expressed support for all the topics listed above. Again, half truths are the best lies. Don't trust the media too much. \n\nAs for the dealbreaker, can't think one right now. Maybe I haven't encountered it.",
  "date": "2019-05-16 01:51:22",
  "photo": null,
  "source_url": "https://www.reddit.com/r/Philippines/comments/botnry/are_there_real_admin_supporters_here_on_rph/enp8w4d/",
  "source": "reddit"
}