{
  "id": "542cd54f-a7bb-4efb-b0a3-5fc940bb57b9",
  "name": "Jaime L. Garcia",
  "url": "https://www.facebook.com/jaime.l.garcia.779",
  "text": "[I&#x27;m not sure if it&#x27;s possible, since I don&#x27;t really watch the show to know all the lore but] Burn it (or otherwise get rid of it in a way that no one can use it anymore).",
  "date": "2016-07-20 00:00:00",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154759411248912#10154759458923912",
  "source_obj": {
    "id": "10154759458923912",
    "poster": "Jaime L. Garcia",
    "poster_url": "/jaime.l.garcia.779?refid=52&_ft_=mf_story_key.10154759411248912%3Atop_level_post_id.10154759411248912%3Atl_objid.10154759411248912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10154759411248912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "[I'm not sure if it's possible, since I don't really watch the show to know all the lore but] Burn it (or otherwise get rid of it in a way that no one can use it anymore).",
    "attachments": [],
    "date": "Jul 20, 2016",
    "replies": [
      {
        "id": "10154759476478912",
        "poster": "Jhayr Rufin",
        "poster_url": "/jhaydreamer?__tn__=R",
        "text": "good guy rando",
        "attachments": [],
        "date": "Jul 20, 2016",
        "replyto": "10154759458923912"
      },
      {
        "id": "10154759501668912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "More like scared guy.    What else are you going to use it for? Let's Overthink(tm).    You have four initial options.    a) Go on a killing spree.  b) Not go on a killing spree, but hold it.  c) Wait a bit, rationalize to yourself, etc. but eventually settle on a or b or d.  d) Let go of it, bury it, or somehow not destroy it but lose possession of it.    c is just a time loop, you'll eventually do a or b or d.     d just passes this problem to someone else, or if no one else acquires it, renders this discussion moot. I won't talk about this scenario any further.    A. You can go on a killing spree <for whatever reason>, in which case, you don't care about ethics or power struggles or being secretly hated or due process, this entire argument doesn't apply. Go for broke.     <I don't want to go on a killing spree, so I move on to the next option.>    B. You can keep it a secret to hold the power, but never quite using it. If you stop doing B, you do A, in which case, have fun.    If someone finds out, it will devolve to either:    a) You can't be trusted with it. Let's destroy it. (Essentially what I want because of this).  b) You can't be trusted with it. Give it to me. (This won't end well, but if you give it, they have this problem, and may kill you)  c) I trust you for now. Until you have to kill some people. (skip to next situation)   d) I trust you completely and it will never change despite what you do (no problem / true love, skip to next situation)    Eventually, someone else finds out through the person who knows (if you don't kill them or destroy the book) who wants a or b.    You have to kill them, or lose the book (and probably die) so people who think c, are now in a or b territory. Resolve as before.    Repeat ad nauseum.     The Final Resolution is one of the ff. scenarios:    1. You'll be either dead, or*   2. You'll be left with people who unconditionally  love you (d'aww).     I personally cannot live with #2 for practical reasons. The people I know who might love me unconditionally  can't run an entire planet well enough to guarantee the lifestyle I'm used to. I don't want to have to forage or repopulate the world, etc.    Being in between the time you get death note and the Final Resolution is arguably the most stressful situation you will ever be in. You will not be able to sleep well. You will wonder who you can trust, and who will betray you. You will hide it, but never be truly confident that it can be hidden.    The only way to assure my sanity is to destroy it.    * #1 can also come from you've kept the secret (until you die a natural death) successfully and no one knew it existed, rendering this discussion moot. Or you managed to die a natural death before reaching the Final Resolution.     But, you still feel all the stress and anxiety from not being sure about people, and keeping it safe, which is really not necessary.",
        "attachments": [],
        "date": "Jul 20, 2016",
        "replyto": "10154759458923912"
      },
      {
        "id": "10154759530778912",
        "poster": "Marco Sancho",
        "poster_url": "/marco.sancho?__tn__=R",
        "text": "There's only one thing to do with it. Use it. Lol",
        "attachments": [],
        "date": "Jul 20, 2016",
        "replyto": "10154759458923912"
      }
    ]
  }
}