{
  "id": "3e127985-27d4-4054-9006-41b393a03123",
  "name": "Luc Valencia",
  "url": "https://www.facebook.com/luc.valencia",
  "text": "It is both - for two decades  i.e., from late 70s to early 90s, there was a chronic underinvestment  in power sector. The Ramos administration in its desperation to attract new investment back in the 90s introduced laws which liberalized our power sector. Independent power producers essentially took advantage of the situation i.e., sort of arm twisting  our decision makers that in order to solve the power crisis, the government have to enter into contract fully aware that the terms are heavily advantageous to the IPPs interests and not with consumers. Also, the government established PSALM to divest Napocor&#x27;s generation assets at a loss with the liabilities being passed to consumers (in fact in spite of selling almost all Napocor power generation facilities, PSALM is technically bankrupt owing US$20billion). To make matters worse is that in spite of essentially fully liberalizing the power generation sector - the government have not so far made similar liberalization measures on the power transmission sector. Essentially, the power transmission sector is still being owned, managed and operated solely by Transco (except for a few transmission line owned by Meralco directly connected to Lopez owned facilities). Transco being a state owned company, is hounded by bureaucracy, red tape and mismanagement, and has not made any significant improvement in transmission facilities. So there is a mismatch between power generation as against transmission requirements, leading to inefficiency in the grid.    Generation charge is I think purely the cost supposed to be for generating electricity i.e., cost for coal/ bunker fuel oil, operations cost, etc. Regarding the &quot;retail cost&quot; - they are less transparent about this and it may include rural electrification, cost related to questionable terms in the contract (i.e., such as the second example I had in my earlier reply), SCC/SL, etc. I believe system losses from the inefficient grid is charged separately.",
  "date": "2013-12-16 00:00:13",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10152663942558912#10152664903328912",
  "source_obj": {
    "id": "10152664903328912",
    "poster": "Luc Valencia",
    "poster_url": "/luc.valencia?refid=52&_ft_=mf_story_key.10152663942558912%3Atop_level_post_id.10152663942558912%3Atl_objid.10152663942558912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10152663942558912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "It is both - for two decades  i.e., from late 70s to early 90s, there was a chronic underinvestment  in power sector. The Ramos administration in its desperation to attract new investment back in the 90s introduced laws which liberalized our power sector. Independent power producers essentially took advantage of the situation i.e., sort of arm twisting  our decision makers that in order to solve the power crisis, the government have to enter into contract fully aware that the terms are heavily advantageous to the IPPs interests and not with consumers. Also, the government established PSALM to divest Napocor's generation assets at a loss with the liabilities being passed to consumers (in fact in spite of selling almost all Napocor power generation facilities, PSALM is technically bankrupt owing US$20billion). To make matters worse is that in spite of essentially fully liberalizing the power generation sector - the government have not so far made similar liberalization measures on the power transmission sector. Essentially, the power transmission sector is still being owned, managed and operated solely by Transco (except for a few transmission line owned by Meralco directly connected to Lopez owned facilities). Transco being a state owned company, is hounded by bureaucracy, red tape and mismanagement, and has not made any significant improvement in transmission facilities. So there is a mismatch between power generation as against transmission requirements, leading to inefficiency in the grid.    Generation charge is I think purely the cost supposed to be for generating electricity i.e., cost for coal/ bunker fuel oil, operations cost, etc. Regarding the \"retail cost\" - they are less transparent about this and it may include rural electrification, cost related to questionable terms in the contract (i.e., such as the second example I had in my earlier reply), SCC/SL, etc. I believe system losses from the inefficient grid is charged separately.",
    "attachments": [],
    "date": "Dec 16, 2013"
  }
}