{
  "id": "f64f8a4a-0b46-452f-98c7-9e8416a4c024",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "At this point, the only way they&#x27;ll find it is if it landed somewhere and some spy-work turns up intelligence from some guy who talked too much at a bar some months from now.    If it crashed, they may find it in a couple of years, but most likely, they&#x27;ll *never* find it.    That satellite link is only one ping per hour, so even if they could locate based on just that single connection that would just give a circle with a radius perhaps as large as the plane&#x27;s range given an hour.    So that&#x27;s a circle with an 800 km radius. That&#x27;s like 2 million square kilometers to look for a skinny object only 70 meters long. Even if the wreckage gets spread out across 10,000 square meters, that&#x27;s like, a target area that is 1/(2*10^8) of the search space. And that&#x27;s if they could find the center of the circle from the satellite ping... which apparently, they can&#x27;t. So, not only is it looking for a needle inside a giant field, we don&#x27;t even know where the field is beyond a few datapoints earlier in the path....",
  "date": "2014-03-18 00:00:01",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10152841480413912#10152845540923912",
  "source_obj": {
    "id": "10152845540923912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&refid=52&_ft_=mf_story_key.10152841480413912%3Atop_level_post_id.10152841480413912%3Atl_objid.10152841480413912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10152841480413912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "At this point, the only way they'll find it is if it landed somewhere and some spy-work turns up intelligence from some guy who talked too much at a bar some months from now.    If it crashed, they may find it in a couple of years, but most likely, they'll *never* find it.    That satellite link is only one ping per hour, so even if they could locate based on just that single connection that would just give a circle with a radius perhaps as large as the plane's range given an hour.    So that's a circle with an 800 km radius. That's like 2 million square kilometers to look for a skinny object only 70 meters long. Even if the wreckage gets spread out across 10,000 square meters, that's like, a target area that is 1/(2*10^8) of the search space. And that's if they could find the center of the circle from the satellite ping... which apparently, they can't. So, not only is it looking for a needle inside a giant field, we don't even know where the field is beyond a few datapoints earlier in the path....",
    "attachments": [],
    "date": "Mar 18, 2014"
  }
}