{
  "id": "89a06dd6-42c0-43b8-8066-4ba1f7a3cb2f",
  "name": "[deleted]",
  "url": "https://www.reddit.com/r/StreetFighter/comments/4f5on1/sfv_ryu_meaty_set_ups_off_everything/d26njqm/",
  "text": "Technically speaking, a meaty is when your opponent wakes up into an attack while that attack's active frames are currently on screen.  They go from being on the ground to immediately, actively being struck once they stand up.\n\nSFV runs at a strict 60 **frames** per second.  **One frame** is equivalent to one sixtieth of a second.  Every animation has a certain number of frames to it.\n\nThere's three different types of frames to every animation -- startup, active, and recovery, and they are always in that order.  Startup is the first part of the animation where the move is coming out -- the attack can't yet hit anyone here because it's not yet \"out\" on screen, it's in the process of getting there.  Active is when the move *is* \"out\", in these frames of the animation it can contact and do damage against someone.  Recovery is when the move is being pulled back in, it can't hit anyone here either.\n\nA lot of these setups in this video aren't *technically* meaties but they stuff a lot of attacks coming out because even though the opponent doesn't wake up into the active frames, the active frames of Ryu's attack are going to eventually be out before the opponent can get their own button out.  Make sense?  So even if it's not a meaty, let's say Ryu's strike hits on the third frame after someone wakes up, they still can't get a move out fast enough to disrupt Ryu's attack even though Ryu's attack wasn't a true meaty.\n\nYes, you do have to block to avoid being hit which leaves you open to a throw.  If you input buttons or a throw tech in your immediate wakeup you will be hit by a meaty.  If you input a *delayed* throw shortly *after* blocking on wakeup, you can usually block a meaty if they do one, then *also* tech a throw if they try to throw you instead (usually referred to as delay tech).  Your opponent can \"throw bait\" the delay tech by not attacking and shimmying to bait out the throw then punish the whiff, or he can not shimmy but deliberately delay his button a small fraction of a second to not hit you meaty but hit your delay tech if he assumes you will delay tech.\n\nYou can also use an invincible move to avoid being hit or thrown on your wakeup during these disadvantaged situations, but they are generally riskier than a simple delay tech.\n\nThe different recoveries are easy to react to on the fly.  The roll recovery lets the opponent stand only slightly slower than the regular quick rise (it's 5 frames slower to be exact) so you have to add a very small delay to your attack but it's usually easy to compensate for.  With Ryu, a lot of his setups are the same regardless if it's back roll or regular quick rise.  L/M/H Tatsu, EX fireball, and sweep don't really care either way so you don't have to worry about discerning between the different wakeups in those circumstances unless you're going for a very specific wakeup attack.  EX Tatsu yields a zero or \"neutral\" frame advantage after regular quick rise recovery if you dash twice, so you risk trading an attack with your opponent unless you use your st.lp (3f startup) against someone who doesn't have a 3f normal.  You also can not back roll off throws, only regular quick rise, so you never have to worry about adjusting anything on the fly off a throw.\n\nOutside of invincible moves, there are only a handful of options in the game which escape wakeup attacks that are not true meaties.  Charlie's v-trigger is only vulnerable for the *very first* frame and then is invincible from the second frame onwards, so if you don't perfectly time your meaty to hit his first frame on wakeup he will escape.  There are also armored attacks that gain armor in the third frame of their animation, these armored attacks have to be stuffed in either their first or second startup frame or else they will beat your wakeup attack since it wasn't a true meaty.\n\nTo practice if something is a true meaty or not take Nash as your training dummy and make him teleport on wakeup.  If he escapes your attack it means your attack was not a true meaty.\n\nPlease don't hesitate to ask for clarification about any of these points.",
  "date": "2016-04-17 19:56:55",
  "photo": null,
  "source_url": "https://www.reddit.com/r/StreetFighter/comments/4f5on1/sfv_ryu_meaty_set_ups_off_everything/d26njqm/",
  "source": "reddit"
}