{
  "id": "06fd6c52-48a5-4cbd-9841-756a92eb29b7",
  "name": "Nick Solana",
  "url": "https://facebook.com/nicksolana",
  "text": "<AFAIK the killings are still on-going so why shouldn't they be discussed? >   - discuss away.. but to still not put 'alleged' before 'ejk' is just fine and dandy for you?    <Also, do you disagree with all the highlighted parts? Like, do you disagree that \"opposition is an integral part of how running a country works, and that those who disagree are just as much patriots as them, and simply see a different path out of the woods\"? Do you disagree that there is increasing popular support for authoritarianis m?>  - i think i have qualified why i 'loved'the highlighted parts:  \"the news is not good.\" - categorical statement. very one-sided.  \"These are murders, pure and simple.\" - irresponsible categorical statement. bordering on, if not right smack in the middle of, confirmation bias. ignores that there are killings that actually NOT criminal in nature(thus the possibility that there are other killings outside the death penalty that are 'judicial', or sanctioned by the justice system).    the next highlight: \"And then ... world outside.\" is a good example of “false-consensu s bias.” and how it morphs...    \"At a certain... no one shouting with them.\"  - pure speculation and really not grounded on actual reality. are there gov't attempts to censure any critic? social media has done away with that kind imposition of government don't you think?    \"This gradual ... stop to question themselves.\"  - just wow.     \"They are unable to understand ... a different path out of the woods.\"  - presumptuous.  are 'you', the opposite to the author's 'they' the only ones who are able to understand  such difficult, high-minded things?  >.<    \"But why would they act otherwise, ... by calling out their personal lives.\"  - selective and quite an over-generaliza tion/ oversimplificati on. presumes that 'they' have motivations as only the author says they can. presumes also that critics cannot be criticised.    \"He is a bully and a narcissist; he has no regard for human life and basic morality; ... even his most fanatic devotees should pause for a moment and check in with their humanity at the most basic level.\"  - presumptuous self-righteousn ess at its best. thouroughly self-absorbed. what else?    \"Worryingly, while the outraged middle classes are busy being aghast at the incivility of it all, and fighting ideological battles about the Marcos burial, he has quietly been amassing more power for himself.\"    - again, presumptuous, self-absorbed. how many in the middle-class(is  it limited to the middle-class?)w ho do not share the author's opinion aren't aghast or find it not quite as uncivil or as outrageous as the author?  Amassing power? how and why? by streamlining the bureacracy and delivering better services as a result? speculation and fear-mongering.      \"hrough a clever use of propaganda, fake news, appeals to emotion, distortion of facts, ... there is popular support for authoriarian rule.\"  - self-absorbed. does the author mean that social media, the (only) balwarte of the prrd apologists is orchestrated by RRD himself? is the author attempting to say that all his accusations are a one-way thing? that the rrd critics are averse to doing all that is being accused of RRD?    definitely an opinion piece. there, qualified.   ---  as for your question, Roy re: ' ...that there is increasing popular support for authoritarianis m'    there probably is, specially as more people are seeing more and more results that benefit the many and are witness to the ineptness of the opposition na lumalabas tuloy na panggulo lang sila and are not actually constructive, even as  conscientious objectors.    but due to the author's claims? No.",
  "date": "2016-10-07 09:55:05 +0800",
  "photo": "",
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154971776773912#10154971860633912#10154972333888912",
  "source": "facebook",
  "spam": false,
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10154971776773912#10154971860633912"
}