{
  "id": "961c9d4a-7999-4a62-9071-c0edc76b0fe5",
  "name": "Jon Limjap",
  "url": "https://www.facebook.com/LaTtEX",
  "text": "LOL. Both are major crises destroying most of your itinerary. That being said, losing a passport creates more trouble for tourists based on several factors:    1. Presence of an embassy of your country of citizenship in the country you lost your passport in. If there&#x27;s an embassy there, it&#x27;s easy to go there and deal with the problem there. Otherwise, you&#x27;re in deep shit.  2. Evidence and/or documentation corroborating your circumstances. If you&#x27;ve lost other documents like hotel vouchers, plane tickets, tour receipts, and other proof that you entered legally, you&#x27;re practically an illegal immigrant / human trafficking victim  3. If you ran out of luck in both of the above, you don&#x27;t really know which will happen to you: detained or deported. Either way is a harrowing, undesireable experience.    Losing money on the other hand:    1. You could withdraw money using your ATM or credit card cashback/cash advance service  2. You could seek help from Filipinos in the area  3. You could seek help from the embassy    The latter is easier.",
  "date": "2015-03-23 00:00:03",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10153654939718912#10153655106183912",
  "source_obj": {
    "id": "10153655106183912",
    "poster": "Jon Limjap",
    "poster_url": "/LaTtEX?refid=52&_ft_=mf_story_key.10153654939718912%3Atop_level_post_id.10153654939718912%3Atl_objid.10153654939718912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10153654939718912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "LOL. Both are major crises destroying most of your itinerary. That being said, losing a passport creates more trouble for tourists based on several factors:    1. Presence of an embassy of your country of citizenship in the country you lost your passport in. If there's an embassy there, it's easy to go there and deal with the problem there. Otherwise, you're in deep shit.  2. Evidence and/or documentation corroborating your circumstances. If you've lost other documents like hotel vouchers, plane tickets, tour receipts, and other proof that you entered legally, you're practically an illegal immigrant / human trafficking victim  3. If you ran out of luck in both of the above, you don't really know which will happen to you: detained or deported. Either way is a harrowing, undesireable experience.    Losing money on the other hand:    1. You could withdraw money using your ATM or credit card cashback/cash advance service  2. You could seek help from Filipinos in the area  3. You could seek help from the embassy    The latter is easier.",
    "attachments": [],
    "date": "Mar 23, 2015"
  }
}