{
  "id": "fe0ef37e-4f2b-4905-b39d-ddb30b96ea3b",
  "name": "starrwulfe",
  "url": "https://starrwulfe.xyz/about",
  "text": "Mentioned by https://starrwulfe.xyz/2024/02/on-the-subject-of-connecting-federated-social-media-networks/\r\n\r\n> my opinions and have some additional references, and deeper information: roytang.netFediverse Bridge, Bluesky, and Importing Comments · roytang.netRoy Tang's blog. Programmer, engineer, scientist, critic, gamer, dreamer, and kid-at-heart. Randomly amazed. hub.netzgemeinde.euA rant on the BridgyFed drama – Jupiter Rowland –",
  "date": "2024-02-19 00:10:15 +0800",
  "photo": "https://webmention.io/avatar/starrwulfe.xyz/9d739011db0f2bcb783b3b03f6673b4e37254142574dc8848b557d68f2e58ae4.jpg",
  "source_url": "https://starrwulfe.xyz/2024/02/on-the-subject-of-connecting-federated-social-media-networks/",
  "source": "webmention",
  "spam": false,
  "source_obj": {
    "type": "entry",
    "author": {
      "type": "card",
      "name": "starrwulfe",
      "photo": "https://webmention.io/avatar/starrwulfe.xyz/9d739011db0f2bcb783b3b03f6673b4e37254142574dc8848b557d68f2e58ae4.jpg",
      "url": "https://starrwulfe.xyz/about"
    },
    "url": "https://starrwulfe.xyz/2024/02/on-the-subject-of-connecting-federated-social-media-networks/",
    "published": "2024-02-18T16:10:15-05:00",
    "wm-received": "2024-02-19T21:05:54Z",
    "wm-id": 1783071,
    "wm-source": "https://starrwulfe.xyz/2024/02/on-the-subject-of-connecting-federated-social-media-networks/",
    "wm-target": "https://roytang.net/2024/02/fediverse-bluesky-comments/",
    "wm-protocol": "webmention",
    "name": "On the subject of Connecting Federated Social Media Networks",
    "syndication": [
      "https://bsky.app/profile/starrwulfe.xyz/post/3klpu4b5mao2j",
      "https://mastodon.cloud/@jlgatewood/111954575764766032",
      "https://news.indieweb.org/en/starrwulfe.xyz/2024/02/on-the-subject-of-connecting-federated-social-media-networks/",
      "https://micro.blog/starrwulfe/32019084",
      "https://micro.blog/starrwulfe/32019485",
      "https://www.facebook.com/jason.gatewood/posts/pfbid02VLNfxnJAJgrLq4nHGV94CBznDYPGT6wgj9NHwLEpZUGBUVcjJeVNUvfJfeK1K8uFl?__cft__%5B0%5D=AZULsDWmXvb0YCJtydZ__LhOfxCKudI6nOMMtCYYWXmp6TMQtxSBW_aFF4UhlKw-wP2QXQLxjjaa7mf05XUopbUiiyCr6pQni8GTAFEv04iIJA&__tn__=%2CO%2CP-R",
      "https://www.threads.net/@starrwulfe/post/C3iIjT9gb4j"
    ],
    "content": {
      "html": "<p>The past few days on the Fediverse have served to remind me a few things:</p>\n\n\n\n<ol><li>The internet is as smart and as ignorant (and everything in between) as the macrocosm known as “human civilization” reflects upon it.</li>\n\n\n\n<li>Sometimes the victims will become the victimizers in any given situation, usually without them being aware of it.</li>\n\n\n\n<li>Upon pointing it out to said type above, instead of working to acknowledge and understand, they will double-down under the guise of righteousness, again unwittingly using the exact playbook that they had been persecuted under at some point in the past.</li>\n\n\n\n<li>As usual, any attempt by a rational third party to diffuse whatever situation breaking out on the internet will lead to a wider conflict/argument/brigade session where everyone winds up digging their heels in and missing entirely the point.</li>\n\n\n\n<li>And finally, as usual, there’s a 95% chance it was started by someone who was all to ready to be triggered by anything and everything so they could start some shit on the internet at that moment.</li>\n</ol><p>OK, with that preamble out the way, let’s get into the latest drama related iconically to trying to bridge this patchwork, fledgling open social media landscape. As you may be aware, there are two federated decentralized social media protocols that are pretty big right now; ActivityPub and ATProto. Per my previous notes on both:</p>\n\n\n\n<ul><li><strong>ActivityPub</strong> is a federated social networking protocol that enables users to interact across different servers and platforms used by popular projects like Mastodon, Pleroma, and PeerTube. It’s been around since 2017 and is born from previous projects like Statusnet and Ostatus. It’s in full federation right now, mainly serving as the underpinning to Mastodon, a microblogging server.</li>\n\n\n\n<li><strong>ATProto</strong> is a newer protocol developed by Bluesky, a public benefit company born from the ideas from former Twitter engineers. The protocol’s main advantage is that it provides true account portability and can scale up with search and discovery. Since it was originally developed to be the successor to Twitter, it also has hooks for composable moderation and algorithms. It’s not federated at the moment, but the only instance using it, the self-titular Bluesky (bsky.app) says “its immenent. Indeed, the company just took down the waitlist and <a href=\"https://starrwulfe.xyz/2024/02/bluesky-open-no-waiting/\">opened up registration to everyone</a> worldwide a few weeks ago.</li>\n</ul><a style=\"text-decoration:none;\" href=\"https://starrwulfe.xyz/2024/02/bluesky-open-no-waiting/\"><img style=\"width:100px;height:100px;\" src=\"https://i0.wp.com/starrwulfe.xyz/wp-content/uploads/2023/11/Starrwulfe-dark-pxl-removebg-preview.png?ssl=1\" alt=\"Bluesky takes the velvet rope down ????\" />Bluesky takes the velvet rope down ????Bluesky has opened up and requires no waitlist now, so if you were searching for a Twitter alternative, then here you go: Once registered, find me here: For reference: FeatureBlueskyActivityPub/Mastod…</a>\n\n\n<img src=\"https://res.craft.do/user/full/e09bfa88-b541-db43-4c63-c7deabc34ec1/doc/622D9929-46BE-471B-932C-D52B190D607C/8e1ce62f-b572-4678-bd26-90878da9ea57\" alt=\"OIG1.jpg\" style=\"width:483px;height:auto;\" /><h4><span style=\"text-decoration:underline;\">So what the hell happened?</span></h4>\n\n\n\n<p>In short, someone built something that can connect both networks together in a sense and a bunch of people who likely don’t really know the technology’s underpinnings instead proceeded to blow up their victim status to trigger everyone else and brigade the developer who was asking for constructive dialoge and ideas <strong>before</strong> he got too far in the development process.</p>\n\n\n<a style=\"text-decoration:none;\" href=\"http://snarfed.org/2024-02-12_52106\"><img style=\"width:100px;height:100px;\" src=\"https://i0.wp.com/snarfed.org/iraq_square.jpg?ssl=1\" alt=\"snarfed.org\" />snarfed.orgsnarfed.orgFediverse! I’ve been building a bridge to Bluesky, and they’re turning on federation soon, which means my bridge will be available soon too. You’ll be able to follow people on Blu…</a>\n\n\n<p>Now I must note, I’ve been using Ryan’s <a href=\"http://brid.gy\">Bridgy</a> site and suite of crossposting tools ever since I got into the <a href=\"https://indieweb.org\">Indieweb</a> movement as it ticks all my boxes for making my content go all over the web and whatever comments and discussions take place out there, I can track and archive them on my site without worrying if I’ll get taken down, or the site goes dark. Bridgy already has bridges for Mastodon, Reddit, Facebook, and even supported Instagram and Twitter before they became… drunk with power. I am eagerly awaiting the day when I can sit on Bluesky and follow Mastodon folks or sit on Mastodon and comment on Bluesky posts… Or better yet, tag everyone in both places from this blog right here. ActivityPub and ATProto are open source and its pretty easy to make tools like this unlike feeling around in the dark with undocumented APIs that may get shut down at any second; That’s why we can’t do this with Instagram!</p>\n\n\n\n<p>It’s no secret the fediverse is the social media of choice for those who feel voiceless and vulnerable on the other “big” networks; you can gain a sense of community and comradery on an instance with others sharing the same experiences. However, it is still <em>a <strong>social</strong> network.</em></p>\n\n\n\n<ul><li><span style=\"text-decoration:underline;\"><strong>Social</strong>:</span> relating to or involving activities in which people spend time talking to each other or doing enjoyable things with each other.</li>\n\n\n\n<li><span style=\"text-decoration:underline;\"><strong>Network</strong>:</span> a system of devices, or entities including people and animals that are connected and can communicate with each other.</li>\n</ul><p>So in regard to having a bridge to connect the two together… Yeah, it’s kind of a no-brainer and I thought everyone else was looking forward to having it like myself. Boy was I wrong:</p>\n\n\n\n<blockquote>\n<p>You need to make this opt IN not opt OUT. It absolutely fucking sucks that you want to force the majority of decentralized posts here into content for Jack fucking Dorsey.</p>\n<a href=\"https://zirk.us/@Cyrus/111920505291908560\">Cyrus (still a bit spooky tbh) (@Cyrus@zirk.us)</a></blockquote>\n\n\n\n<blockquote>\n<p>honestly fuck you. Do you really expect everybody to have enough space in their bios to opt-out of your fucking bs? How many opt-out bs am I supposed to put there?</p>\n<a href=\"https://fosspri.de/@joshix/111920546752258337\">Joshix ???? (@joshix@fosspri.de)</a></blockquote>\n\n\n\n<p></p>\n\n\n\n<img width=\"1200\" height=\"1200\" src=\"https://i0.wp.com/starrwulfe.xyz/wp-content/uploads/2024/02/image-2-scaled.jpeg?resize=2560%2C1702&amp;ssl=1\" alt=\"unsplash\" style=\"width:503px;height:auto;\" /><h4><span style=\"text-decoration:underline;\">My Take:</span></h4>\n\n\n\n<p>I honestly don’t get the vitrolic knee-jerk posts I saw coming left and right from some corners of the fediverse, then I started noticing the pattern: It’s mostly people not understanding what the goals of both ActivityPub and ATProto are as a protocol and their equating it to Mastodon and Bluesky as “psudo-corporations” that have some level of control… And even perhaps Ryan’s attempt to bridge both protocols with <em>free and open source software that is literally already working to bridge other social networks as I type this,</em> as some imaginary invasion mob coming to victimize them on the internet. ????</p>\n\n\n\n<p>Allow me to say this as a member of a marginalized group of people in real life who has had my share of internet trolls come at me: (I’m a Black man from the USA, and I have yet to <a href=\"https://www.youtube.com/watch?v=RGHSlynth_A\">lose my Black Card,</a> am a refugee repping <a class=\"u-tag u-category\" href=\"https://starrwulfe.xyz/tag/blacktwitter/\">#BlackTwitter</a> into the Fediverse on both Bsky and Masto so I think I can speak on some things.)</p>\n\n\n\n<ol><li><strong>Get out of your feelings.</strong> The animosity is unwarranted and uncalled for. This is the internet and it wasn’t designed for you to have your entire-ass identity tied to it. This is truely the reason social media is some bullshit sometimes. The internet is supposed to be a communication tool, not some MMORPG for y’all to live your whole existence. If anything, your IRL personality should extend INTO it, not the other way around. Dude could’ve just cut the bridge on, posted Github links and lol’d all the way to the way to the next project and there wouldn’t be much you or I could say; the fediverse has no Ts&amp;Cs to violate!</li>\n\n\n\n<li><strong>Attempt to learn the technology before you postulate whatever opinions around it.</strong> Don’t come up with some off-the-cuff hot take on how you think the bridge is suddenly going to aim 3 million users of Network A at your posts on being a furry/inanimate-curious who happens to be in a cross-species relationship with a hubcap from a 1993 Chevy Corsica that happen to be publicly available on Network B. That’s not how network bridges work. Understand that whatever you’ve posted publicly anywhere is subject to someone reading it and deciding to give you a like or give a hateful comment. They don’t need a bridge to do it; they can <em>already just make an account on the network you’re already on and fuck with you.</em> It’s actually easier for them and less traceable!</li>\n\n\n\n<li><strong>We already have bridges now.</strong> Consider this post is on my own personal blog powered by WordPress. It’s being cross-posted <a href=\"https://starrwulfe.xyz/2024/02/on-the-subject-of-connecting-federated-social-media-networks/www.indieweb.org/POSSE\">POSSE-style</a> to wherever you’re reading this or got referred from, whether it was through an automatic script, or I manually cut and pasted over. My blog <em>is already acting as a bridge</em> and there are many others like it. It’s been that way in the past, and someone was bound to create this technology. If it’s not @snarfed, then it’ll be someone else. But mark my words, it’s gonna happen.</li>\n\n\n\n<li><strong>Learn the difference between protocols and applications.</strong> Bluesky is an application on the ATProto protocol. Mastodon is an application on the ActivityPub protocol. Both are facets of the wider fediverse. Don’t conflate these things. This blog is an application on BOTH those protocols and also does webmentions and other cool things. Once ATProto is fully federated and opened, it’s only a matter of time before I can snag an ATProto plugin in the same manner as the ActivityPub one and have it not even need to rely on a “translator” like Bridgy for that part. (If I just lost you with the technobabble, now you see why it’s important to seek to understand this technology before reacting to some perceived threat.)</li>\n\n\n\n<li><strong>You’re not in a walled garden on the fediverse.</strong> You’re in the open and as such you more than anyone should understand and respect the right to choose. The power here is in your hands and you have the ability to block, but your right to do so ends at the tip of your own nose and doesn’t come anywhere near mine. Also realize both ActivityPub and ATProto were designed for openness first; if you seek privacy and isolation, then you need to grab Signal and create some rooms there with some buddies away from the open internet.</li>\n\n\n\n<li><strong>Assholes exist everywhere.</strong> Don’t conflate the tech of one place with the ability to keep bigots, fascists, bullys, and jackasses from your timeline. Moreover, don’t shoo away people that are trying to do things that are inevitable anyway from doing it correctly! Understand federation is going to happen with or without your input if not by this project, by someone else. There’s no hiding, there’s no “safe place” except the one you create and control yourself within or without these places.</li>\n</ol><blockquote>\n<p>Letting you connect to other people you care about is not unethical or immoral. You have a lot of options for whether you want to participate in the BS bridge–either by managing your follows directly, by blocking users from that domain, or by blocking the whole domain. This is how federation works. You have absolute control over who you interact with.</p>\n<a href=\"https://social.vivaldi.net/@evan@cosocial.ca/111925732614920143\">Evan Prodromou (@evan@cosocial.ca)</a></blockquote>\n\n\n\n<p></p>\n\n\n\n<p>I’m approaching this line of thinking from my longtime use, contribution and propagation of FOSS/open-source software and the use of my actual social media of choice, the <a href=\"https://starrwulfe.xyz/2024/02/on-the-subject-of-connecting-federated-social-media-networks/indieweb.org\">indieweb</a> which is best summed up here:</p>\n\n\n\n<blockquote>\n<p>The <a href=\"https://werd.io/tag/IndieWeb\">#IndieWeb</a> is for everyone, everyone who wants to be part of the world-wide-web of interconnected people. The social internet of people, a network of networks of people, connected peer-to-peer in human-scale groups, communities of locality and affinity.</p>\n<a href=\"https://tantek.com/2024/026/t3/indieweb-for-everyone-internet-of-people\">tantek.com</a></blockquote>\n\n\n\n<p></p>\n\n\n\n<p>Also, one more thing:</p>\n\n\n\n<blockquote>\n<p>The most important lesson, I’ve ever learned about online privacy is this one: If you want something to be private online, don’t put it online in the first place.</p>\n<a href=\"https://firefish.city/notes/9pnkueekhq2o190m\">DavidB (@DavidBHimself)</a></blockquote>\n\n\n\n<h4 style=\"text-transform:capitalize;\"><em><span style=\"text-decoration:underline;\">Updates &amp; Errata</span></em></h4>\n\n\n\n<p>Pardon the typos, grammar bombs and double negatives in my “stream of consciousness” manner of writing this particular post. My years of journalism prowess still requires fresh eyes and a fresher cup of coffee. Being that this is my blog and not a column in a major publication, I’m a bit lax so ????????‍♂️ …fuhgeddaboudit!</p>\n\n\n\n<p>???? Some other posts I’ve been reading that align with my opinions and have some additional references, and deeper information:</p>\n\n\n<a style=\"text-decoration:none;\" href=\"https://roytang.net/2024/02/fediverse-bluesky-comments/\"><img style=\"width:100px;height:100px;\" src=\"https://i0.wp.com/roytang.net/static/img/profile.jpg?ssl=1\" alt=\"Fediverse Bridge, Bluesky, and Importing Comments · roytang.net\" />roytang.netFediverse Bridge, Bluesky, and Importing Comments · roytang.netRoy Tang's blog. Programmer, engineer, scientist, critic, gamer, dreamer, and kid-at-heart. Randomly amazed.</a>\n\n<a style=\"text-decoration:none;\" href=\"https://hub.netzgemeinde.eu/channel/jupiter_rowland?mid=b64.aHR0cHM6Ly9odWIubmV0emdlbWVpbmRlLmV1L2l0ZW0vYjk3NTRkNzAtMTRmNi00MDYxLTliOTAtOWM4ODc4NzY1MjNm\"><img style=\"width:100px;height:100px;\" src=\"https://hub.netzgemeinde.eu/photo/profile/l/1035\" alt=\"A rant on the BridgyFed drama - Jupiter Rowland - jupiter_rowland@hub.netzgemeinde.eu\" />hub.netzgemeinde.euA rant on the BridgyFed drama – Jupiter Rowland – jupiter_rowland@hub.netzgemeinde.eu@FreeSchool=Learn Respect Love »I think it's a good way to educate actually, and could you reply again what you would reply typically to your own post if someone asked \"ok so how is it if not that?\" s…</a>\n\n<a style=\"text-decoration:none;\" href=\"https://www.timothychambers.net/2024/02/13/indiewebsocial-and-the.html\">www.timothychambers.netIndieweb.Social and the Upcoming #BlueSkyBridgeThis is a brief announcement announcing Indieweb.social’s future software bridge work by BridgyFed – fed.brid.gy – will enable interoperability between ActivityPub networks and AT Protocol/BlueSky use…</a><span>????????</span><ul><li><a class=\"u-syndication\" href=\"https://bsky.app/profile/starrwulfe.xyz/post/3klpu4b5mao2j\"> <span style=\"max-width:1rem;margin:2px;\" title=\"bsky\"></span>bsky</a></li><li><a class=\"u-syndication\" href=\"https://mastodon.cloud/@jlgatewood/111954575764766032\"> <span style=\"max-width:1rem;margin:2px;\" title=\"Mastodon\">Mastodon</span>Mastodon</a></li><li><a class=\"u-syndication\" href=\"https://news.indieweb.org/en/starrwulfe.xyz/2024/02/on-the-subject-of-connecting-federated-social-media-networks/\"> <span style=\"max-width:1rem;margin:2px;\" title=\"indieweb\"></span>indieweb</a></li><li><a class=\"u-syndication\" href=\"https://micro.blog/starrwulfe/32019084\"> <span style=\"max-width:1rem;margin:2px;\" title=\"Micro.blog\">Micro.blog</span>Micro.blog</a></li><li><a class=\"u-syndication\" href=\"https://micro.blog/starrwulfe/32019485\"> <span style=\"max-width:1rem;margin:2px;\" title=\"Micro.blog\">Micro.blog</span>Micro.blog</a></li><li><a class=\"u-syndication\" href=\"https://www.facebook.com/jason.gatewood/posts/pfbid02VLNfxnJAJgrLq4nHGV94CBznDYPGT6wgj9NHwLEpZUGBUVcjJeVNUvfJfeK1K8uFl?__cft__%5B0%5D=AZULsDWmXvb0YCJtydZ__LhOfxCKudI6nOMMtCYYWXmp6TMQtxSBW_aFF4UhlKw-wP2QXQLxjjaa7mf05XUopbUiiyCr6pQni8GTAFEv04iIJA&amp;__tn__=%2CO%2CP-R\"> <span style=\"max-width:1rem;margin:2px;\" title=\"Facebook\">Facebook</span>Facebook</a></li><li><a class=\"u-syndication\" href=\"https://www.threads.net/@starrwulfe/post/C3iIjT9gb4j\"> <span style=\"max-width:1rem;margin:2px;\" title=\"Threads\">Threads</span>Threads</a></li></ul>",
      "text": "The past few days on the Fediverse have served to remind me a few things:\n\n\n\nThe internet is as smart and as ignorant (and everything in between) as the macrocosm known as “human civilization” reflects upon it.\n\n\n\nSometimes the victims will become the victimizers in any given situation, usually without them being aware of it.\n\n\n\nUpon pointing it out to said type above, instead of working to acknowledge and understand, they will double-down under the guise of righteousness, again unwittingly using the exact playbook that they had been persecuted under at some point in the past.\n\n\n\nAs usual, any attempt by a rational third party to diffuse whatever situation breaking out on the internet will lead to a wider conflict/argument/brigade session where everyone winds up digging their heels in and missing entirely the point.\n\n\n\nAnd finally, as usual, there’s a 95% chance it was started by someone who was all to ready to be triggered by anything and everything so they could start some shit on the internet at that moment.\nOK, with that preamble out the way, let’s get into the latest drama related iconically to trying to bridge this patchwork, fledgling open social media landscape. As you may be aware, there are two federated decentralized social media protocols that are pretty big right now; ActivityPub and ATProto. Per my previous notes on both:\n\n\n\nActivityPub is a federated social networking protocol that enables users to interact across different servers and platforms used by popular projects like Mastodon, Pleroma, and PeerTube. It’s been around since 2017 and is born from previous projects like Statusnet and Ostatus. It’s in full federation right now, mainly serving as the underpinning to Mastodon, a microblogging server.\n\n\n\nATProto is a newer protocol developed by Bluesky, a public benefit company born from the ideas from former Twitter engineers. The protocol’s main advantage is that it provides true account portability and can scale up with search and discovery. Since it was originally developed to be the successor to Twitter, it also has hooks for composable moderation and algorithms. It’s not federated at the moment, but the only instance using it, the self-titular Bluesky (bsky.app) says “its immenent. Indeed, the company just took down the waitlist and opened up registration to everyone worldwide a few weeks ago.\nBluesky takes the velvet rope down ????Bluesky has opened up and requires no waitlist now, so if you were searching for a Twitter alternative, then here you go: Once registered, find me here: For reference: FeatureBlueskyActivityPub/Mastod…\n\n\nSo what the hell happened?\n\n\n\nIn short, someone built something that can connect both networks together in a sense and a bunch of people who likely don’t really know the technology’s underpinnings instead proceeded to blow up their victim status to trigger everyone else and brigade the developer who was asking for constructive dialoge and ideas before he got too far in the development process.\n\n\nsnarfed.orgsnarfed.orgFediverse! I’ve been building a bridge to Bluesky, and they’re turning on federation soon, which means my bridge will be available soon too. You’ll be able to follow people on Blu…\n\n\nNow I must note, I’ve been using Ryan’s Bridgy site and suite of crossposting tools ever since I got into the Indieweb movement as it ticks all my boxes for making my content go all over the web and whatever comments and discussions take place out there, I can track and archive them on my site without worrying if I’ll get taken down, or the site goes dark. Bridgy already has bridges for Mastodon, Reddit, Facebook, and even supported Instagram and Twitter before they became… drunk with power. I am eagerly awaiting the day when I can sit on Bluesky and follow Mastodon folks or sit on Mastodon and comment on Bluesky posts… Or better yet, tag everyone in both places from this blog right here. ActivityPub and ATProto are open source and its pretty easy to make tools like this unlike feeling around in the dark with undocumented APIs that may get shut down at any second; That’s why we can’t do this with Instagram!\n\n\n\nIt’s no secret the fediverse is the social media of choice for those who feel voiceless and vulnerable on the other “big” networks; you can gain a sense of community and comradery on an instance with others sharing the same experiences. However, it is still a social network.\n\n\n\nSocial: relating to or involving activities in which people spend time talking to each other or doing enjoyable things with each other.\n\n\n\nNetwork: a system of devices, or entities including people and animals that are connected and can communicate with each other.\nSo in regard to having a bridge to connect the two together… Yeah, it’s kind of a no-brainer and I thought everyone else was looking forward to having it like myself. Boy was I wrong:\n\n\n\n\nYou need to make this opt IN not opt OUT. It absolutely fucking sucks that you want to force the majority of decentralized posts here into content for Jack fucking Dorsey.\nCyrus (still a bit spooky tbh) (@Cyrus@zirk.us)\n\n\n\n\nhonestly fuck you. Do you really expect everybody to have enough space in their bios to opt-out of your fucking bs? How many opt-out bs am I supposed to put there?\nJoshix ???? (@joshix@fosspri.de)\n\n\n\n\n\n\n\nMy Take:\n\n\n\nI honestly don’t get the vitrolic knee-jerk posts I saw coming left and right from some corners of the fediverse, then I started noticing the pattern: It’s mostly people not understanding what the goals of both ActivityPub and ATProto are as a protocol and their equating it to Mastodon and Bluesky as “psudo-corporations” that have some level of control… And even perhaps Ryan’s attempt to bridge both protocols with free and open source software that is literally already working to bridge other social networks as I type this, as some imaginary invasion mob coming to victimize them on the internet. ????\n\n\n\nAllow me to say this as a member of a marginalized group of people in real life who has had my share of internet trolls come at me: (I’m a Black man from the USA, and I have yet to lose my Black Card, am a refugee repping #BlackTwitter into the Fediverse on both Bsky and Masto so I think I can speak on some things.)\n\n\n\nGet out of your feelings. The animosity is unwarranted and uncalled for. This is the internet and it wasn’t designed for you to have your entire-ass identity tied to it. This is truely the reason social media is some bullshit sometimes. The internet is supposed to be a communication tool, not some MMORPG for y’all to live your whole existence. If anything, your IRL personality should extend INTO it, not the other way around. Dude could’ve just cut the bridge on, posted Github links and lol’d all the way to the way to the next project and there wouldn’t be much you or I could say; the fediverse has no Ts&Cs to violate!\n\n\n\nAttempt to learn the technology before you postulate whatever opinions around it. Don’t come up with some off-the-cuff hot take on how you think the bridge is suddenly going to aim 3 million users of Network A at your posts on being a furry/inanimate-curious who happens to be in a cross-species relationship with a hubcap from a 1993 Chevy Corsica that happen to be publicly available on Network B. That’s not how network bridges work. Understand that whatever you’ve posted publicly anywhere is subject to someone reading it and deciding to give you a like or give a hateful comment. They don’t need a bridge to do it; they can already just make an account on the network you’re already on and fuck with you. It’s actually easier for them and less traceable!\n\n\n\nWe already have bridges now. Consider this post is on my own personal blog powered by WordPress. It’s being cross-posted POSSE-style to wherever you’re reading this or got referred from, whether it was through an automatic script, or I manually cut and pasted over. My blog is already acting as a bridge and there are many others like it. It’s been that way in the past, and someone was bound to create this technology. If it’s not @snarfed, then it’ll be someone else. But mark my words, it’s gonna happen.\n\n\n\nLearn the difference between protocols and applications. Bluesky is an application on the ATProto protocol. Mastodon is an application on the ActivityPub protocol. Both are facets of the wider fediverse. Don’t conflate these things. This blog is an application on BOTH those protocols and also does webmentions and other cool things. Once ATProto is fully federated and opened, it’s only a matter of time before I can snag an ATProto plugin in the same manner as the ActivityPub one and have it not even need to rely on a “translator” like Bridgy for that part. (If I just lost you with the technobabble, now you see why it’s important to seek to understand this technology before reacting to some perceived threat.)\n\n\n\nYou’re not in a walled garden on the fediverse. You’re in the open and as such you more than anyone should understand and respect the right to choose. The power here is in your hands and you have the ability to block, but your right to do so ends at the tip of your own nose and doesn’t come anywhere near mine. Also realize both ActivityPub and ATProto were designed for openness first; if you seek privacy and isolation, then you need to grab Signal and create some rooms there with some buddies away from the open internet.\n\n\n\nAssholes exist everywhere. Don’t conflate the tech of one place with the ability to keep bigots, fascists, bullys, and jackasses from your timeline. Moreover, don’t shoo away people that are trying to do things that are inevitable anyway from doing it correctly! Understand federation is going to happen with or without your input if not by this project, by someone else. There’s no hiding, there’s no “safe place” except the one you create and control yourself within or without these places.\n\nLetting you connect to other people you care about is not unethical or immoral. You have a lot of options for whether you want to participate in the BS bridge–either by managing your follows directly, by blocking users from that domain, or by blocking the whole domain. This is how federation works. You have absolute control over who you interact with.\nEvan Prodromou (@evan@cosocial.ca)\n\n\n\n\n\n\n\nI’m approaching this line of thinking from my longtime use, contribution and propagation of FOSS/open-source software and the use of my actual social media of choice, the indieweb which is best summed up here:\n\n\n\n\nThe #IndieWeb is for everyone, everyone who wants to be part of the world-wide-web of interconnected people. The social internet of people, a network of networks of people, connected peer-to-peer in human-scale groups, communities of locality and affinity.\ntantek.com\n\n\n\n\n\n\n\nAlso, one more thing:\n\n\n\n\nThe most important lesson, I’ve ever learned about online privacy is this one: If you want something to be private online, don’t put it online in the first place.\nDavidB (@DavidBHimself)\n\n\n\nUpdates & Errata\n\n\n\nPardon the typos, grammar bombs and double negatives in my “stream of consciousness” manner of writing this particular post. My years of journalism prowess still requires fresh eyes and a fresher cup of coffee. Being that this is my blog and not a column in a major publication, I’m a bit lax so ????????‍♂️ …fuhgeddaboudit!\n\n\n\n???? Some other posts I’ve been reading that align with my opinions and have some additional references, and deeper information:\n\n\nroytang.netFediverse Bridge, Bluesky, and Importing Comments · roytang.netRoy Tang's blog. Programmer, engineer, scientist, critic, gamer, dreamer, and kid-at-heart. Randomly amazed.\n\nhub.netzgemeinde.euA rant on the BridgyFed drama – Jupiter Rowland – jupiter_rowland@hub.netzgemeinde.eu@FreeSchool=Learn Respect Love »I think it's a good way to educate actually, and could you reply again what you would reply typically to your own post if someone asked \"ok so how is it if not that?\" s…\n\nwww.timothychambers.netIndieweb.Social and the Upcoming #BlueSkyBridgeThis is a brief announcement announcing Indieweb.social’s future software bridge work by BridgyFed – fed.brid.gy – will enable interoperability between ActivityPub networks and AT Protocol/BlueSky use…???????? bsky MastodonMastodon indieweb Micro.blogMicro.blog Micro.blogMicro.blog FacebookFacebook ThreadsThreads"
    },
    "mention-of": "https://roytang.net/2024/02/fediverse-bluesky-comments/",
    "wm-property": "mention-of",
    "wm-private": false,
    "rels": {
      "canonical": "https://starrwulfe.xyz/2024/02/on-the-subject-of-connecting-federated-social-media-networks/"
    }
  }
}