{
  "id": "c0f9efe5-0556-499c-a68c-9b0fb74b55ac",
  "name": "Jaime L. Garcia",
  "url": "https://www.facebook.com/jaime.l.garcia.779",
  "text": "[This&#x27;ll be really long, sorry. I wish I could be more brief.]    Conversation requires both parties&#x27; conscious consent. If the conversation is founded on unwavering faith in &lt;a&gt; over faith in &lt;b&gt;, fullstop (instead of reasons for supporting &lt;a&gt; over &lt;b&gt;), then it&#x27;s going to go nowhere either. Your second line is right in either scenario - it won&#x27;t be productive, and you&#x27;ll have to let democracy take its course.    In addition, if the well starts poisoned, back off already. I don&#x27;t just mean name-calling or other logical fallacies either, sometimes the crime is in the intent of the conversation. If either comes off as a missionary (I have the moral high ground, must convert the heathens!), you have the same problem as faith in &lt;a&gt; over faith in &lt;b&gt;, except either or both of you are trying to frame it using each person&#x27;s logical framework or value systems. These will be different.  This is a hard thing to do - clearing up the value system space without getting egos in the mix. But if both parties can get that far, you&#x27;re well on your way to a productive conversation.    Now that we&#x27;re done with the dead-end-cases. ..    I find that most misunderstandin gs are caused by both parties not using the same definition of terms, because of a lack of specific identity name.    I&#x27;m going to go out on a limb here and assume you&#x27;re talking about politics, and why people stand for certain people, politicians, political stances and philosophies, etc.    A lot of times, people will pick a stance or philosophy (or a person that embodies such) because they sorta believe in it, but not all the way. They might not even realize it is so, though, so you&#x27;ll have to suss it out from them.    [Sort of neutral example follows]  It&#x27;s easier to say, for example, that I am of the Flying Spaghetti Monster religion, and so are my views.     Even though the truth might be that I generally believe in the teachings of the FSM religion, but I have exceptions in certain beliefs that they provide, such as using a colander for the holy head gear! It should clearly be a steel pot! Because spaghetti is cooked in the pot, though it is strained in a strainer.  [Neutral example ends]    It&#x27;s quite easy to make an argument for and against a general identity by establishing relevant value systems and how they judge*. You don&#x27;t even need the other person for this. You construct the identity, and hope to whatever you believe in that the identity you&#x27;ve created isn&#x27;t a strawman, then give it an honest fight. You&#x27;ll still win every time because you control the value system and judgment* flow.    But if you want to really get into someone&#x27;s head, you gotta know their specific identity, their value systems, and how their judgment* works. Both sides have to be willing to discuss it all the way, and not take things personally, and not try to come into the discussion trying to specifically change the other person (that RARELY works).     * Values always have a priority structure in people, though we might not think about them well, and there is a high chance for them to be misstated in conversation. Beware superlatives. They might say things like all life is important, but they weigh things differently in their head from you, because it&#x27;s much easier to say that than give you a lawyer-style document on the matter.",
  "date": "2016-12-01 00:00:02",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155133376588912#10155133610823912",
  "source_obj": {
    "id": "10155133610823912",
    "poster": "Jaime L. Garcia",
    "poster_url": "/jaime.l.garcia.779?refid=52&_ft_=mf_story_key.10155133376588912%3Atop_level_post_id.10155133376588912%3Atl_objid.10155133376588912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155133376588912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "[This'll be really long, sorry. I wish I could be more brief.]    Conversation requires both parties' conscious consent. If the conversation is founded on unwavering faith in <a> over faith in <b>, fullstop (instead of reasons for supporting <a> over <b>), then it's going to go nowhere either. Your second line is right in either scenario - it won't be productive, and you'll have to let democracy take its course.    In addition, if the well starts poisoned, back off already. I don't just mean name-calling or other logical fallacies either, sometimes the crime is in the intent of the conversation. If either comes off as a missionary (I have the moral high ground, must convert the heathens!), you have the same problem as faith in <a> over faith in <b>, except either or both of you are trying to frame it using each person's logical framework or value systems. These will be different.  This is a hard thing to do - clearing up the value system space without getting egos in the mix. But if both parties can get that far, you're well on your way to a productive conversation.    Now that we're done with the dead-end-cases. ..    I find that most misunderstandin gs are caused by both parties not using the same definition of terms, because of a lack of specific identity name.    I'm going to go out on a limb here and assume you're talking about politics, and why people stand for certain people, politicians, political stances and philosophies, etc.    A lot of times, people will pick a stance or philosophy (or a person that embodies such) because they sorta believe in it, but not all the way. They might not even realize it is so, though, so you'll have to suss it out from them.    [Sort of neutral example follows]  It's easier to say, for example, that I am of the Flying Spaghetti Monster religion, and so are my views.     Even though the truth might be that I generally believe in the teachings of the FSM religion, but I have exceptions in certain beliefs that they provide, such as using a colander for the holy head gear! It should clearly be a steel pot! Because spaghetti is cooked in the pot, though it is strained in a strainer.  [Neutral example ends]    It's quite easy to make an argument for and against a general identity by establishing relevant value systems and how they judge*. You don't even need the other person for this. You construct the identity, and hope to whatever you believe in that the identity you've created isn't a strawman, then give it an honest fight. You'll still win every time because you control the value system and judgment* flow.    But if you want to really get into someone's head, you gotta know their specific identity, their value systems, and how their judgment* works. Both sides have to be willing to discuss it all the way, and not take things personally, and not try to come into the discussion trying to specifically change the other person (that RARELY works).     * Values always have a priority structure in people, though we might not think about them well, and there is a high chance for them to be misstated in conversation. Beware superlatives. They might say things like all life is important, but they weigh things differently in their head from you, because it's much easier to say that than give you a lawyer-style document on the matter.",
    "attachments": [],
    "date": "Dec 1, 2016",
    "replies": [
      {
        "id": "10155134433058912",
        "poster": "Jose Zapatos",
        "poster_url": "/jose.zapatos.9?__tn__=R",
        "text": "<start> Try to *get in their head* (non-obstrusive ly) ... plant *relevant* \"idea\" ... let simmer ... watch/ wait till they *realize-deconstruct* their POV and *empathize* with your *POV-assuming you have the better POV to begin with* <end>    <try a better POV>    <start> Try to *get in their head* (non-obstrusive ly) ... plant *relevant* \"idea\" ... let simmer ... watch/ wait till they *realize-deconstruct* their POV and *empathize* with your *POV-assuming you have the better POV to begin with* <end>",
        "attachments": [],
        "date": "Dec 1, 2016",
        "replyto": "10155133610823912"
      }
    ]
  }
}