{
  "id": "183d337d-3a3d-4e95-80bf-894c6774bdb2",
  "name": "Roy Tang",
  "url": "https://www.facebook.com/stephen.roy.tang",
  "text": "By &quot;breach the divide&quot;, I don&#x27;t really mean persuading others that you are correct, more like trying to find common ground and to learn from each other. At the very least we should be able to agree on certain things like the need to verify information and not simply believe everything we read on the internet or to be respectful to others that hold different opinions, but it seems many people aren&#x27;t even open to that. It&#x27;s just frustrating sometimes.",
  "date": "2016-12-01 00:00:01",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155133376588912#10155133597553912",
  "source_obj": {
    "id": "10155133597553912",
    "poster": "Roy Tang",
    "poster_url": "/stephen.roy.tang?refid=52&_ft_=mf_story_key.10155133376588912%3Atop_level_post_id.10155133376588912%3Atl_objid.10155133376588912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155133376588912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "By \"breach the divide\", I don't really mean persuading others that you are correct, more like trying to find common ground and to learn from each other. At the very least we should be able to agree on certain things like the need to verify information and not simply believe everything we read on the internet or to be respectful to others that hold different opinions, but it seems many people aren't even open to that. It's just frustrating sometimes.",
    "attachments": [],
    "date": "Dec 1, 2016",
    "replies": [
      {
        "id": "10155134003563912",
        "poster": "Lorenz Ponce",
        "poster_url": "/lponce?__tn__=R",
        "text": "I think this can only happen if both parties are open to discussion. I think some people just believe what they want to believe and not realize that there are other ways of looking at the issue or that the way they are looking at the issue might not be the only way. Parang math- many people only know one way to get to a solution and aren't open to other possible solutions.     It boils down to education (where do people get information) and addressing poverty  (kung kapit sa patalim kahit ano gagawin for the next meal- even if giving up rights or integrity). It's going to be a long process of change.",
        "attachments": [],
        "date": "Dec 1, 2016",
        "replyto": "10155133597553912"
      },
      {
        "id": "10155134750418912",
        "poster": "Mylee Ejercito",
        "poster_url": "/romancoat?__tn__=R",
        "text": "We have 5.5 years until the next presidential elections. We need to fast-track the process.",
        "attachments": [],
        "date": "Dec 1, 2016",
        "replyto": "10155133597553912"
      }
    ]
  }
}