{
  "id": "1b3a30e2-a6c6-4495-a846-7617c0476c23",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "It&#x27;s mostly cool in terms of the approach, but I have to disagree with the &quot;Determinism is the very definition of free will.&quot;    This is not a satisfactory use of the word determinism to me. Nothing shows the meaning of determinism more clearly than deterministic automata... If you&#x27;re at the point where the output is perfectly predictable by the input string, there is no free will because that process could produce nothing but that output. No choice is possible if the outcomes are set; the process itself cannot choose, based on one input to produce a different output other than what it was designed to do--the process has no control over its own output.    Perhaps it would be better expressed as: determinism at one level of abstraction does not preclude free will at a different level of abstraction. A creature built with deterministic physics can still have free will.    But saying that determinism is the definition of free will is kinda bs; that&#x27;s too strong in the other direction. A deterministic creature does NOT have free will and that doesn&#x27;t have to do with underlying rules of physics or math. The pocket calculator example is not satisfactory to me because the process of the calculator *has no choice* in its output and thus has no free will; it is simply executing a process, and there is more to free will than that. The pocket calculator is exactly under the power of whatever is producing the inputs; whether that is a rational entity or random background noise of the universe does not change that the calculator is not making decisions and has no choices it can make. There is no intrinsic difference between being constrained by a sentient force and being constrained by the rules of the game that means one scenario==free will and the other scenario==under  someone&#x27;s control; the difference is only a matter of degree.    If the point is that it&#x27;s not the hardware but it&#x27;s the information process, that&#x27;s kinda baloney because the information process as he is using it in this essay has no control over itself. It is only the input string, the transformation,  and the output string, and if those are deterministical ly set, there is no choice happening there and thus no free will. The math underlying a process doesn&#x27;t have free will either, it only exists. Whether the rules were set by somebody or the rules were set by universal constants shaking out during the big bang, if at that level of abstraction one&#x27;s existence is deterministic then there can be no free will. Existing is not choice, and the simulation examples he gives only satisfy existence.    Also, to me, he is making the false dichotomy that you either have totally deterministic processes underlying the philosophical self or you have garbage/ nonfunctioning stuff. This is not so. There are NON-determinist ic processes that still follow rules.     ...Plus, physics isn&#x27;t deterministic at the quantum level. A lot of things aren&#x27;t deterministic at all! In biochemistry, hitting the activation energy doesn&#x27;t turn all substances on the left to all substances on the right, there&#x27;s a probabilistic curve for how much gets turned into what. And there have been experiments showing quantum tunneling producing macroscopic effects on chemistry.",
  "date": "2013-09-22 00:00:00",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10152482573903912#10152482629663912",
  "source_obj": {
    "id": "10152482629663912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&refid=52&_ft_=mf_story_key.10152482573903912%3Atop_level_post_id.10152482573903912%3Atl_objid.10152482573903912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10152482573903912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "It's mostly cool in terms of the approach, but I have to disagree with the \"Determinism is the very definition of free will.\"    This is not a satisfactory use of the word determinism to me. Nothing shows the meaning of determinism more clearly than deterministic automata... If you're at the point where the output is perfectly predictable by the input string, there is no free will because that process could produce nothing but that output. No choice is possible if the outcomes are set; the process itself cannot choose, based on one input to produce a different output other than what it was designed to do--the process has no control over its own output.    Perhaps it would be better expressed as: determinism at one level of abstraction does not preclude free will at a different level of abstraction. A creature built with deterministic physics can still have free will.    But saying that determinism is the definition of free will is kinda bs; that's too strong in the other direction. A deterministic creature does NOT have free will and that doesn't have to do with underlying rules of physics or math. The pocket calculator example is not satisfactory to me because the process of the calculator *has no choice* in its output and thus has no free will; it is simply executing a process, and there is more to free will than that. The pocket calculator is exactly under the power of whatever is producing the inputs; whether that is a rational entity or random background noise of the universe does not change that the calculator is not making decisions and has no choices it can make. There is no intrinsic difference between being constrained by a sentient force and being constrained by the rules of the game that means one scenario==free will and the other scenario==under  someone's control; the difference is only a matter of degree.    If the point is that it's not the hardware but it's the information process, that's kinda baloney because the information process as he is using it in this essay has no control over itself. It is only the input string, the transformation,  and the output string, and if those are deterministical ly set, there is no choice happening there and thus no free will. The math underlying a process doesn't have free will either, it only exists. Whether the rules were set by somebody or the rules were set by universal constants shaking out during the big bang, if at that level of abstraction one's existence is deterministic then there can be no free will. Existing is not choice, and the simulation examples he gives only satisfy existence.    Also, to me, he is making the false dichotomy that you either have totally deterministic processes underlying the philosophical self or you have garbage/ nonfunctioning stuff. This is not so. There are NON-determinist ic processes that still follow rules.     ...Plus, physics isn't deterministic at the quantum level. A lot of things aren't deterministic at all! In biochemistry, hitting the activation energy doesn't turn all substances on the left to all substances on the right, there's a probabilistic curve for how much gets turned into what. And there have been experiments showing quantum tunneling producing macroscopic effects on chemistry.",
    "attachments": [],
    "date": "Sep 22, 2013"
  }
}