{
  "id": "e16bd27a-9b04-48c9-aa84-49193f1af225",
  "name": "Richard Leo Blanco",
  "url": "https://www.facebook.com/richardleo.blanco",
  "text": "In short, maybe he&#x27;s the president the electorate deserves. Which is why I&#x27;ve been telling people that we need to focus on educating the average majority instead of the intellectually gifted minority. Kasi pag di natin naiangat yung basic standard, lagi na lang tayo ganito. Mahirap na din talunin ang cognitive dissonance ng matagal nang committed. Plus there&#x27;s the cultural groundswell that you can really feel here in the south - people desperate for a Visayan president and willing to close their eyes to almost anything.",
  "date": "2016-04-29 00:00:15",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154565485648912#10154565535413912",
  "source_obj": {
    "id": "10154565535413912",
    "poster": "Richard Leo Blanco",
    "poster_url": "/richardleo.blanco?refid=52&_ft_=mf_story_key.10154565485648912%3Atop_level_post_id.10154565485648912%3Atl_objid.10154565485648912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10154565485648912%3Aphoto_id.10154565483718912%3Astory_location.4%3Astory_attachment_style.photo%3Athid.632418911&__tn__=R",
    "text": "In short, maybe he's the president the electorate deserves. Which is why I've been telling people that we need to focus on educating the average majority instead of the intellectually gifted minority. Kasi pag di natin naiangat yung basic standard, lagi na lang tayo ganito. Mahirap na din talunin ang cognitive dissonance ng matagal nang committed. Plus there's the cultural groundswell that you can really feel here in the south - people desperate for a Visayan president and willing to close their eyes to almost anything.",
    "attachments": [],
    "date": "Apr 29, 2016",
    "replies": [
      {
        "id": "10154565540678912",
        "poster": "Joy Reyes-Madamba",
        "poster_url": "/joyapreyes?__tn__=R",
        "text": "But Roxas is from Visayas. Sorry just had to say that.  😬  True, the main thing to do is still education or we will always face this same problem every election time. Hirap ipilit ang ibang paraan ng pag-iisip in just a short amount of time.  😞",
        "attachments": [],
        "date": "Apr 29, 2016",
        "replyto": "10154565535413912"
      },
      {
        "id": "10154565546913912",
        "poster": "Richard Leo Blanco",
        "poster_url": "/richardleo.blanco?__tn__=R",
        "text": "Yes he is. And so is Miriam, if it comes down to that. But both have spent most of their time away, so it's Duterte the people here feel can really represent them. Ewan. I'm hoping that if he does win, at least some influential supporters will keep him in check.",
        "attachments": [],
        "date": "Apr 29, 2016",
        "replyto": "10154565535413912"
      },
      {
        "id": "10154565547878912",
        "poster": "Richard Leo Blanco",
        "poster_url": "/richardleo.blanco?__tn__=R",
        "text": "Otherwise, I'll be eating a lot of popcorn over the next 6 years.",
        "attachments": [],
        "date": "Apr 29, 2016",
        "replyto": "10154565535413912"
      },
      {
        "id": "10154565548323912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Hindi mananalo si Alan, walang magsasabi sa kanya na \"Mayor masama yan\"",
        "attachments": [],
        "date": "Apr 29, 2016",
        "replyto": "10154565535413912"
      }
    ]
  }
}