{
  "id": "f429fe8c-2b6d-432b-97c9-c8debaf65bbf",
  "name": "Roy Tang",
  "url": "https://www.facebook.com/stephen.roy.tang",
  "text": "Both sides can (and did) cite technicalities all they want; I don&#x27;t think the constitution requires the congressmen to have read the impeachment complaint, only to have it &quot;verified&quot;. (The term &quot;verify&quot; isn&#x27;t defined - well, I dunno if it&#x27;s there in the House rules, again IANAL). The law says foreign currencies are secret, but it also says assets have to be declared, how does one judge which one takes precedence? One must look at the intent/spirit of the law, and from there can you deduce which one is of higher importance: the privacy of citizens or transparency in government? The very existence of the SALN law indicates an inclination towards the latter.     You know I agree as much as you do on the how important it is to follow the law, and you of all people should be wary of people citing technicalities to circumvent the intention of the law or justice or whatever. You are correct that we can&#x27;t decide what &quot;the spirit of the law&quot; means, but in the case of impeachment, there is already a body provided by the law to decide - the senate sitting as impeachment court.     Populism and mob rule, these are evils that exist not just in our country, and that is still a big improvement that we have to make, but in the case of impeachment, it is literally a channel for populism (read: politics) to intervene when congress feels that the agents of the law have failed the people (which is why it is only a quasilegal process and not a criminal proceeding)    It&#x27;s weird to rail against populism and mob mentality after saying that &quot;technicalities  are the law&quot; - that&#x27;s precisely one of the reasons why it&#x27;s so hard for the masses to be accepting of the rule of law when they see the rich and powerful bending the law to their whims using technicalities.  (Yes, that includes witch hunts orchestrated by the ruling party.)    Our laws aren&#x27;t perfect - not by a long shot. But the existence of this trial, the fact that the CJ submitted to its&#x27; jurisdiction and his acceptance of the verdict goes a long way towards redeeming the law in the eys of many. Hiding behind technicalities and dramatic escapes from testimony and making appeals to sympathy on the witness stand do not.",
  "date": "2012-05-29 00:00:01",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10151633988403912#10151634115778912"
}