{
  "id": "e170a5c7-6ea1-45ba-9130-09002a196141",
  "name": "Jaime L. Garcia",
  "url": "https://www.facebook.com/jaime.l.garcia.779",
  "text": "TL;DR List assumes you can magically detect what is trustworthy news or not. I insist that you can&#x27;t because even if news orgs are honorable (and they&#x27;re not all the time), personal bias / spin cannot be 100% removed, in the best of cases. To add to this list, I suggest looking at multiple sources of info and comparing and contrasting information to get a better view. This method is not foolproof, but gives you a level of information reliability by showing you as many sides of the argument as you can. Trust no one.    -----    How does one even go about the process of fact-checking, without resorting to another &quot;trusted&quot; source as a basis?    We&#x27;ve seen so-called reputable news sites (read: local broadsheets and internet news sites) have screwed up on being neutral (their information slants *selectively*, based on writer / editor political leanings), spinning items in one direction.    They&#x27;re not above using clickbait-style  tactics either. Even if their news is factually correct, it might not be the ONLY thing happening, or they might not be showing you the complete story.    I think the list you provide needs a way to distinguish what&#x27;s accurate news from what&#x27;s fake. All the action points already assume you know what is what.    To this, I&#x27;ll add. Never trust a single news source. Always compare data from two to three sources, at least. Try to get opposing views, preferably with one source for, one source against, and one source neutral, and THEN, exercise your own judgment.    This won&#x27;t solve all the trust issues with media / facebook shares, but at least you can be armed with as best a holistic view, short of doing your personal information investigation yourself.",
  "date": "2016-12-10 00:00:02",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155164502313912#10155165538913912",
  "source_obj": {
    "id": "10155165538913912",
    "poster": "Jaime L. Garcia",
    "poster_url": "/jaime.l.garcia.779?refid=52&_ft_=mf_story_key.10155164502313912%3Atop_level_post_id.10155164502313912%3Atl_objid.10155164502313912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155164502313912%3Aphoto_id.10155164501823912%3Astory_location.4%3Astory_attachment_style.photo%3Athid.632418911&__tn__=R",
    "text": "TL;DR List assumes you can magically detect what is trustworthy news or not. I insist that you can't because even if news orgs are honorable (and they're not all the time), personal bias / spin cannot be 100% removed, in the best of cases. To add to this list, I suggest looking at multiple sources of info and comparing and contrasting information to get a better view. This method is not foolproof, but gives you a level of information reliability by showing you as many sides of the argument as you can. Trust no one.    -----    How does one even go about the process of fact-checking, without resorting to another \"trusted\" source as a basis?    We've seen so-called reputable news sites (read: local broadsheets and internet news sites) have screwed up on being neutral (their information slants *selectively*, based on writer / editor political leanings), spinning items in one direction.    They're not above using clickbait-style  tactics either. Even if their news is factually correct, it might not be the ONLY thing happening, or they might not be showing you the complete story.    I think the list you provide needs a way to distinguish what's accurate news from what's fake. All the action points already assume you know what is what.    To this, I'll add. Never trust a single news source. Always compare data from two to three sources, at least. Try to get opposing views, preferably with one source for, one source against, and one source neutral, and THEN, exercise your own judgment.    This won't solve all the trust issues with media / facebook shares, but at least you can be armed with as best a holistic view, short of doing your personal information investigation yourself.",
    "attachments": [],
    "date": "Dec 10, 2016"
  }
}