{
  "id": "f311cbbb-a65b-4abd-b635-e30ef14822c1",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "If I remember my consti law, at first FM just wanted to die here. But during the pendency of the case, he passed away. His dying wish was to be buried next to his mother. But yun nga, Pres Cory disallowed it, hence the Marcos v Manglapus cases.<br/>Those cases, those were not unanimous decisions. Even the SC was divided, with some justices, such as Isagani Cruz, taking the same position as those who are not fighting for FM's burial in LNB, but do not openly oppose it. And to think he was anti-Marcos. In the first case, he said:<br/>I\"t is my belief that the petitioner, as a citizen of the Philippines, is entitled to return to and live — and die — in his own country. I say this with a heavy heart but say it nonetheless. That conviction is not diminished one whit simply because many believe Marcos to be beneath contempt and undeserving of the very liberties he flounted when he was the absolute ruler of this land.<br/>XXX<br/>I have no illusion that the stand I am taking will be met with paeans of praise, considering that Marcos is perhaps the most detested man in the entire history of our country. But we are not concerned here with popularity and personalities. As a judge, I am not swayed by what Justice Cardozo called the \"hooting throng\" that may make us see things through the prisms of prejudice. I bear in mind that when I sit in judgment as a member of this Court, I must cast all personal feelings aside.<br/>XXX<br/>I cannot turn back on the lessons of liberty that I taught for more than three decades as a professor of Constitutional Law. These principles have not changed simply because I am now on the Court or a new administration is in power and the shoe is on the other foot.<br/>Like the martyred Ninoy Aquino who also wanted to come back to the Philippines against the prohibitions of the government then, Marcos is entitled to the same right to travel and the liberty of abode that his adversary invoked. These rights are guaranteed by the Constitution to all individuals, including the patriot and the homesick and the prodigal son returning, and tyrants and charlatans and scoundrels of every stripe.\"<br/>and in the second:<br/>\"Nothing important has happened to change my vote for granting the petition. The death of Marcos has not plunged the nation into paroxysms of grief as the so-called \"loyalists\" had hoped. By and large, it has been met with only passing interest if not outright indifference from the people. Clearly, the discredited dictator is in death no El Cid. Marcos dead is only an unpleasant memory, not a bolt of lightning to whip the blood.<br/>This only shows that if he was at all a threat to the national security when he was already moribund that feeble threat has died with him. As the government stresses, he has been reduced to a non-person (which makes me wonder why it is still afraid of him). His cadaver is not even regarded as a symbol of this or that or whatever except by his fanatical followers. It is only a dead body waiting to be interred in this country.<br/>This is a tempest in a teapot. We have more important things to do than debating over a corpse that deserves no kinder fate than dissolution and oblivion. I say let it be brought home and buried deep and let us be done with it forever.\"<br/>These cases took place in 1989, back when coup d etats were the norm. I guess eventually, the instability of the country was fixed, such that there was no longer a valid reason to deny FM's constitutional right to travel home.<br/>Of course, now, almost 30 years later, we have another divide on a Marcos issue. Namely, who should move on, the anti-Marcos, or the loyalist?<br/>(PS: sorry for the long reply but Isagani Cruz is my favorite ponente)",
  "date": "2016-08-11 16:56:00 +0800",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154812916033912#7",
  "source": "facebook",
  "spam": false,
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10154812916033912#5"
}