{
  "id": "3ab174e6-d38a-4bfd-8112-8da5db77f2e7",
  "name": "hungryroy",
  "url": "https://www.reddit.com/u/hungryroy",
  "text": "> All good answers in other comments, but this is the best so far. Do you have any complicated knowledge regarding: \"For any stock, there is a current market value, which is (simplified) the price of the stock for the last transaction it was sold.\"\n\nWell TBH, that's pretty much it. The difference is just in semantics. The last price of the stock for any transaction isn't the market value per se. The market value is \"what people are willing to pay for the stock\". Usually financial analysts will have some general idea of the \"expected value\" of the stock, based on things like the company's profits, historical performance, how quickly it's growing, market sentiment, recent events, etc. Different analysts will use different formulas so there is no one true expected value, but typically they will fall in a small range. It's part math/economics and part crowd psychology. \n\n> If I were to sell 1 of my stocks (worth $100) for $1 then clearly the market price would not go from 100 to 1. Is there an actual equation? Is the price changed by a certain X factor or weight applied to the number of stocks sold at that price?\n\nFor this example, if other people valued the stock at $100 but you sold at $1, some very lucky person would likely buy your shares at $1 each, then immediately turn around and sell them at a bit less than $100 for a pretty good profit. Stock trades happen quickly, so most people wouldn't even notice (although it would register as the \"low\" for that stock on that day)\n\nTo give you a better idea, here's a screenshot of the details for a stock from an online broker I use for trading. (I only trade as a side hobby, in small amounts). This is on our local stock exchange (I'm not an American), but most stock exchanges should behave around the same way.\n\nhttp://imgur.com/a/oByct\n\nOn the upper right on the screenshot, you can see the value for \"Previous\", this is how much the stock sold during the most recent transaction. \"Last\" is how much the stock sold for the transaction right before \"Previous\". There's also values for \"Open\" (the sell price for the first transaction of the day), \"High\", \"Low\", etc.\n\nIn the middle there's two columns: Bid and Ask. \"Bid\" lists out the recent posts by people wanting to buy the stock, the highest bids are listed first. \"Ask\" lists the recent posts by people wanting to sell, the lowest price is listed first. As you can see, there's a slight gap between the highest bid and the lowest asking price - no trade will happen until someone either makes a higher bid or posts a lower asking price. Once a bid finds a matching asking price, the transaction happens automatically.\n\nThe software that runs stock exchanges isn't super complicated, since it's basically just comparing the high bids to the low asking price and executing any resulting transactions. But they do have to be really, really fast, since the posts come very frequently. The software is run by the stock exchanges themselves. The screenshot above is from the webapp by my local online broker, they're the ones that connect to the stock exchange servers to post bids and asking prices.\n\nThe NYSE is the largest such exchange in the world, in terms of the dollar amount of trades that happen on any given day. There's many stock exchanges all over the world. The NYSE isn't even the only one in the US, there's the NASDAQ, and I think there's also a bunch of smaller ones. Here's a list of the top exchanges in the world: https://en.wikipedia.org/wiki/List_of_stock_exchanges\n\n",
  "date": "2017-05-28 16:42:04",
  "photo": null,
  "source_url": "https://www.reddit.com/r/explainlikeimfive/comments/6c9plk/eli5_stock_prices_constantly_changing/di5hors/",
  "source": "reddit",
  "reply_to": "https://www.reddit.com/r/explainlikeimfive/comments/6c9plk/eli5_stock_prices_constantly_changing/di5gdvu/"
}