{
  "id": "136de17b-c61f-4122-a361-38d81f8dc799",
  "name": "Tracy Durnell",
  "url": "https://tracydurnell.com",
  "text": "Mentioned by https://tracydurnell.com/2023/11/30/building-community-out-of-strangers/\n\n> me think a bit of David Cain’s “secret ally” practice.)As Roy Tang puts it: I write in public because we as humans",
  "date": "2023-12-01 03:31:50 +0800",
  "photo": "https://webmention.io/avatar/secure.gravatar.com/166bfa79afa93d034d4fe38d5b399838c290891e3144a650d46f1a7e5acd6532.jpg",
  "source_url": "https://tracydurnell.com/2023/11/30/building-community-out-of-strangers/",
  "source": "webmention",
  "spam": false,
  "source_obj": {
    "type": "entry",
    "author": {
      "type": "card",
      "name": "Tracy Durnell",
      "photo": "https://webmention.io/avatar/secure.gravatar.com/166bfa79afa93d034d4fe38d5b399838c290891e3144a650d46f1a7e5acd6532.jpg",
      "url": "https://tracydurnell.com"
    },
    "url": "https://tracydurnell.com/2023/11/30/building-community-out-of-strangers/",
    "published": "2023-11-30T19:31:50-08:00",
    "wm-received": "2023-12-01T03:32:23Z",
    "wm-id": 1747312,
    "wm-source": "https://tracydurnell.com/2023/11/30/building-community-out-of-strangers/",
    "wm-target": "https://roytang.net/2020/02/thinking-in-public/",
    "wm-protocol": "webmention",
    "name": "Building community out of strangers",
    "syndication": [
      "https://news.indieweb.org/en"
    ],
    "content": {
      "html": "<p>Last week, I updated <a href=\"https://tracydurnell.com/blogroll/\">my blogroll</a> to include everyone in my RSS feed reader. While I read a lot of topical blogs and newsletters, I also follow a goodly number of interesting people I don’t know as well as acquaintances. I didn’t include these personal blogs on my blogroll before, but decided it was time to add them.</p>\n(My impetus for updating it was Frank Meeuwsen’s <a href=\"https://frankmeeuwsen.com/2023/11/13/show-me-your.html\">call for folks to share their blogrolls</a> — I started this as a reply, but I’m past 2000 words so…)<p>After starting the process of <a href=\"https://tracydurnell.com/2023/07/11/pulling-my-site-from-google-over-ai-training/\">pulling my website off of Google</a>, I declared myself all-in on people; <a href=\"https://tracydurnell.com/2022/10/28/expanding-the-blogroll/\">expanding my blogroll</a> is part of that process. I used to think of blogrolls as for people I knew IRL, but I’ve come around on it. Hence, my blogroll is full of “Internet strangers.” (It’s still not representative of everyone I follow since I follow a lot of people through micro.blog instead of RSS, but one step at a time.)</p>\n<p><em>This post is my contribution to the November 2023 <a href=\"https://indieweb.org/indieweb-carnival\">IndieWeb Blog Carnival</a>, organized by <a href=\"https://alexsirac.com/indieweb-carnival-community-and-belonging/\">Alex Sirac on the theme of community and belonging</a>.</em></p>\n<h2>Changing the focus of my follows</h2>\n<p>Over the years, I’ve shifted my news consumption away from publications and towards referrals from real people, but it’s not just my sources of news that have shifted: <strong>I am trying to give more of my <em>attention</em> to people, not events.</strong> To the things that matter in people’s daily lives. I want less of my energy and attention going to “newsworthy” events far removed from my sphere of influence and more to living non-reactively. Instead of <em>gathering </em><em>information</em>, I’ve changed my selection criteria for which feeds to follow towards <em>connection and sociability</em>.</p>\n<p>When I’m not overwhelmed with the <a href=\"https://tracydurnell.com/2022/07/26/the-news-is-a-drag/\">emotional onslaught of international and national news</a> presented in ways designed to make us fearful or enraged, it’s easier to hear the everyday concerns of people and see the patterns of life. <strong>Personal websites represent a return to human scale.</strong></p>\n<p><span></span></p>\n<h3>How I decide who to follow</h3>\n<p>I follow folks more liberally than I used to on social media, where I felt weird following people who weren’t “creators” of some type. Individually, <a href=\"https://snarfed.org/2023-10-25_following-the-not-so-online\">most people don’t publish that frequently on their personal websites</a>, so I have room in my feed reader for lots of people.</p>\n(Sorry people who follow me for the three posts a day ????)<p>When I’m referred to another person’s personal website, if I appreciate the first thing I read there, I’ll poke around to get a feel for what they write about. I look at recent post titles, their about page, the books they’ve read lately, and see if anything catches my eye or we have any overlapping interests. People are interesting, especially when they’re <a href=\"https://tracydurnell.com/2023/01/18/blogs-are-a-platform-for-normal-people/\">talking about the things they care about</a>! I particularly enjoy following people from different parts of the world. I loosely aim for gender parity in the feeds I follow, but <a href=\"https://tracydurnell.com/2023/03/09/diversifying-my-blogroll/\">it can be tricky to stick to</a>. (I include newsletters in my count, which makes the balance much better.)</p>\n<h2>Why I like following personal blogs</h2>\n<p>Personal blogs are the perfect distillation of all the siloed online publishing channels: the everyday themes and highlights of Instagram coupled with the commentary of Twitter [stet] and book reviews of Goodreads, at a leisurely pace with no character limit, hyperlinks and unlimited photos.</p>\n<p><em>Yes, I want to see what you ate for lunch. </em></p>\n<p><em>Yes, I want your snarky take on this week’s tech culture kerfuffle. </em></p>\n<p><em>Yes, I want to hear the song you’ve had stuck in your head all week. </em></p>\n<p>I like hearing about the trials and triumphs of other normal people’s lives, seeing what goals they pursue and what they care about enough to write about. I gather book recommendations from others’ reviews, sample others’ taste in music, and delight in the daily wonders of others’ worlds: the cat luxuriating in a strip of sunshine, the stream in the dappled light of an open forest, the neat-looking conjunction of lines on the wall they passed on their morning walk. While social media emphasizes the show-off stuff — the vacation in Puerto Vallarta, the full kitchen remodel, the night out on the town — on blogs it still seems that people are <em>sharing</em> more than <em>signalling</em>. These small pleasures seem to be offered in a spirit of generosity — <em>this is too beautiful not to share</em>.</p>\n<p>Much talk about social media has centered on authenticity, when we all recognize that <a href=\"https://tracydurnell.com/2023/08/27/performing-yourself-on-social-media/\">social media is performative</a>. <strong>Personal blogs are where the authenticity’s at.</strong> Being self-motivated, bloggers can write about their full range of interests, an openness that’s <a href=\"https://tracydurnell.com/2023/08/28/people-you-know-from-offline-dont-read-your-blog/\">hard to replicate in offline interactions</a>. (Reading a good blog post and responding to it is kind of like having an awesome conversation with a stranger without having to hurdle the social niceties first.) As an open and self-contained platform, blogs escape many, if not all the context collapse issues of social media. <a href=\"https://tracydurnell.com/2023/01/15/understanding-blogs/\">Blogging’s affordances</a> enable a greater range of self-expression and support self-publishing more mediums than do social media.</p>\n<h2>Hardly strangers</h2>\n<p>Although I may never interact with all the folks whose blogs I follow, reading the same blogger for a long time does build a (one-sided) connection. <em>I may not know you, author, but I am rooting for you. </em>It’s a different modality of relationship than we may be used to in person, but it’s real: a parasocial relationship simmering with the potential for deeper connection, but also satisfying as it exists.</p>\n(This makes me think a bit of <a href=\"https://www.raptitude.com/2014/09/how-to-be-a-good-stranger/\">David Cain’s “secret ally” practice</a>.)<p>As <a href=\"https://roytang.net/2020/02/thinking-in-public/\">Roy Tang</a> puts it:</p>\n<blockquote><p>I write in public because we as humans have so much in common, even if we aren’t aware of it.</p></blockquote>\n<p>And then, some folks I <em>do</em> interact with! I try to follow back people who comment on my site, which makes it more likely that I’ll respond or link to something of theirs in the future. <a href=\"https://sarajaksa.eu/2023/07/the-first-stab-at-the-indieweb-interaction-social-norms/\">Sara Jakša</a> and I <a href=\"https://tracydurnell.com/2023/07/12/barriers-to-a-more-social-indieweb/\">traded</a> <a href=\"https://tracydurnell.com/2023/06/28/compromising-information/\">blog posts</a> back and forth in an extended written discussion. When others in the IndieWeb respond to articles I wrote on their own sites, thanks to <a href=\"https://indieweb.org/Webmention\">Webmentions</a>, I get to hear about it, even if it’s someone who I don’t follow yet ????</p>\n(It makes me think of scientists and writers and so forth exchanging letters back in the day, knowing they might never meet in person. This type of relationship isn’t so new after all.)<p>So <em>strangers</em> is a bit of a misnomer.</p>\n<h2>Connection breeds connection</h2>\n<p>To me, today’s independent web feels lively; there are more people writing on their personal websites than I could ever follow. All year I’ve been <a href=\"https://tracydurnell.com/2023/09/23/my-20th-anniversary-of-blogging/\">feeling the blogging buzz build</a>. <a href=\"https://defaults.rknight.me/\">More than 200 bloggers</a> have participated in <a href=\"https://tracydurnell.com/2023/11/28/my-current-default-apps/\">a recent blogging meme</a>.* Things are <em>happening</em> in Blogland.</p>\n*(And I saw <a href=\"https://alexsirac.com/my-default-apps-in-2023/\">Alex</a> did it after me! Network effects ????)<p>Danah Boyd points out that the success of a social platform <a href=\"https://zephoria.medium.com/dear-alt-twitter-designers-its-about-the-network-3d6f7e8714dd\">is all about the network</a>:</p>\n<blockquote><p>But the graph of connections was not the only relevant graph. The other critical graph was the graph of norms. Founders were, unsurprisingly, hyper enthusiastic about the thing they created. They posted a lot of content — and they encouraged the people they invited to do the same. So there was an enthusiasm from the getgo. And as new people came on, they got creative, they pushed at the norms, they expanded their networks. Divergent norms sat alongside one another. Geek Friendster was different than queer Friendster. The kernel of all of this was vibrancy. These dense norm-infused networks felt vibrant to those who were a part of them.</p></blockquote>\n<p>The network is vital for blogging, too. Social media is fading as it shifts more and more towards <a href=\"https://www.garbageday.email/p/selling-your-filter-bubble-back-to\">the few who post and the many who follow</a>; <strong>But the more effort I make to link out to others on my blog, the more I feel included as a part of the online community.</strong></p>\n<p>I used to be jealous of people who had “Internet friends.” I assumed the only way to meet people online was on LJ or forums, and I was into blogs. On my old website, I wrote a lot of contemplative essays that didn’t link out much; what I write now is more conducive to linking. To conversation. Since I started participating in the IndieWeb and using IndieWeb tools for cross-site communication, I’ve met all manner of people. And the more “whole” people (<a href=\"https://bix.blog/2023/Jun/15/normalize-being-whole-persons/\">as Bix puts it</a>) I read, the more I’m likely to interact with in some way (linking or commenting). Linking generously (<a href=\"https://flamedfury.com/posts/the-art-of-hyperlinking/\">and purposefully</a>) is the blogger version of being friendly.</p>\n<p><a href=\"https://werd.io/2023/long-term-blogging\">Ben Werdmuller</a> succinctly expresses how valuable blogs are for participating in online community:</p>\n<blockquote><p>Blogging might seem like a solitary activity, but it’s very, very social. Even the name — a pun derived from <em>weblog = we blog</em> — is about community.</p></blockquote>\n<p>There are people on the other side of my blog; and I am one of those people on the other side of other people’s blogs ????</p>\n<p>Even when the conversation isn’t direct, <strong>blogging is community the way neighborhoods are</strong> — you don’t know everyone who lives nearby, everyone’s got a slightly different set of connections, but living in the same environment where common concerns might arise and sharing just some of these cross connections to hear rumblings through the grapevine means ideas and vibes will diffuse through. I might not follow someone’s feed, but get referred to their writing regularly nonetheless through others who do.</p>\n<p>I like the way Bix Frankonis <a href=\"https://bix.blog/2023/Sep/23/being-a-real-human/\">describes the emergent connections between bloggers</a>:</p>\n<blockquote><p>All of these things are interconnected, even if barely any part of it is in direct response to any other part of it. Even when not talking about blogging, specifically, all of these people are talking about the same things.</p>\n<p>In a very real way, even if none of them ever see the others’ posts, they’re also talking to each other.</p></blockquote>\n<p>Publishing the words is only one side of the equation; the readers and the connections they make between the bloggers they read, each reader with a distinct network, is also key to a rich blogging community.</p>\n<p>Colin Walker <a href=\"https://colinwalker.blog/blog/?date=2023-09-25#p1\">sums up nicely the way we think together through our blogs</a>:</p>\n<blockquote><p>Yet, putting words out there (whether or not anyone reads them) is, indeed, talking to other bloggers — whether or not we know they exist. Those words combine into a <em>collective blogging unconscious</em> waiting for someone to unravel the threads and weave the web.</p></blockquote>\n<h2>Making a fleet of many blogs</h2>\n<p>At its heart, blogging seems practically made to be a social text: its hypertext functionality enables linking to referenced works that authors in other mediums are reduced to citing. This interactivity invites a conversation between reader and text. However, bloggers’ individual design and architecture choices influence whether our website is set up as more of a curio shop — <em>look but don’t touch</em> — or a rowdy pub — <em>the gang’s all here!</em> In charge of our own publishing platforms, we choose what connective technologies to implement (e.g. do we want to federate?) and how to moderate comments. We get to decide how much interaction, and in what form, we are comfortable with through and displayed on our websites. Everything that goes into place-making online.</p>\n<p>Matt Webb points out that the <a href=\"https://interconnected.org/home/2021/09/22/togetherness\">Internet creates spaces</a> in a way other media doesn’t:</p>\n<blockquote><p>There’s no necessary reason why human presence transmits through electricity and silicon. Books carry thought and stories and they are incredible in their own way, and we give the written word its deserved credit. Radio broadcasts feel live but in only one direction.</p>\n<p>The internet creates new architectures that the brain feels as space yet don’t exist.</p></blockquote>\n<p>And as creators — and controllers — of these interconnected spaces, bloggers have a lot of influence over the social norms of the medium. What we decide to blog about and how we do so helps shape the social norms of blogging culture in the 2020s.</p>\n<p>We’ve seen during <a href=\"https://en.wikipedia.org/wiki/Eternal_September\">other moments of transition online</a> that community norms can change with a lot of new folks joining quickly, but I suspect blogging’s adoption and connection rate is slow enough to not collapse under this. Instead, I see today’s social transition phase, where people are casting about for “where to be online,” as a critical moment in the blogging world to invite and welcome new bloggers — as well as model the social norms we want to see people follow on their blogs.</p>\n<h2>Cue: the return of the blogroll</h2>\n<p>A decision frame I’m trying to follow for my website is prioritizing what will bolster a connected Internet community — another form of <a href=\"https://tracydurnell.com/2023/11/21/taking-opportunities-to-connect/\">always taking opportunities for connection</a>. Pointing to other folks’ personal websites on my blogroll supports that end.</p>\n<p>Blogrolls used to be a social norm in the blogging community, but are less common today. <a href=\"https://smithery.com/2023/11/06/talking-about-blogrolls-and-web-marginalia/\">John Willshire</a> points out that one contributing factor might be shifts in design practices — towards responsive design and a “cleaner” aesthetic that both discouraged sidebars, where blogrolls once dwelt. I would guess that another contributor of the dwindling blogroll was how many people quit blogging. A blogroll full of dead sites is a sad thing.</p>\n<p>But we can restore — and even reinvent — the blogroll, recognizing the value it provides in helping build a connected internet and world of blogs: the function they can serve in connecting <em>people</em>.</p>\n<p> </p>\n<p><a class=\"u-syndication\" href=\"https://news.indieweb.org/en\">Syndicated to IndieNews</a></p>",
      "text": "Last week, I updated my blogroll to include everyone in my RSS feed reader. While I read a lot of topical blogs and newsletters, I also follow a goodly number of interesting people I don’t know as well as acquaintances. I didn’t include these personal blogs on my blogroll before, but decided it was time to add them.\n(My impetus for updating it was Frank Meeuwsen’s call for folks to share their blogrolls — I started this as a reply, but I’m past 2000 words so…)After starting the process of pulling my website off of Google, I declared myself all-in on people; expanding my blogroll is part of that process. I used to think of blogrolls as for people I knew IRL, but I’ve come around on it. Hence, my blogroll is full of “Internet strangers.” (It’s still not representative of everyone I follow since I follow a lot of people through micro.blog instead of RSS, but one step at a time.)\nThis post is my contribution to the November 2023 IndieWeb Blog Carnival, organized by Alex Sirac on the theme of community and belonging.\nChanging the focus of my follows\nOver the years, I’ve shifted my news consumption away from publications and towards referrals from real people, but it’s not just my sources of news that have shifted: I am trying to give more of my attention to people, not events. To the things that matter in people’s daily lives. I want less of my energy and attention going to “newsworthy” events far removed from my sphere of influence and more to living non-reactively. Instead of gathering information, I’ve changed my selection criteria for which feeds to follow towards connection and sociability.\nWhen I’m not overwhelmed with the emotional onslaught of international and national news presented in ways designed to make us fearful or enraged, it’s easier to hear the everyday concerns of people and see the patterns of life. Personal websites represent a return to human scale.\n\nHow I decide who to follow\nI follow folks more liberally than I used to on social media, where I felt weird following people who weren’t “creators” of some type. Individually, most people don’t publish that frequently on their personal websites, so I have room in my feed reader for lots of people.\n(Sorry people who follow me for the three posts a day ????)When I’m referred to another person’s personal website, if I appreciate the first thing I read there, I’ll poke around to get a feel for what they write about. I look at recent post titles, their about page, the books they’ve read lately, and see if anything catches my eye or we have any overlapping interests. People are interesting, especially when they’re talking about the things they care about! I particularly enjoy following people from different parts of the world. I loosely aim for gender parity in the feeds I follow, but it can be tricky to stick to. (I include newsletters in my count, which makes the balance much better.)\nWhy I like following personal blogs\nPersonal blogs are the perfect distillation of all the siloed online publishing channels: the everyday themes and highlights of Instagram coupled with the commentary of Twitter [stet] and book reviews of Goodreads, at a leisurely pace with no character limit, hyperlinks and unlimited photos.\nYes, I want to see what you ate for lunch. \nYes, I want your snarky take on this week’s tech culture kerfuffle. \nYes, I want to hear the song you’ve had stuck in your head all week. \nI like hearing about the trials and triumphs of other normal people’s lives, seeing what goals they pursue and what they care about enough to write about. I gather book recommendations from others’ reviews, sample others’ taste in music, and delight in the daily wonders of others’ worlds: the cat luxuriating in a strip of sunshine, the stream in the dappled light of an open forest, the neat-looking conjunction of lines on the wall they passed on their morning walk. While social media emphasizes the show-off stuff — the vacation in Puerto Vallarta, the full kitchen remodel, the night out on the town — on blogs it still seems that people are sharing more than signalling. These small pleasures seem to be offered in a spirit of generosity — this is too beautiful not to share.\nMuch talk about social media has centered on authenticity, when we all recognize that social media is performative. Personal blogs are where the authenticity’s at. Being self-motivated, bloggers can write about their full range of interests, an openness that’s hard to replicate in offline interactions. (Reading a good blog post and responding to it is kind of like having an awesome conversation with a stranger without having to hurdle the social niceties first.) As an open and self-contained platform, blogs escape many, if not all the context collapse issues of social media. Blogging’s affordances enable a greater range of self-expression and support self-publishing more mediums than do social media.\nHardly strangers\nAlthough I may never interact with all the folks whose blogs I follow, reading the same blogger for a long time does build a (one-sided) connection. I may not know you, author, but I am rooting for you. It’s a different modality of relationship than we may be used to in person, but it’s real: a parasocial relationship simmering with the potential for deeper connection, but also satisfying as it exists.\n(This makes me think a bit of David Cain’s “secret ally” practice.)As Roy Tang puts it:\nI write in public because we as humans have so much in common, even if we aren’t aware of it.\nAnd then, some folks I do interact with! I try to follow back people who comment on my site, which makes it more likely that I’ll respond or link to something of theirs in the future. Sara Jakša and I traded blog posts back and forth in an extended written discussion. When others in the IndieWeb respond to articles I wrote on their own sites, thanks to Webmentions, I get to hear about it, even if it’s someone who I don’t follow yet ????\n(It makes me think of scientists and writers and so forth exchanging letters back in the day, knowing they might never meet in person. This type of relationship isn’t so new after all.)So strangers is a bit of a misnomer.\nConnection breeds connection\nTo me, today’s independent web feels lively; there are more people writing on their personal websites than I could ever follow. All year I’ve been feeling the blogging buzz build. More than 200 bloggers have participated in a recent blogging meme.* Things are happening in Blogland.\n*(And I saw Alex did it after me! Network effects ????)Danah Boyd points out that the success of a social platform is all about the network:\nBut the graph of connections was not the only relevant graph. The other critical graph was the graph of norms. Founders were, unsurprisingly, hyper enthusiastic about the thing they created. They posted a lot of content — and they encouraged the people they invited to do the same. So there was an enthusiasm from the getgo. And as new people came on, they got creative, they pushed at the norms, they expanded their networks. Divergent norms sat alongside one another. Geek Friendster was different than queer Friendster. The kernel of all of this was vibrancy. These dense norm-infused networks felt vibrant to those who were a part of them.\nThe network is vital for blogging, too. Social media is fading as it shifts more and more towards the few who post and the many who follow; But the more effort I make to link out to others on my blog, the more I feel included as a part of the online community.\nI used to be jealous of people who had “Internet friends.” I assumed the only way to meet people online was on LJ or forums, and I was into blogs. On my old website, I wrote a lot of contemplative essays that didn’t link out much; what I write now is more conducive to linking. To conversation. Since I started participating in the IndieWeb and using IndieWeb tools for cross-site communication, I’ve met all manner of people. And the more “whole” people (as Bix puts it) I read, the more I’m likely to interact with in some way (linking or commenting). Linking generously (and purposefully) is the blogger version of being friendly.\nBen Werdmuller succinctly expresses how valuable blogs are for participating in online community:\nBlogging might seem like a solitary activity, but it’s very, very social. Even the name — a pun derived from weblog = we blog — is about community.\nThere are people on the other side of my blog; and I am one of those people on the other side of other people’s blogs ????\nEven when the conversation isn’t direct, blogging is community the way neighborhoods are — you don’t know everyone who lives nearby, everyone’s got a slightly different set of connections, but living in the same environment where common concerns might arise and sharing just some of these cross connections to hear rumblings through the grapevine means ideas and vibes will diffuse through. I might not follow someone’s feed, but get referred to their writing regularly nonetheless through others who do.\nI like the way Bix Frankonis describes the emergent connections between bloggers:\nAll of these things are interconnected, even if barely any part of it is in direct response to any other part of it. Even when not talking about blogging, specifically, all of these people are talking about the same things.\nIn a very real way, even if none of them ever see the others’ posts, they’re also talking to each other.\nPublishing the words is only one side of the equation; the readers and the connections they make between the bloggers they read, each reader with a distinct network, is also key to a rich blogging community.\nColin Walker sums up nicely the way we think together through our blogs:\nYet, putting words out there (whether or not anyone reads them) is, indeed, talking to other bloggers — whether or not we know they exist. Those words combine into a collective blogging unconscious waiting for someone to unravel the threads and weave the web.\nMaking a fleet of many blogs\nAt its heart, blogging seems practically made to be a social text: its hypertext functionality enables linking to referenced works that authors in other mediums are reduced to citing. This interactivity invites a conversation between reader and text. However, bloggers’ individual design and architecture choices influence whether our website is set up as more of a curio shop — look but don’t touch — or a rowdy pub — the gang’s all here! In charge of our own publishing platforms, we choose what connective technologies to implement (e.g. do we want to federate?) and how to moderate comments. We get to decide how much interaction, and in what form, we are comfortable with through and displayed on our websites. Everything that goes into place-making online.\nMatt Webb points out that the Internet creates spaces in a way other media doesn’t:\nThere’s no necessary reason why human presence transmits through electricity and silicon. Books carry thought and stories and they are incredible in their own way, and we give the written word its deserved credit. Radio broadcasts feel live but in only one direction.\nThe internet creates new architectures that the brain feels as space yet don’t exist.\nAnd as creators — and controllers — of these interconnected spaces, bloggers have a lot of influence over the social norms of the medium. What we decide to blog about and how we do so helps shape the social norms of blogging culture in the 2020s.\nWe’ve seen during other moments of transition online that community norms can change with a lot of new folks joining quickly, but I suspect blogging’s adoption and connection rate is slow enough to not collapse under this. Instead, I see today’s social transition phase, where people are casting about for “where to be online,” as a critical moment in the blogging world to invite and welcome new bloggers — as well as model the social norms we want to see people follow on their blogs.\nCue: the return of the blogroll\nA decision frame I’m trying to follow for my website is prioritizing what will bolster a connected Internet community — another form of always taking opportunities for connection. Pointing to other folks’ personal websites on my blogroll supports that end.\nBlogrolls used to be a social norm in the blogging community, but are less common today. John Willshire points out that one contributing factor might be shifts in design practices — towards responsive design and a “cleaner” aesthetic that both discouraged sidebars, where blogrolls once dwelt. I would guess that another contributor of the dwindling blogroll was how many people quit blogging. A blogroll full of dead sites is a sad thing.\nBut we can restore — and even reinvent — the blogroll, recognizing the value it provides in helping build a connected internet and world of blogs: the function they can serve in connecting people.\n \nSyndicated to IndieNews"
    },
    "mention-of": "https://roytang.net/2020/02/thinking-in-public/",
    "wm-property": "mention-of",
    "wm-private": false,
    "rels": {
      "canonical": "https://tracydurnell.com/2023/11/30/building-community-out-of-strangers/"
    }
  }
}