{
  "id": "eeac132c-cac4-462b-9ad0-0fa02a9a927a",
  "name": "Nathanael Alim Alviso",
  "url": "https://www.facebook.com/nathanael.alviso",
  "text": "I admire Duterte&#x27;s Machiavellian style of leadership: &quot;The end justifies the means.&quot; What he had accomplished in Davao is unparalleled in other parts of the Philippines. Marcos also do the same but he was corrupted by power. Duterte can also succumb to such temptation and will even ask for more. I also admire other leaders who were able to accomplish the same success using different methods like Richard Gordon&#x27;s Olongapo City or Jesse Robredo&#x27;s Naga City. These three are equally capable of running the country but one is dead and the other has retired from politics yet still active with civic groups and Red Cross. I will vote for Duterte for one reason only, he is the only candidate capable enough and with the guts to create change. As to him abusing power and his death squad being answerable to no one, we have the constitution and rule of law to make sure Duterte gets power for 6 years only and we have the military and the police to hunt down any death squad members who will be unruly after their leader steps down from office. As to him being a womanizer and &quot;palamura&quot;, I would be ashamed of Jose Rizal and Gen. Luna if that is my guideline for not choosing a leader.",
  "date": "2015-12-03 00:00:04",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154226442293912#10154227340078912",
  "source_obj": {
    "id": "10154227340078912",
    "poster": "Nathanael Alim Alviso",
    "poster_url": "/nathanael.alviso?refid=52&_ft_=mf_story_key.10154226442293912%3Atop_level_post_id.10154226442293912%3Atl_objid.10154226442293912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10154226442293912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "I admire Duterte's Machiavellian style of leadership: \"The end justifies the means.\" What he had accomplished in Davao is unparalleled in other parts of the Philippines. Marcos also do the same but he was corrupted by power. Duterte can also succumb to such temptation and will even ask for more. I also admire other leaders who were able to accomplish the same success using different methods like Richard Gordon's Olongapo City or Jesse Robredo's Naga City. These three are equally capable of running the country but one is dead and the other has retired from politics yet still active with civic groups and Red Cross. I will vote for Duterte for one reason only, he is the only candidate capable enough and with the guts to create change. As to him abusing power and his death squad being answerable to no one, we have the constitution and rule of law to make sure Duterte gets power for 6 years only and we have the military and the police to hunt down any death squad members who will be unruly after their leader steps down from office. As to him being a womanizer and \"palamura\", I would be ashamed of Jose Rizal and Gen. Luna if that is my guideline for not choosing a leader.",
    "attachments": [],
    "date": "Dec 3, 2015",
    "replies": [
      {
        "id": "10154227346948912",
        "poster": "Gerard Dacudao",
        "poster_url": "/gerard.dacudao?__tn__=R",
        "text": "Nathanael , indeed, let us not crumble at the end.  The tragedy of Luna is the same old Filipino tendency of organizing, mobilizing, then crumbling at the end.  In my view, Du30 is a rare invention that I dare say will trump Marcos.  How?  In the 20 years of Duterte rule of Davao, he did not steal at all.  And he is now 70 years old.  Marcos was 48 when he got in power.  Du30 is our last hope.  Lets rally for the best shot we have!",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154227340078912"
      },
      {
        "id": "10154227365238912",
        "poster": "Nathanael Alim Alviso",
        "poster_url": "/nathanael.alviso?__tn__=R",
        "text": "My belief is that Duterte must have a vice president to temper his power lust if ever he will be tempted by the devil. My vice president is Leni Robredo because she is a lawyer, so she knows the rule of law, she is a staunch critic of Duterte so she will be a good counter balance. She is modest enough to let her leader Jesse Robredo implement the Tsinelas governance although she have some platform of her own. She was chosen by Mar to be his running mate even though there are hundreds of senior politicians on their party wanting to be vice president because she is the best example of \"Matuwid na Daan\" leadership.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154227340078912"
      },
      {
        "id": "10154227380808912",
        "poster": "Gerard Dacudao",
        "poster_url": "/gerard.dacudao?__tn__=R",
        "text": "I still think its Allan Cayetano.  Why?  If we put an agressive critic in VP position, it will just enrage the pitbull in Du30.  Dapat marunong magmasaje ng message.  If Cayetano family was able to convince Du30 to run, and also do a good job on damage control now, I will bet they can do the same once in malacañang.  To control the temper and rough edges.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154227340078912"
      }
    ]
  }
}