{
  "id": "4da3e174-c286-4d88-ab9a-94ff4bda57af",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "I&#x27;ll say one more thing about why Duterte is the absolute worst choice.    Let&#x27;s suppose we get the best case (unlikely) scenario, that Duterte is genuinely good and uncorruptible and that somehow he will be able to apply his death squad approach to crime across an entire country of 100 million without ever making mistakes about people &quot;caught in the act&quot; (an utterly ridiculous thing that can be made up any time you have one unpopular person and a group willing to be witnesses against him/her). He never abuses this ridiculous power, despite the complete lack of oversight or consequences for mistakes.     [Also, how can you say he is pro-accountabil ity when he himself has no accountability for the people he executes?]    That means there is going to be a new branch of government that exceeds all others in power over life and death, which answers only to the president.    OK. Duterte did good. Then his term is over.    What then? What happens with this secret police? Does it keep on answering only to Duterte even when his term is up? Does it then answer to the next president who starts to use it against inconvenient &quot;political dissidents&quot; or trouble-making unionizers? How many of those Judge Dredd types in his squad stick around and become addicted to this power?     Congrats, you have just broken democracy completely, again, instead of trying to fix what is flawed.    For every Lee Kuan Yew authoritarian who is actually effective and restrained, we get countless inept and cruel warlords and tyrants scattered around the world.",
  "date": "2015-12-03 00:03:32",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154226442293912#10154226903153912",
  "source_obj": {
    "id": "10154226903153912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&__tn__=R",
    "text": "I'll say one more thing about why Duterte is the absolute worst choice.    Let's suppose we get the best case (unlikely) scenario, that Duterte is genuinely good and uncorruptible and that somehow he will be able to apply his death squad approach to crime across an entire country of 100 million without ever making mistakes about people \"caught in the act\" (an utterly ridiculous thing that can be made up any time you have one unpopular person and a group willing to be witnesses against him/her). He never abuses this ridiculous power, despite the complete lack of oversight or consequences for mistakes.     [Also, how can you say he is pro-accountabil ity when he himself has no accountability for the people he executes?]    That means there is going to be a new branch of government that exceeds all others in power over life and death, which answers only to the president.    OK. Duterte did good. Then his term is over.    What then? What happens with this secret police? Does it keep on answering only to Duterte even when his term is up? Does it then answer to the next president who starts to use it against inconvenient \"political dissidents\" or trouble-making unionizers? How many of those Judge Dredd types in his squad stick around and become addicted to this power?     Congrats, you have just broken democracy completely, again, instead of trying to fix what is flawed.    For every Lee Kuan Yew authoritarian who is actually effective and restrained, we get countless inept and cruel warlords and tyrants scattered around the world.",
    "attachments": [],
    "date": "Dec 3, 2015",
    "replyto": "10154226702818912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10154226442293912#10154226702818912"
}