{
  "id": "6d3da238-41a6-46ab-a34d-00096778de97",
  "name": "Gerard Dacudao",
  "url": "https://www.facebook.com/gerard.dacudao",
  "text": "Of the lot, i hate to say it but the only one with the political will to change things is du30.  I know, he sounds like a scary rottweiler who will defend you to death guarding your house. But the others are chiwawas.  Wouldnt you prefer a capable guard dog over a chiwawa?",
  "date": "2015-12-03 00:00:01",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154226442293912#10154226702818912",
  "source_obj": {
    "id": "10154226702818912",
    "poster": "Gerard Dacudao",
    "poster_url": "/gerard.dacudao?refid=52&_ft_=mf_story_key.10154226442293912%3Atop_level_post_id.10154226442293912%3Atl_objid.10154226442293912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10154226442293912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Of the lot, i hate to say it but the only one with the political will to change things is du30.  I know, he sounds like a scary rottweiler who will defend you to death guarding your house. But the others are chiwawas.  Wouldnt you prefer a capable guard dog over a chiwawa?",
    "attachments": [],
    "date": "Dec 3, 2015",
    "replies": [
      {
        "id": "10154226806963912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "I know you like him, and I don't expect to convince you of anything.    To me, he's dangerous, actually the least desirable and most dangerous of the candidates up for election. There's a decent chance he's a mass murderer. Extra-judicial killings, even of alleged criminals, is pretty terrible, and for all that there is outward peace, how many innocent people might be swept up in a country in which the president feels free to use secret police to execute people he feels has broken the law?     I don't care about the things he says and his personal life, but electing Duterte means believing that it's ok for one man to decide, regardless of legal protections, whether it's ok for this person or that person to die. We already had a president like that, and his son is running for VP.    My fellow Filipinos are so strange to me sometimes. Most are anti-abortion (and even anti-contracept ion), but they're ok with casually murdering suspected (not even proven) criminals, and the only reason Duterte is being attacked in the media now is because of inconsequential  things he's said and the things he's done in his personal life.    Incompetence and corruption are things that everyone in the Philippines deals with on a regular basis. All the other candidates will give at worst, more of the same, but Duterte could easily turn this country into a state where things are good for a lot of people, but undesirables (decided upon by only him) are eliminated.     https://www.hrw.org/news/2015/07/17/rodrigo-duterte-rise-philippines-death-squad-mayor",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226814548912",
        "poster": "Gerard Dacudao",
        "poster_url": "/gerard.dacudao?__tn__=R",
        "text": "Valid points David.  But from what I heard, his style goes like this.  3 warnings. 3 strikes and your out.  And each time has to be caught in the act.  Then a stern warning after.  A stern warning that if repeats it, he knows what will happen.  If the criminal who was caught in the act still repeats the crime, thats it.  There is no other way to protect the next victim.    And by the way, our current criminal justice system does not work.  Think mapansano, saf44, pdaf, dap.    The question at the end of the day is, when will this stop?",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226818108912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "Gerard Dacudao  So it basically takes one unpopular person being accused by a couple of people as witnesses three times for someone to move from suspect to dead in that system. That's not an improvement.    Let's just say that we can't convince each other on this topic. For me, Duterte is the worst of the candidates, actually worse than BongBong Marcos or Binay.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226823718912",
        "poster": "Gerard Dacudao",
        "poster_url": "/gerard.dacudao?__tn__=R",
        "text": "Why will you be scared if you aren't doing anything criminal?     The operative words are, \"caught in the act.\"  With a confession too.  Just wouldnt stop doing the crime.    Yup, sticking with the Rottweiler.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226828708912",
        "poster": "Jonathan Sahagun",
        "poster_url": "/aj.sahagun?__tn__=R",
        "text": "Gerard  - What if you find your innocent self at the wrong place and time and get caught in criminal crossfire?    What if you get framed by your rivals or simply get mis-tagged in a case of mistaken identity?",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226829573912",
        "poster": "Jonathan Sahagun",
        "poster_url": "/aj.sahagun?__tn__=R",
        "text": "David  - Yeah, actually, i'd be more likely to give Bongbong the chance to \"be his own man\" and prove that he's not his father, than to choose Duterte.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226829598912",
        "poster": "Gerard Dacudao",
        "poster_url": "/gerard.dacudao?__tn__=R",
        "text": "Wont happen, you know why?  I was not caught in the act.  Even if they miraculously find a way I was \"caught\", they cant make me confess to a crime i did not make.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226831193912",
        "poster": "Jonathan Sahagun",
        "poster_url": "/aj.sahagun?__tn__=R",
        "text": "Gerard  - Ok. Hope those claims hold true. Though I imagine it would be a little hard to assert them in the face of those good gentlemen in black that would come to take you away.  😱",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226831753912",
        "poster": "Gerard Dacudao",
        "poster_url": "/gerard.dacudao?__tn__=R",
        "text": "Ok, guys need to go.  Just think about this, we have 20million Filipinos in extreme poverty.  10million ofws.  Time for a change in the system.  Lets just stick to the platform of a du30 presidency.  He is pro business, pro decentralizatio n via federalism, he is anti corruption via a parliamentary form of govt.  A proven way to improve govt accountbility.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226833093912",
        "poster": "Gerard Dacudao",
        "poster_url": "/gerard.dacudao?__tn__=R",
        "text": "http://newsinfo.inquirer.net/744338/no-middle-ground-for-duterte",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226833298912",
        "poster": "Gerard Dacudao",
        "poster_url": "/gerard.dacudao?__tn__=R",
        "text": "Good read. Bye batchmates. Hope all is well!!!",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226853068912",
        "poster": "Arthur Abon",
        "poster_url": "/arthur.abon?__tn__=R",
        "text": "Actually his pro business, pro decentralizatio n platform is what attracted me to him at first. That and the fact that I want my daughter to live in a Philippines where you could be safe.    However, after further study, that glaring death squad thing just cannot be ignored. Taking a life will always be wrong unless in the context of survival.    The Rottweiler analogy is apt. Specially because given the slightest wrong stimulus, such a breed will rend you limb from limb if not properly trained/ dominated. Wala bang German Sheperd Dog na candidate?",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226903153912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "I'll say one more thing about why Duterte is the absolute worst choice.    Let's suppose we get the best case (unlikely) scenario, that Duterte is genuinely good and uncorruptible and that somehow he will be able to apply his death squad approach to crime across an entire country of 100 million without ever making mistakes about people \"caught in the act\" (an utterly ridiculous thing that can be made up any time you have one unpopular person and a group willing to be witnesses against him/her). He never abuses this ridiculous power, despite the complete lack of oversight or consequences for mistakes.     [Also, how can you say he is pro-accountabil ity when he himself has no accountability for the people he executes?]    That means there is going to be a new branch of government that exceeds all others in power over life and death, which answers only to the president.    OK. Duterte did good. Then his term is over.    What then? What happens with this secret police? Does it keep on answering only to Duterte even when his term is up? Does it then answer to the next president who starts to use it against inconvenient \"political dissidents\" or trouble-making unionizers? How many of those Judge Dredd types in his squad stick around and become addicted to this power?     Congrats, you have just broken democracy completely, again, instead of trying to fix what is flawed.    For every Lee Kuan Yew authoritarian who is actually effective and restrained, we get countless inept and cruel warlords and tyrants scattered around the world.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226919963912",
        "poster": "Gerard Dacudao",
        "poster_url": "/gerard.dacudao?__tn__=R",
        "text": "Democracy in the Philippines has been broken a long time ago.  The only ones who are scared are the criminals.  Go ahead, vote for the chiwawas. Lol",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226928038912",
        "poster": "Gerard Dacudao",
        "poster_url": "/gerard.dacudao?__tn__=R",
        "text": "The police will answer to the new form of government (federal parliamentary ala Germany, SG, Japan).  From what I hear, there is a draft of a new constitution based on that set up.  In other words, rottweiler Presidency is just prime push.  The system will just need to be jump started.  The rest is for us to take care of.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226930223912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "The only reason you and I are free to talk about this on Facebook is that democracy still somewhat functions. You are choosing a murderer who only happens to kill those you don't like, but they have rights too, and there's no knowing how many times he screwed up and killed an innocent.    With people like that, there is no guarantee that he will only keep killing the people you don't like. There is no oversight now and there will be total impunity if he becomes president.    And when he is gone, you will be left with government assassins who can kill whomever the next president likes.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226937813912",
        "poster": "Gerard Dacudao",
        "poster_url": "/gerard.dacudao?__tn__=R",
        "text": "Dont talk to me that bro as if I dont care about life and the dignity it has.  I was born in Davao and spent years as youngster there seeing violence before my innocent eyes.  A church goer being shot a few aisles away.  Blood all over the floor. Beheaded corpses in the farm road, floating bodies on the river which ironically meant being \"salvaged\" or saved.  An aunt kidnapped and killed.  All these in Davao before Duterte came into power.  And you criticize him as if you know all about what \"could happen\"?  Your fears are overbloated.  Just look at Davao now pare.  Your fears will have a sense of proportion.  And not base it on what could happen.  But on reality.      Again, your fears are out of proportion.  I invite you to read up on what he was able to do for Davao.  Actions speaks louder than \"what ifs\".",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226941678912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "Dude I'm sorry if you're offended but the fact is you are supporting a guy whose platform is that he is a mass murderer. I am looking at his actions and they are deafening.    You want a system where one man chooses who lives and dies and nobody can tell whether or not he got the right people because you trust this man, but you aren't thinking about what comes after.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154226949698912",
        "poster": "Gerard Dacudao",
        "poster_url": "/gerard.dacudao?__tn__=R",
        "text": "No problem dude.  He can choose indeed.  You know why?  He is a deputized enforcer of the law.  If it were you and me, we cant do what he is doing for the simple fact that we are not deputized enforcers of the law.  As to Davao, there was \"just cause\".  It was a lawless case that needed an iron hand to solve.  Otherwise we have more death and chaos.  On the national context, the amount of corruption is equal to a high crime with the amount involved in the context of massive poverty.  It is outrageous.  So outrageous that I want a rottweiler to put order again.  Or even for the first time.  He wont be a Marcos and I know that because of what Davao has become.  There is empirical evidence.  Just go there.  You will see.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      },
      {
        "id": "10154227159468912",
        "poster": "Jonathan Sahagun",
        "poster_url": "/aj.sahagun?__tn__=R",
        "text": "The Judge Dredd approach might work for petty holdapers and riding-in-tande ms, but I doubt it will be effective against organized crime syndicates and deep-rooted circles of institutionaliz ed corruption within the government. All we'll get is a huge death toll consisting mostly of fall guys, frameup victims, and disposables.",
        "attachments": [],
        "date": "Dec 3, 2015",
        "replyto": "10154226702818912"
      }
    ]
  }
}