{
  "id": "2e326078-9a6d-4c50-b923-99a9ddd9767f",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "I know you like him, and I don&#x27;t expect to convince you of anything.    To me, he&#x27;s dangerous, actually the least desirable and most dangerous of the candidates up for election. There&#x27;s a decent chance he&#x27;s a mass murderer. Extra-judicial killings, even of alleged criminals, is pretty terrible, and for all that there is outward peace, how many innocent people might be swept up in a country in which the president feels free to use secret police to execute people he feels has broken the law?     I don&#x27;t care about the things he says and his personal life, but electing Duterte means believing that it&#x27;s ok for one man to decide, regardless of legal protections, whether it&#x27;s ok for this person or that person to die. We already had a president like that, and his son is running for VP.    My fellow Filipinos are so strange to me sometimes. Most are anti-abortion (and even anti-contracept ion), but they&#x27;re ok with casually murdering suspected (not even proven) criminals, and the only reason Duterte is being attacked in the media now is because of inconsequential  things he&#x27;s said and the things he&#x27;s done in his personal life.    Incompetence and corruption are things that everyone in the Philippines deals with on a regular basis. All the other candidates will give at worst, more of the same, but Duterte could easily turn this country into a state where things are good for a lot of people, but undesirables (decided upon by only him) are eliminated.     https://www.hrw.org/news/2015/07/17/rodrigo-duterte-rise-philippines-death-squad-mayor",
  "date": "2015-12-03 00:03:20",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154226442293912#10154226806963912",
  "source_obj": {
    "id": "10154226806963912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&__tn__=R",
    "text": "I know you like him, and I don't expect to convince you of anything.    To me, he's dangerous, actually the least desirable and most dangerous of the candidates up for election. There's a decent chance he's a mass murderer. Extra-judicial killings, even of alleged criminals, is pretty terrible, and for all that there is outward peace, how many innocent people might be swept up in a country in which the president feels free to use secret police to execute people he feels has broken the law?     I don't care about the things he says and his personal life, but electing Duterte means believing that it's ok for one man to decide, regardless of legal protections, whether it's ok for this person or that person to die. We already had a president like that, and his son is running for VP.    My fellow Filipinos are so strange to me sometimes. Most are anti-abortion (and even anti-contracept ion), but they're ok with casually murdering suspected (not even proven) criminals, and the only reason Duterte is being attacked in the media now is because of inconsequential  things he's said and the things he's done in his personal life.    Incompetence and corruption are things that everyone in the Philippines deals with on a regular basis. All the other candidates will give at worst, more of the same, but Duterte could easily turn this country into a state where things are good for a lot of people, but undesirables (decided upon by only him) are eliminated.     https://www.hrw.org/news/2015/07/17/rodrigo-duterte-rise-philippines-death-squad-mayor",
    "attachments": [],
    "date": "Dec 3, 2015",
    "replyto": "10154226702818912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10154226442293912#10154226702818912"
}