{
  "id": "bc37d5dc-34f9-413d-8759-925828ebecb5",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "That is the rational, not logical, course of action.    Ako hindi ako fan ni Sereno.  I find her to be partial as a judge, ineffective as an administrator.  There I said it.    I always worry when my cases make it to her.  She breaks the precedents she herself set to give unfavorable rulings to controversial people.    But the business of a court is to try the case, not the man, so she is required to recognize that a bad man may have a righteous case.  She never does that.    In oral arguments, she openly, through tears, and in how she treats litigants and counsels, shows who she is siding with while the case is on-going.    Why would I want to have a judge like that occupy the most revered magistrate post?  I mean, honestly?",
  "date": "2018-05-12 00:00:02",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10156631481338912#10156632763988912",
  "source_obj": {
    "id": "10156632763988912",
    "poster": "Weng Santos",
    "poster_url": "/weng.santos.9?refid=52&_ft_=mf_story_key.10156631481338912%3Atop_level_post_id.10156631481338912%3Atl_objid.10156631481338912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10156631481338912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "That is the rational, not logical, course of action.    Ako hindi ako fan ni Sereno.  I find her to be partial as a judge, ineffective as an administrator.  There I said it.    I always worry when my cases make it to her.  She breaks the precedents she herself set to give unfavorable rulings to controversial people.    But the business of a court is to try the case, not the man, so she is required to recognize that a bad man may have a righteous case.  She never does that.    In oral arguments, she openly, through tears, and in how she treats litigants and counsels, shows who she is siding with while the case is on-going.    Why would I want to have a judge like that occupy the most revered magistrate post?  I mean, honestly?",
    "attachments": [],
    "date": "May 12, 2018",
    "replies": [
      {
        "id": "10156632974373912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "I dont see how any of that after the first sentence is relevant to this post",
        "attachments": [],
        "date": "May 13, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156633805058912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "I'm trying to explain why, while I believe Sereno is being strong-armed out of office with a dangerous precedent, I can't muster up enough sympathy for her to condemn what's happening to her.  I know it's irrational that my personal experiences and emotions are in the way of my neutral assessment of a national issue, but my logic tells me that not having her as a judge, regardless of how she is removed, will be better for our practice and cases.    Does that make sense?",
        "attachments": [],
        "date": "May 13, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156633866643912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "My point being that, yes, disliking a person gets in the way of being rational about this.    As a lawyer, all I want is a fair judge.  But I've felt \"wronged\" by her.  So while it may be \"better\" for the entire country that she is not removed by quo warranto, and that it is right that they stand up against the first-time ouster of a justice by quo warranto and not impeachment, logic nevertheless tells me that it's better not to have such a partial judge sitting on the bench at all, regardless of the means used to remove her.",
        "attachments": [],
        "date": "May 13, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156634074888912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "It seems a bit hypocritical to want to have a fair judge via unfair means.",
        "attachments": [],
        "date": "May 13, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156634091553912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "That's why it's irrational. I admit it's hypocritical.    But I can only have one or the other.  I get a fair judge, which is better for me, my practice, and my clients, and for me, the justice system in general, and I could just call this entire episode karma- a \"you reap what you sow\" kind of thing- and call it a day, OR I could throw my hat in this mess, do everything I can to insist on \"impeachment only\" for her so that she- somebody I dislike- gets to keep her job and gets to continue treating us litigators for controversial clients unfairly.    Maybe I'm a lesser person for for being this way, but I think you understand the choice I made.    Oh, and her removal via quo warranto has legal merit, even J. Velasco who dissented on her removal, said that quo warranto is the proper remedy.  And J. Carpio, who also dissented, voted \"yes\" on the question of whether or not she violated the Constitution, unanimously with all the other justices who voted on that issue.      It only seems \"unfair\" because this is the first time a justice has been removed via quo warranto.  There was no precedent to speak of.  Thus, it was the duty of the Court to set a precedent using their own interpretations  of the laws and facts, and admittedly, she is not well-liked by the Court, so if a precedent such as this was desired, this was the Court to do it.",
        "attachments": [],
        "date": "May 13, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156635423728912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "Weng, your stance here makes the entire practice of law worthless, as it makes the profession of law and the implementation of law in the courts entirely arbitrary and dependent purely on the personnel involved. The bar exam may as well forget about memorizing things and the application of precedent and be about who you know.    The law either applies all the time or it applies none of the time. If you only support it when it is convenient to you, it is a prop that can be set aside rather than an applicaiton of reason.    Every new act can be justified as 'establishing a new precedent' or a new interpretation.  Being a lawyer becomes entirely fluid, every wrong can be defended, every right can be denied, entirely dependent on who your client is.",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156635458528912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "That's just my personal opinion.  I dislike her, I admit it.  But I am not the Court, I do not get to decide these things. And if I was a member of the Court, I would recuse myself from voting on the issue because I understand that my emotions would get in the way of absolute objectivity.    I am an advocate, so I get to pick a side.  I am not expected to be rationally neutral.    The law did apply here.  A quo warranto petition is in the Rules of Court.  It has been invoked so many times for so many public officers before.  The requirements of \"proven integrity and probity\" for judicial applicants and SALN submissions are in the Constitution.    Admittedly, there needed to be an interpretation on whether or not the non-submission of SALNs as required for judicial applicants constitutes a lack of integrity.  The black letter of the law does not provide an answer, and, as we are a mixed civil law-common law nation, the justices had to resolve that issue regardless of the law's silence, as mandated by the Constitution and another law, the Civil Code.    Plus, it's the first time the quo warranto question was raised to the Court in relation to an SC Justice.  It's not an overturning of any precedent before, as there was no precedent to speak of.  This is patient zero.  It is the first time the SC was asked to rule on a theory such as this.    That is the duty of the Court.  We submit our theories as advocates but at the end of the day, the Court must decide what the law means, and we have to abide by it, pursuant to the rule of law.  If you can't accept that that, you really won't like the duty of judges in places like the UK or the US where everything is common law, and all rulings are based solely on the interpretation of judges.    The practice of law is not meaningless. but it is not stagnant, either.  It is dynamic.  We have a legislature creating, repealing, and amending laws full time, and courts that must interpret what those laws mean.  And even then, there are still theories about existing laws that have yet to be tested.  If the SolGen never bothered to ask the question, we would have never had the opportunity to have the Court make a ruling.    There is a silver lining to this: from now on, the JBC cannot shortlist, and the President cannot appoint, any judge or justice with incomplete requirements, no matter how much they personally like the candidate.  Those who apply for judicial positions must make sure their documents are complete and correct. That warning to to not skirt the requirements of the law would have never been heard had the Court not been asked to resolve this controversy.",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156635534563912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "hihintayin ko na lang pattern ng voting sa mga (madami pang) susunod na quo warranto. para makilala sila. deadend sa akin kung parehong side tama.",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156635575943912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Oo, lalo na ngayong may precedent.  Magagamit na yan against other Justices.  Di lang nila magamit kay J. De Castro kasi di nya nakuha yung post ng Chief Justice from which siya ia-oust and for which sya pinag-submit din ng SALNs.",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156635577658912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Isn't it only the sol gen who can decide to proceed with a QW?",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156635580153912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "No.  The rules of court says the SolGen can file it, based on the principle that all authority emanates from the state.  But an individual may also file it, someone who was deprived of the position by an allegedly unqualified candidate.",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156635582343912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "I dont get the part where hindi sya applicable kay De Castro",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156635612818912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Kasi ganito:    The lack of SALNs here, for both of them, happened during the 2012 nominations for a new Chief Justice.  But it was only Sereno who got the post, so only she can be ousted from that post.    When an associate justice becomes the Chief Justice, she vacates her post as an associate justice, and a new associate justice is appointed to replace her. The new Chief Justice is just the Chief Justice; she is not both an associate justice and a Chief Justice at the same time.  So if she is removed as Chief Justice, she is removed from the Court entirely.    Now, as for J. De Castro, since she didn't get the post, she stays in her place as associate justice.  At the time of her appointment as associate justice back in 2007, she submitted all the requirements for that nomination then.  It is only in 2012 that she lacked requirements, for the nomination as Chief Justice.  But again, she did not get that post, so you can't oust her from that post.  She stays in her original associate justice post, but you can't oust her from that either because she qualified for it back in 2007 by submitting all the requirements then.",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156635614913912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "I see.",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156635638818912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "That's why I don't understand why Sereno did this.  She should have declined the nomination when she knew she had incomplete SALNs.  She was already an associate justice then, she knows the legal requirement.  And especially considering that she was taking the post vacated by Corona, who was impeached also on account of a SALN requirement.    Evern Justice Carpio, who ultimately voted not to grant the quo warranto petition, voted yes, Sereno violated the Constitution with her failure to submit her SALNs.    Do you know how many turned down that nomination in 2012?  About 55 other candidates, including the likes of Miriam and Saguisag and Justice Mendoza.  They all deferred to the seniority of the SC.  And while Sereno was not obliged to observe that seniority, she should have known that this would be the most critiqued assumption to the post of Chief Justice ever.  And to do it despite knowledge of her lack of requirements?",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156635640963912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Didnt the JBC say na sufficient na ung binigay nya?",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156635649098912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Part of the ruling says the JBC was wrong in saying that.  What the JBC did was to relax the requirements, which they are not permitted to do.    All along, the presumption of regularity meant that the JBC did their jobs and enforced the requirement.    During the congressional hearings, however, Sereno's camp admittes that they were allowed to submit less than complete requirements by the JBC.",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156636085148912",
        "poster": "Joy Reyes-Madamba",
        "poster_url": "/joyapreyes?__tn__=R",
        "text": "Hi Weng, curious lang. Someone somewhere said that given that 5 of the justices there have already accused Sereno in Congress, shouldn't they have recused themselves from the QW decision using the same reason that you said?",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156636248743912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "Joy Reyes-Madamba  di ba sila yung 5 na declined opinion sa \"sereno violated constitution\" vote? di ko din sure.",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156636652078912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Here's the voting results.",
        "attachments": [
          {
            "url": "https://scontent.fmnl3-2.fna.fbcdn.net/v/t1.0-0/cp0/e15/q65/p110x80/32294548_1717278781689819_4530690910979096576_o.jpg?_nc_cat=109&_nc_sid=1480c5&efg=eyJpIjoiYiJ9&_nc_eui2=AeF7we9j4AeGcVv1YiGQKdvfKohqTzyxYiUqiGpPPLFiJWjAo7YN5cngxOrsfrqDTOg&_nc_ohc=_6BYBE2NsAMAX9d_sa6&_nc_ht=scontent.fmnl3-2.fna&_nc_tp=3&oh=7613082d6368bb1945de47978dc24497&oe=5EF908B1",
            "downloaded": "D:\\temp\\stephen.roy.tang\\cache\\dls\\32294548_1717278781689819_4530690910979096576_o.jpg"
          }
        ],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156636664288912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "They testified on various things, from the purchase of the Land Cruiser, to administrative matters, to projects if the Court.  Not all points raised were damning; some were even favorable.    J. Del Castillo, in the quo warranto case, voted in Sereno's favor despite having given testimony about her in Congress.    The issue in the quo warranto case only relates to the SALN, which is not the topic of most of the testimonies given in Congress.  Remember, the reason these Justices were asked to give testimony in Congress is for impeachment, which is a different proceeding from quo warranto.  Quo warranto questions the qualifications for the office; impeachment questions acts done while in office. So the testimonies given in Congress is largely about what was done when Sereno was already CJ, not whether or not she submitted the requirements in her application for CJ.    Sereno never disputed, even admitted, that she did not submit some SALNs in her application for the CJ post.  Her defense was that the vetting body- the JBC- accepted it as substantial compliance.     Joy Reyes-Madamba",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156636666438912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "yep kita ko nga na 9 lang yung sa dulo. yung 5 kaya na yun yung nag decline opinion? or iba pa?",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156636669423912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Refused to rule.  They don't feel it's a material issue, since tingin din naman nila improper remedy ang quo warranto.",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156636677033912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "To add, quo warranto is always adjudged by the courts.  Impeachment is prosecuted by the House before the Senate, sitting as an impeachment court.    As to whether those who testified in the impeachment proceedings should have recused, I agree it looks bad that they didn't.    Lawyers know this: whenever we feel a judge us biased, we file a motion for inhibition, to ask the judge to desist from hearing a case.  But unless the judge is a relative of one of the litigants, in which case the inhibition is mandatory, the question of whether the judge should desist or not is left to the discretion of the same judge.  It is called voluntary inhibition, and the judge can choose to continue or desist.    If judges recused all the time at every allegation of bias, it would allow litigants to forum-shop; to try out judges until they find a favorable one.  Pretty soon there will be no one left to adjudicate a matter.  So jurisprudence also cautions judges from recusing voluntarily, reminding them that it is their duty to render judgment.     Joy Reyes-Madamba",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156636687053912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "i hope the same jurisprudence was used when considering qw as both legal remedy AND dangerous precedent. could have same cascading effect as forum-shopping.",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      },
      {
        "id": "10156636707413912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "I agree it looks bad.    If the 6 recused, there would still be a quorum of 8 members.  It could've been 6-2 in Sereno's favor.",
        "attachments": [],
        "date": "May 14, 2018",
        "replyto": "10156632763988912"
      }
    ]
  }
}