{
  "id": "e23fb02d-ba4d-4aaf-b1d1-f397d73c61fe",
  "name": "MarisBarney Garcia",
  "url": "https://www.facebook.com/marisbarney.garcia",
  "text": "I think I know how you feel, Wynner. You just said it much more eloquently! When I found out that Marcos was buried at LNMB, I felt like I was punched in the gut. Like you, I was in Edsa. Though I must admit, back then, I didn&#x27;t really know why - basta vehemently anti-Marcos ako. That&#x27;s my emotional take on it.     Pero, from a clinical perspective, the legal basis is there (siyempre, mas alam mo yun). That&#x27;s why I can&#x27;t argue against the burial with conviction. They&#x27;re entitled to their rights, too.     But you know what? I think the Marcoses will get their karma sooner than they think. They exposed a dormant, festering wound that took us 30 years to almost forget. It&#x27;s fresh again, less likely that BBM will be president in 2022.    FB makes me sad, too. What with all the generalizations  and assumptions that the other side is stupid or misinformed (one yelling &quot;bias!&quot;, the other yelling &quot;troll!&quot;).  😥",
  "date": "2016-11-23 00:13:22",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155111964538912#10155114816673912",
  "source_obj": {
    "id": "10155114816673912",
    "poster": "MarisBarney Garcia",
    "poster_url": "/marisbarney.garcia?__tn__=R",
    "text": "I think I know how you feel, Wynner. You just said it much more eloquently! When I found out that Marcos was buried at LNMB, I felt like I was punched in the gut. Like you, I was in Edsa. Though I must admit, back then, I didn't really know why - basta vehemently anti-Marcos ako. That's my emotional take on it.     Pero, from a clinical perspective, the legal basis is there (siyempre, mas alam mo yun). That's why I can't argue against the burial with conviction. They're entitled to their rights, too.     But you know what? I think the Marcoses will get their karma sooner than they think. They exposed a dormant, festering wound that took us 30 years to almost forget. It's fresh again, less likely that BBM will be president in 2022.    FB makes me sad, too. What with all the generalizations  and assumptions that the other side is stupid or misinformed (one yelling \"bias!\", the other yelling \"troll!\").  😥",
    "attachments": [],
    "date": "Nov 23, 2016",
    "replyto": "10155112143918912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10155111964538912#10155112143918912"
}