{
  "id": "d7558d4f-021d-40c2-bce9-9083a1a6e9b8",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "I remember my mom taking me to EDSA. I remember being fed bread and warm Zesto by protesters.  I remember being helped to the roof of a bus so I could see over the crowds.     She said it was important and that I would one day understand.    And I did understand. Not the rebels who picked up arms against the government, no. Those are enemies of the state as far as I&#x27;m concerned, which the state must suppress.  What I understood were the common people on the street, who were fighting a dictatorship with nothing but their voices, stopping tanks with just their hands, singing hymns when faced with guns.    So I grew up anti-Marcos.  And hoped we would never have another leader like him again.    Kaso, magaling ako mag-compartment alize at mag-separate ng issues.  Like yung libing.  I&#x27;ve never felt strongly about that issue, either way.  I&#x27;m with Justice Isagani Cruz on that, bangkay na yan, is that what we worry about?  I don&#x27;t care where it&#x27;s buried, as long as it&#x27;s buried and done with.  There is no symbolism to me like the protesters today claim.  It&#x27;s a corpse.  Good riddance.    But of course, FB has to break my heart with non-sequitur comments.  Because I&#x27;m not anti-libing, and I can&#x27;t be neutral on that issue even though I don&#x27;t really care about it, then I must be pro-Marcos.  That&#x27;s the narrative, and it&#x27;s not the truth. At least, it&#x27;s not my truth.    I fight for the rule of law everyday.  I insist on due process, for former presidents, down to the suspected drug addict on the street.  I am generous with my time and advice, so that people are not taken advantage of by their government unwittingly. I hope I never live to see martial law abuses, or another oppressive regime.  But because I&#x27;m ambivalent on the libing issue, it seems like those other things don&#x27;t count.  I must be pro-Marcos; I must be pro-Marcos-era martial law.    Sorry for the hugot.  Facebook makes me sad sometimes.",
  "date": "2016-11-22 00:00:07",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155111964538912#10155112143918912",
  "source_obj": {
    "id": "10155112143918912",
    "poster": "Weng Santos",
    "poster_url": "/weng.santos.9?refid=52&_ft_=mf_story_key.10155111964538912%3Atop_level_post_id.10155111964538912%3Atl_objid.10155111964538912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155111964538912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "I remember my mom taking me to EDSA. I remember being fed bread and warm Zesto by protesters.  I remember being helped to the roof of a bus so I could see over the crowds.     She said it was important and that I would one day understand.    And I did understand. Not the rebels who picked up arms against the government, no. Those are enemies of the state as far as I'm concerned, which the state must suppress.  What I understood were the common people on the street, who were fighting a dictatorship with nothing but their voices, stopping tanks with just their hands, singing hymns when faced with guns.    So I grew up anti-Marcos.  And hoped we would never have another leader like him again.    Kaso, magaling ako mag-compartment alize at mag-separate ng issues.  Like yung libing.  I've never felt strongly about that issue, either way.  I'm with Justice Isagani Cruz on that, bangkay na yan, is that what we worry about?  I don't care where it's buried, as long as it's buried and done with.  There is no symbolism to me like the protesters today claim.  It's a corpse.  Good riddance.    But of course, FB has to break my heart with non-sequitur comments.  Because I'm not anti-libing, and I can't be neutral on that issue even though I don't really care about it, then I must be pro-Marcos.  That's the narrative, and it's not the truth. At least, it's not my truth.    I fight for the rule of law everyday.  I insist on due process, for former presidents, down to the suspected drug addict on the street.  I am generous with my time and advice, so that people are not taken advantage of by their government unwittingly. I hope I never live to see martial law abuses, or another oppressive regime.  But because I'm ambivalent on the libing issue, it seems like those other things don't count.  I must be pro-Marcos; I must be pro-Marcos-era martial law.    Sorry for the hugot.  Facebook makes me sad sometimes.",
    "attachments": [],
    "date": "Nov 22, 2016",
    "replies": [
      {
        "id": "10155112220503912",
        "poster": "Mylee Ejercito",
        "poster_url": "/romancoat?__tn__=R",
        "text": "I'm against the burial because I think many, many people cannot compartmentaliz e. That the burial will be used as propaganda by the Marcos machine to catapult BBM to the presidency in 2022. Kaya rin although I'm protesting, I also want to think about concrete ways we can combat the misinformation and propaganda that's out there.",
        "attachments": [],
        "date": "Nov 22, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155112238248912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Well, to me ibang usapan yung 2022. I didn't vote for BBM now (Miriam-Leni ako) and I'm pretty sure I won't vote for him then.    But because I can compartmentaliz e, I get why he filed an electoral protest.  Right naman nya yun.  Almost every candidate who loses a close one, and some who lose big, files a protest.    And because we are no longer under his father's regime, and the Constitution guarantees rights to everyone, I will not deny him his right to due process, even of he is a Marcos, even if his father did precisely that to our people.",
        "attachments": [],
        "date": "Nov 22, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155114816673912",
        "poster": "MarisBarney Garcia",
        "poster_url": "/marisbarney.garcia?__tn__=R",
        "text": "I think I know how you feel, Wynner. You just said it much more eloquently! When I found out that Marcos was buried at LNMB, I felt like I was punched in the gut. Like you, I was in Edsa. Though I must admit, back then, I didn't really know why - basta vehemently anti-Marcos ako. That's my emotional take on it.     Pero, from a clinical perspective, the legal basis is there (siyempre, mas alam mo yun). That's why I can't argue against the burial with conviction. They're entitled to their rights, too.     But you know what? I think the Marcoses will get their karma sooner than they think. They exposed a dormant, festering wound that took us 30 years to almost forget. It's fresh again, less likely that BBM will be president in 2022.    FB makes me sad, too. What with all the generalizations  and assumptions that the other side is stupid or misinformed (one yelling \"bias!\", the other yelling \"troll!\").  😥",
        "attachments": [],
        "date": "Nov 23, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155114822353912",
        "poster": "MarisBarney Garcia",
        "poster_url": "/marisbarney.garcia?__tn__=R",
        "text": "P.S. Hi Roy! Sorry for hijacking your post! 😋",
        "attachments": [],
        "date": "Nov 23, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155114824193912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "HI  MarisBarney Garcia ! All my posts are always open for discussion  :D",
        "attachments": [],
        "date": "Nov 23, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155114836258912",
        "poster": "Mylee Ejercito",
        "poster_url": "/romancoat?__tn__=R",
        "text": "MarisBarney , i hope that what you're thinking is true na this allowed us to remember. I worry kasi na the people who are remembering are the \"elite\" -- we need to make sure we reach out to the rest of the voters and combat the very rampant misinformation out there.",
        "attachments": [],
        "date": "Nov 23, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155114852688912",
        "poster": "MarisBarney Garcia",
        "poster_url": "/marisbarney.garcia?__tn__=R",
        "text": "If by elite, you mean educated, I think we should give the ''masa\" more credit. They have their own convictions, too, and are probably thinking that they should reform us!  😮  I think we all read and hear the same things but just process things differently. and the misinformation is actually our inherent filter of the same info creating  an echo chamber of our thoughts.     Feeling ko naman, mas nakasama tong burial for the Marcoses. The news is filled with anger towards what they did.",
        "attachments": [],
        "date": "Nov 23, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155114872463912",
        "poster": "Mylee Ejercito",
        "poster_url": "/romancoat?__tn__=R",
        "text": "I don't think the masa has less capability for critical thinking. I think they may not the same level of access to information. So need to make sure the information is out there.",
        "attachments": [],
        "date": "Nov 23, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155114885418912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "I really have no emotions about the burial.  I don't know why.  But yun nga, it's a corpse eh.  It can't declare martial law, it can't issue arrest search seizure orders, it can't do anything corrupt, it can't steal.  Much more now that it's 6 feet underground.    If pushed to determine its symbolic value, well, its value to me is as the lifeless body of a dead dictator who can't hurt me anymore.",
        "attachments": [],
        "date": "Nov 23, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155114896958912",
        "poster": "MarisBarney Garcia",
        "poster_url": "/marisbarney.garcia?__tn__=R",
        "text": "It's the thought na another 30 yrs from now, ituturing na siyang bayani by virtue of his location. Eww Lang.",
        "attachments": [],
        "date": "Nov 23, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155114901188912",
        "poster": "Mylee Ejercito",
        "poster_url": "/romancoat?__tn__=R",
        "text": "Exactly.",
        "attachments": [],
        "date": "Nov 23, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155114905773912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "That's just not what worries me.  It's a label and I don't roll like that.    I'm more worried that 30 years from now, extra-judicial killings are not just commonplace, but that Duterte has made it the norm, only then they're being shot with AKs, coz you know, Russia.  That we're an annex of China.  That traffic has turned the Philippines into a parking lot.  Or that Bataan turns into Chernobyl disaster and our grand kids are born with 5 eyes and 6 legs.    I guess I jus't don't feel strongly about what people say the burial means like you guys do.",
        "attachments": [],
        "date": "Nov 23, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155114910398912",
        "poster": "Mylee Ejercito",
        "poster_url": "/romancoat?__tn__=R",
        "text": "If everyone felt the same way, I'd be much less worried. But i agree that your other concerns are valid and we must be on our guard against those as well.    This could be the lever that shakes people out of their complacency and galvanizes people to action against all those things.",
        "attachments": [],
        "date": "Nov 23, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155115745828912",
        "poster": "MarisBarney Garcia",
        "poster_url": "/marisbarney.garcia?__tn__=R",
        "text": "Wynner, i guess if it's a matter of meeting basic needs (traffic, Bataan, etc) vs honor (LNMB issue), talaga namang the former that takes precedence. Diba nga, Maslow? Given the struggle to stay alive plus the rule of law, i get why many aren't AS concerned about labels to take to the streets (it doesn't strike me as complacency). And that's perfectly valid! Just as valid as how honor and heroism are valued by many. Stalemate nga. But at least both sides want to make things better.",
        "attachments": [],
        "date": "Nov 24, 2016",
        "replyto": "10155112143918912"
      },
      {
        "id": "10155116149868912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Tama.  I want to make things better, too, overall, in the grand scheme of things.    The libing issue just doesn't make me cry or sad unlike other issues.",
        "attachments": [],
        "date": "Nov 24, 2016",
        "replyto": "10155112143918912"
      }
    ]
  }
}