{
  "id": "8278703b-61b4-4adb-a5eb-c8ce2a5f3e5b",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "We actually wrote the chief justice about this. We told her this is her responsibility.   But what can she do? The CJ was never a judge, never a litigator.  This is what happens when a president appoints allies instead of magistrates to the SC.",
  "date": "2017-03-31 00:00:00",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155490586763912#10155490793668912",
  "source_obj": {
    "id": "10155490793668912",
    "poster": "Weng Santos",
    "poster_url": "/weng.santos.9?refid=52&_ft_=mf_story_key.10155490586763912%3Atop_level_post_id.10155490586763912%3Atl_objid.10155490586763912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155490586763912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "We actually wrote the chief justice about this. We told her this is her responsibility.   But what can she do? The CJ was never a judge, never a litigator.  This is what happens when a president appoints allies instead of magistrates to the SC.",
    "attachments": [],
    "date": "Mar 31, 2017",
    "replies": [
      {
        "id": "10155490911893912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "So alin dun sa mga causes I listed above ang most common problem? Lack of manpower talaga?",
        "attachments": [],
        "date": "Mar 31, 2017",
        "replyto": "10155490793668912"
      },
      {
        "id": "10155491010863912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Yes. We don't do continuous trial here. It's just not possible.    Example: On March 23 I did a hearing at the Sandiganbayan. We had a pending motion that was yet unresolved by the court. So I moved for that day's scheduled arraignment, which hinges on the motion, to be deferred until the motion is resolved.  But that division has like 400 active cases.  So to give the court time to resolve the motion, the arraignment was reset for a month later, to April 20. 1 month, for the court to determine whether the case should be dismissed or not.  That motion though, was filed in February.  So actually, 2 months, to resolve that single incident. It might even take longer. I wouldn't be surprised.    In another case, trials are set for Thursdays only.  But the prosecution has over 100 witnesses.  Just to hear them all out would take over 2 years.  Then we have to rebut each one with evidence of our own, so another 2 years, if it goes as scheduled.  Why? Coz the division is so overflowing with cases, there's not enough personnel to draft everything, and not enough time to hear everybody in one go.",
        "attachments": [],
        "date": "Mar 31, 2017",
        "replyto": "10155490793668912"
      }
    ]
  }
}