{
  "id": "fc38f6d9-6583-4fea-8878-f2185c16556f",
  "name": "Jaime L. Garcia",
  "url": "https://www.facebook.com/jaime.l.garcia.779",
  "text": "There&#x27;s a fine, fine, line between genius and insanity, and being justifiably wary versus being paranoid.     In our idea of normalcy, it&#x27;s quite difficult enough to distinguish fake news sites from the reliable ones (given how wild things are). Imagine if the paranoia extends all the way into things like science books, and you&#x27;re unwilling to trust information unless you see it for yourself firsthand.    It&#x27;s still quite hard to visibly check with your own eyes, or with a machine you&#x27;ve built that the world is indeed round.    I&#x27;d chalk this one up to paranoia and mistrust instead of willing ignorance.    Maybe laziness in verifying too; there ought to be other ways to verify that knowledge without having to go around the world on a craft where you can see the entire journey.",
  "date": "2016-12-08 00:00:01",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155158227403912#10155158296773912",
  "source_obj": {
    "id": "10155158296773912",
    "poster": "Jaime L. Garcia",
    "poster_url": "/jaime.l.garcia.779?refid=52&_ft_=mf_story_key.10155158227403912%3Atop_level_post_id.10155158227403912%3Atl_objid.10155158227403912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10155158227403912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "There's a fine, fine, line between genius and insanity, and being justifiably wary versus being paranoid.     In our idea of normalcy, it's quite difficult enough to distinguish fake news sites from the reliable ones (given how wild things are). Imagine if the paranoia extends all the way into things like science books, and you're unwilling to trust information unless you see it for yourself firsthand.    It's still quite hard to visibly check with your own eyes, or with a machine you've built that the world is indeed round.    I'd chalk this one up to paranoia and mistrust instead of willing ignorance.    Maybe laziness in verifying too; there ought to be other ways to verify that knowledge without having to go around the world on a craft where you can see the entire journey.",
    "attachments": [],
    "date": "Dec 8, 2016",
    "replies": [
      {
        "id": "10155158324983912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "When I was a kid, I used to think that airplanes were giant loading screens in the world, similar to how Castlevania: SOTN had those CD rooms between big chunks of the map.    The \"Matrix world\" (as it were) was busy loading the creatures and the terrain below, and you weren't really flying to a destination - you were just kept in a box until the world below had already loaded.",
        "attachments": [],
        "date": "Dec 8, 2016",
        "replyto": "10155158296773912"
      }
    ]
  }
}