{
  "id": "8db1390b-dddf-4b24-aa2d-7192e58d0caf",
  "name": "Jaime L. Garcia",
  "url": "https://www.facebook.com/jaime.l.garcia.779",
  "text": "I have trouble grokking the difference between good and bad motives in a democracy.     We are all encouraged to vote for our own interests per se (Selfishness).    Let&#x27;s pretend I like candidate A because of their platform to improve a specific rural area and turn it into a business district* and I am business minded.    What&#x27;s the difference with me voting for them because I believe it will help me establish a tech company in 4 years (projected value of 2Million) in that will take advantage of that urbanization, versus myself being paid 1M to be an influencer on their behalf? (Ethically speaking, the latter one is in a legal gray area, but is no different from being a campaign marketer).    Am I bad for being motivated in this manner? Or only if I take part in direct vote buying?    * I got nothing against CBDs or rural areas. I do not mean to say that Rural areas are inferior to CBDs, but it is acknowledged that companies love setting up here, for this example.",
  "date": "2019-03-20 00:00:04",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10157328707358912#10157329446423912",
  "source_obj": {
    "id": "10157329446423912",
    "poster": "Jaime L. Garcia",
    "poster_url": "/jaime.l.garcia.779?refid=52&_ft_=mf_story_key.10157328707358912%3Atop_level_post_id.10157328707358912%3Atl_objid.10157328707358912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10157328707358912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "I have trouble grokking the difference between good and bad motives in a democracy.     We are all encouraged to vote for our own interests per se (Selfishness).    Let's pretend I like candidate A because of their platform to improve a specific rural area and turn it into a business district* and I am business minded.    What's the difference with me voting for them because I believe it will help me establish a tech company in 4 years (projected value of 2Million) in that will take advantage of that urbanization, versus myself being paid 1M to be an influencer on their behalf? (Ethically speaking, the latter one is in a legal gray area, but is no different from being a campaign marketer).    Am I bad for being motivated in this manner? Or only if I take part in direct vote buying?    * I got nothing against CBDs or rural areas. I do not mean to say that Rural areas are inferior to CBDs, but it is acknowledged that companies love setting up here, for this example.",
    "attachments": [],
    "date": "Mar 20, 2019",
    "replies": [
      {
        "id": "10157329452348912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "Btw anyone who is looking at this from a sheer numbers perspective should take the sureball 1m. Unless you're backing a sure winner who probably wouldn't pay you.    Projections change and 200% growth over 4 years isn't good enough for that timescale given that you can get money here and now.",
        "attachments": [],
        "date": "Mar 20, 2019",
        "replyto": "10157329446423912"
      },
      {
        "id": "10157329452603912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Selfishness is not bad per se. I use \"bad\" in this sense to indicate \"prioritizing selfish interests over the greater good\". Obviously there are many scenarios where the greater good also happens serves the selfish interests, in which case there is no conflict, as in your example. The bad motives only shine through if for example \"As a government bureaucrat, I will support this platform because they are willing to bribe me to get permits\", where the additional cost of the bribe is eventually paid for by the public in the form of increased costs",
        "attachments": [],
        "date": "Mar 20, 2019",
        "replyto": "10157329446423912"
      },
      {
        "id": "10157329453258912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Also, if it helps, the hypothetical Person A in my scenario is not an ordinary citizen, he is running for public office. I did not mention this explicitly because I don't think it was relevant, I think the same thinking can be applied if you were an ordinary citizen (just that ordinary citizens have less impact generally)",
        "attachments": [],
        "date": "Mar 20, 2019",
        "replyto": "10157329446423912"
      },
      {
        "id": "10157329459888912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Also, I don't think being paid to be an influencer is a gray area (legally), as promoting something for money is not in and of itself illegal. Though it is probably more ethical to disclose that you are being paid",
        "attachments": [],
        "date": "Mar 20, 2019",
        "replyto": "10157329446423912"
      },
      {
        "id": "10157329506658912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "Roy Tang  I wish that there was such a clean cut case of no conflict of interest for any project - even those with the greater good - involved with statehood. (In my example, eminent domain and house displacement would be bad for the people living in the area.)    I guess, if you look for un-systematic (?) benefits from your candidate, it's bad. But not necessarily private benefits for service? (eg. Compare:    1. I have a construction company, I see the election of pro-urbanizatio n candidate A as a business opportunity.    2. As 1, but I have worked with Candidate A before in construction contracts, so I have a leg up with the competition.    3. As 1, but I know I candidate A can be bribed so that I get the contract.    3 is clearly bad. 1 is okay because all construction companies benefit. 2 is also okay because the history is irrelevant?)",
        "attachments": [],
        "date": "Mar 20, 2019",
        "replyto": "10157329446423912"
      },
      {
        "id": "10157329507593912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "Roy Tang  Yeah, I don't think it is that relevant that he is running for office.",
        "attachments": [],
        "date": "Mar 20, 2019",
        "replyto": "10157329446423912"
      },
      {
        "id": "10157329509938912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "Roy Tang  To be fair, most influencers right now have a bad rap of concealing that they were paid advertisers. I was admittedly going for that, but that's probably a case of bad execution more than bad intent. Doing work that favors a campaign isn't bad so long as you aren't breaking the law.",
        "attachments": [],
        "date": "Mar 20, 2019",
        "replyto": "10157329446423912"
      },
      {
        "id": "10157329513038912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "\"eminent domain and house displacement would be bad for the people living in the area\" -> these are \"arguable bads\", that could still presumably be for the greater good (i.e. the business project could still be overall good for the larger comnmunity), which I consider acceptable to support, as long as you can justify. Not everyone sees the same steps to progress of course. But there are also \"outright bads\" that are outright indefensible, depending on your moral code, examples would be bribery, corruption, murders, etc. However, any absolute assessment of good/bad does not matter, the analysis in the OP only involves whether Person A sees his own motives as good/bad, as the objective is only to analyze what is motivating Person A from his POV",
        "attachments": [],
        "date": "Mar 20, 2019",
        "replyto": "10157329446423912"
      },
      {
        "id": "10157329517028912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "Roy Tang  That's fair. Though you'd be surprised how many people think they're on the side of good despite bad methods (eg. Bribery as a means to get things done in a system that cannot get things done on its own is a slippery slope of morality)    Thanks for the clarif.",
        "attachments": [],
        "date": "Mar 20, 2019",
        "replyto": "10157329446423912"
      }
    ]
  }
}