{
  "id": "063a2c81-7e29-4aea-a047-76a066be4ffc",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "I like the 12 Monkeys interpretation,  which is that all alterations in the timeline aren&#x27;t alterations because anything that was changed was going to happen that way anyway. If someone was going to travel back in time to do X, that is already what happened and there is no alternative timeline (this is also how it is in Summer Time Machine Blues).    From that perspective, future you may have already traveled back in time, but didn&#x27;t hang out with you because he didn&#x27;t feel like it anyway.    I like it better than Back to the Future&#x27;s sloppy timeline alterations and it&#x27;s more elegant than time travel just jumping between branching realities.",
  "date": "2014-01-28 00:00:00",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10152753574898912#10152753579748912",
  "source_obj": {
    "id": "10152753579748912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&refid=52&_ft_=mf_story_key.10152753574898912%3Atop_level_post_id.10152753574898912%3Atl_objid.10152753574898912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10152753574898912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "I like the 12 Monkeys interpretation,  which is that all alterations in the timeline aren't alterations because anything that was changed was going to happen that way anyway. If someone was going to travel back in time to do X, that is already what happened and there is no alternative timeline (this is also how it is in Summer Time Machine Blues).    From that perspective, future you may have already traveled back in time, but didn't hang out with you because he didn't feel like it anyway.    I like it better than Back to the Future's sloppy timeline alterations and it's more elegant than time travel just jumping between branching realities.",
    "attachments": [],
    "date": "Jan 28, 2014"
  }
}