{
  "id": "2a52325a-f717-41f9-9ffa-974b27144d30",
  "name": "Jonathan Sahagun",
  "url": "https://www.facebook.com/aj.sahagun",
  "text": "Hehe... you got the general idea of using time to supply the missing bits of precision. But don&#x27;t forget that the poison isn&#x27;t insta-kill and needs exactly 7 days to kick in, so the amount of time you have is only 4 days, from day 7 to day 10.    (spoiler)    ...    ...    ...    With 8 tasters, you will only be able to test 256 barrels in one sitting. You need two more testers/bits (i.e., a factor of 4) to test all 1024. You get those two missing bits by holding tasting sessions for 4 consecutive days with 256 barrels per day, and observing when the tasters start collapsing.    This is why I was careful to explicitly say &quot;exactly 7 days&quot; when I wrote the problem... because it depends a lot on timing.    If they die on day 7, then the poison is in the first day&#x27;s batch.    If they die on day 8, then the poison is in the second day&#x27;s batch.    If they die on day 9, then the poison is in the third day&#x27;s batch.    If they die on day 10 (right before the feast), then the poison is in the fourth day&#x27;s batch.    Once you know which batch of 256 barrels contains the poison, use the usual binary search approach to map the combination of taster deaths to the specific barrel among the 256 for that batch.    The corner case I mentioned was when no one dies at all. If that happens, there will be four candidate barrels, one for each day, but you won&#x27;t know exactly which one it is that&#x27;s poisoned.     :D",
  "date": "2014-03-31 00:00:36",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10152869133928912#10152869779713912",
  "source_obj": {
    "id": "10152869779713912",
    "poster": "Jonathan Sahagun",
    "poster_url": "/aj.sahagun?refid=52&_ft_=mf_story_key.10152869133928912%3Atop_level_post_id.10152869133928912%3Atl_objid.10152869133928912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10152869133928912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Hehe... you got the general idea of using time to supply the missing bits of precision. But don't forget that the poison isn't insta-kill and needs exactly 7 days to kick in, so the amount of time you have is only 4 days, from day 7 to day 10.    (spoiler)    ...    ...    ...    With 8 tasters, you will only be able to test 256 barrels in one sitting. You need two more testers/bits (i.e., a factor of 4) to test all 1024. You get those two missing bits by holding tasting sessions for 4 consecutive days with 256 barrels per day, and observing when the tasters start collapsing.    This is why I was careful to explicitly say \"exactly 7 days\" when I wrote the problem... because it depends a lot on timing.    If they die on day 7, then the poison is in the first day's batch.    If they die on day 8, then the poison is in the second day's batch.    If they die on day 9, then the poison is in the third day's batch.    If they die on day 10 (right before the feast), then the poison is in the fourth day's batch.    Once you know which batch of 256 barrels contains the poison, use the usual binary search approach to map the combination of taster deaths to the specific barrel among the 256 for that batch.    The corner case I mentioned was when no one dies at all. If that happens, there will be four candidate barrels, one for each day, but you won't know exactly which one it is that's poisoned.     :D",
    "attachments": [],
    "date": "Mar 31, 2014"
  }
}