{"id": 18045787, "name": "ysmartin", "url": "https://stackoverflow.com/users/2350823/ysmartin", "text": "Indeed, you can use JavaScript as long as we you abide by WCAG 2.0 success criteria :-)\r\n\r\nThere is a rationale why you may have heard JavaScript is banished from accessible content. ***In the old days of WCAG 1.0,*** it practically censured the use of any content generated by JavaScript. You needed to check that your web application still worked with JavaScript disabled, which practically restricted JavaScript to decorative purposes. Otherwise, you ought to provide an alternate, non-JavaScript reliant, version, which usually involved a lot of server-side magic (try and see Google Maps without JS to understand what I mean).\r\nThis was because in those old days assistive technologies and even some mainstream browsers (e.g. mobile) did not support JavaScript, or browsers did not expose script-generated contents.\r\n\r\n***This is not the case anymore.*** You can use JavaScript in accessible, WCAG 2.0, websites, but:\r\n\r\n- Get acquainted with WCAG 2.0 criteria and make sure you are not failing any of them. It is not a matter of using one or another technology, but a matter of using them correctly.\r\n- In particular, check you abide by the [client-side scripting techniques for WCAG 2.0][1] which deal with recommended and disapproved scripting usages.\r\n- Use [ARIA Techniques for WCAG 2.0][2] to define the semantics of non-standard controls, they are widely supported by major browsers.\r\n\r\n\r\n  [1]: http://www.w3.org/TR/WCAG20-TECHS/client-side-script.html\r\n  [2]: http://www.w3.org/TR/WCAG20-TECHS/aria.html", "date": "2013-08-04 17:49:20", "photo": "https://www.gravatar.com/avatar/b256f5d4871fbae3683564e985fd7177?s=128&d=identicon&r=PG", "source_url": "https://stackoverflow.com/questions/8383151/does-compliance-to-wcag-2-0-aa-prevent-the-use-of-javascript", "mention_url": "https://stackoverflow.com/questions/8383151/does-compliance-to-wcag-2-0-aa-prevent-the-use-of-javascript", "source": "stackexchange"}