{
  "id": "14822394-dbc3-4b8f-8cea-dd487f65c78d",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "That&#x27;s why I don&#x27;t understand why Sereno did this.  She should have declined the nomination when she knew she had incomplete SALNs.  She was already an associate justice then, she knows the legal requirement.  And especially considering that she was taking the post vacated by Corona, who was impeached also on account of a SALN requirement.    Evern Justice Carpio, who ultimately voted not to grant the quo warranto petition, voted yes, Sereno violated the Constitution with her failure to submit her SALNs.    Do you know how many turned down that nomination in 2012?  About 55 other candidates, including the likes of Miriam and Saguisag and Justice Mendoza.  They all deferred to the seniority of the SC.  And while Sereno was not obliged to observe that seniority, she should have known that this would be the most critiqued assumption to the post of Chief Justice ever.  And to do it despite knowledge of her lack of requirements?",
  "date": "2018-05-14 00:05:14",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10156631481338912#10156635638818912",
  "source_obj": {
    "id": "10156635638818912",
    "poster": "Weng Santos",
    "poster_url": "/weng.santos.9?__tn__=R",
    "text": "That's why I don't understand why Sereno did this.  She should have declined the nomination when she knew she had incomplete SALNs.  She was already an associate justice then, she knows the legal requirement.  And especially considering that she was taking the post vacated by Corona, who was impeached also on account of a SALN requirement.    Evern Justice Carpio, who ultimately voted not to grant the quo warranto petition, voted yes, Sereno violated the Constitution with her failure to submit her SALNs.    Do you know how many turned down that nomination in 2012?  About 55 other candidates, including the likes of Miriam and Saguisag and Justice Mendoza.  They all deferred to the seniority of the SC.  And while Sereno was not obliged to observe that seniority, she should have known that this would be the most critiqued assumption to the post of Chief Justice ever.  And to do it despite knowledge of her lack of requirements?",
    "attachments": [],
    "date": "May 14, 2018",
    "replyto": "10156632763988912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10156631481338912#10156632763988912"
}