{
  "id": "75512a4b-b1ba-44c7-a738-ba7a4637f7e4",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "That&#x27;s just my personal opinion.  I dislike her, I admit it.  But I am not the Court, I do not get to decide these things. And if I was a member of the Court, I would recuse myself from voting on the issue because I understand that my emotions would get in the way of absolute objectivity.    I am an advocate, so I get to pick a side.  I am not expected to be rationally neutral.    The law did apply here.  A quo warranto petition is in the Rules of Court.  It has been invoked so many times for so many public officers before.  The requirements of &quot;proven integrity and probity&quot; for judicial applicants and SALN submissions are in the Constitution.    Admittedly, there needed to be an interpretation on whether or not the non-submission of SALNs as required for judicial applicants constitutes a lack of integrity.  The black letter of the law does not provide an answer, and, as we are a mixed civil law-common law nation, the justices had to resolve that issue regardless of the law&#x27;s silence, as mandated by the Constitution and another law, the Civil Code.    Plus, it&#x27;s the first time the quo warranto question was raised to the Court in relation to an SC Justice.  It&#x27;s not an overturning of any precedent before, as there was no precedent to speak of.  This is patient zero.  It is the first time the SC was asked to rule on a theory such as this.    That is the duty of the Court.  We submit our theories as advocates but at the end of the day, the Court must decide what the law means, and we have to abide by it, pursuant to the rule of law.  If you can&#x27;t accept that that, you really won&#x27;t like the duty of judges in places like the UK or the US where everything is common law, and all rulings are based solely on the interpretation of judges.    The practice of law is not meaningless. but it is not stagnant, either.  It is dynamic.  We have a legislature creating, repealing, and amending laws full time, and courts that must interpret what those laws mean.  And even then, there are still theories about existing laws that have yet to be tested.  If the SolGen never bothered to ask the question, we would have never had the opportunity to have the Court make a ruling.    There is a silver lining to this: from now on, the JBC cannot shortlist, and the President cannot appoint, any judge or justice with incomplete requirements, no matter how much they personally like the candidate.  Those who apply for judicial positions must make sure their documents are complete and correct. That warning to to not skirt the requirements of the law would have never been heard had the Court not been asked to resolve this controversy.",
  "date": "2018-05-14 00:05:06",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10156631481338912#10156635458528912",
  "source_obj": {
    "id": "10156635458528912",
    "poster": "Weng Santos",
    "poster_url": "/weng.santos.9?__tn__=R",
    "text": "That's just my personal opinion.  I dislike her, I admit it.  But I am not the Court, I do not get to decide these things. And if I was a member of the Court, I would recuse myself from voting on the issue because I understand that my emotions would get in the way of absolute objectivity.    I am an advocate, so I get to pick a side.  I am not expected to be rationally neutral.    The law did apply here.  A quo warranto petition is in the Rules of Court.  It has been invoked so many times for so many public officers before.  The requirements of \"proven integrity and probity\" for judicial applicants and SALN submissions are in the Constitution.    Admittedly, there needed to be an interpretation on whether or not the non-submission of SALNs as required for judicial applicants constitutes a lack of integrity.  The black letter of the law does not provide an answer, and, as we are a mixed civil law-common law nation, the justices had to resolve that issue regardless of the law's silence, as mandated by the Constitution and another law, the Civil Code.    Plus, it's the first time the quo warranto question was raised to the Court in relation to an SC Justice.  It's not an overturning of any precedent before, as there was no precedent to speak of.  This is patient zero.  It is the first time the SC was asked to rule on a theory such as this.    That is the duty of the Court.  We submit our theories as advocates but at the end of the day, the Court must decide what the law means, and we have to abide by it, pursuant to the rule of law.  If you can't accept that that, you really won't like the duty of judges in places like the UK or the US where everything is common law, and all rulings are based solely on the interpretation of judges.    The practice of law is not meaningless. but it is not stagnant, either.  It is dynamic.  We have a legislature creating, repealing, and amending laws full time, and courts that must interpret what those laws mean.  And even then, there are still theories about existing laws that have yet to be tested.  If the SolGen never bothered to ask the question, we would have never had the opportunity to have the Court make a ruling.    There is a silver lining to this: from now on, the JBC cannot shortlist, and the President cannot appoint, any judge or justice with incomplete requirements, no matter how much they personally like the candidate.  Those who apply for judicial positions must make sure their documents are complete and correct. That warning to to not skirt the requirements of the law would have never been heard had the Court not been asked to resolve this controversy.",
    "attachments": [],
    "date": "May 14, 2018",
    "replyto": "10156632763988912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10156631481338912#10156632763988912"
}