{
  "id": "1ef63f2a-b8b3-48b1-9f32-5f39933190e8",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "Kasi ganito:    The lack of SALNs here, for both of them, happened during the 2012 nominations for a new Chief Justice.  But it was only Sereno who got the post, so only she can be ousted from that post.    When an associate justice becomes the Chief Justice, she vacates her post as an associate justice, and a new associate justice is appointed to replace her. The new Chief Justice is just the Chief Justice; she is not both an associate justice and a Chief Justice at the same time.  So if she is removed as Chief Justice, she is removed from the Court entirely.    Now, as for J. De Castro, since she didn&#x27;t get the post, she stays in her place as associate justice.  At the time of her appointment as associate justice back in 2007, she submitted all the requirements for that nomination then.  It is only in 2012 that she lacked requirements, for the nomination as Chief Justice.  But again, she did not get that post, so you can&#x27;t oust her from that post.  She stays in her original associate justice post, but you can&#x27;t oust her from that either because she qualified for it back in 2007 by submitting all the requirements then.",
  "date": "2018-05-14 00:05:12",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10156631481338912#10156635612818912",
  "source_obj": {
    "id": "10156635612818912",
    "poster": "Weng Santos",
    "poster_url": "/weng.santos.9?__tn__=R",
    "text": "Kasi ganito:    The lack of SALNs here, for both of them, happened during the 2012 nominations for a new Chief Justice.  But it was only Sereno who got the post, so only she can be ousted from that post.    When an associate justice becomes the Chief Justice, she vacates her post as an associate justice, and a new associate justice is appointed to replace her. The new Chief Justice is just the Chief Justice; she is not both an associate justice and a Chief Justice at the same time.  So if she is removed as Chief Justice, she is removed from the Court entirely.    Now, as for J. De Castro, since she didn't get the post, she stays in her place as associate justice.  At the time of her appointment as associate justice back in 2007, she submitted all the requirements for that nomination then.  It is only in 2012 that she lacked requirements, for the nomination as Chief Justice.  But again, she did not get that post, so you can't oust her from that post.  She stays in her original associate justice post, but you can't oust her from that either because she qualified for it back in 2007 by submitting all the requirements then.",
    "attachments": [],
    "date": "May 14, 2018",
    "replyto": "10156632763988912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10156631481338912#10156632763988912"
}