{
  "id": "ddccc8f2-ac45-41a2-919c-208dd18d7528",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "Sorry bout that, forgot that fb auto deletes extra carriage returns.   :  :  :  :  :  :  :  :  :  :  :  :  :  :  :  V  So I mostly liked it, and it successfully evoked the old vibe. The bits on the desert world were beautiful. And I like that Finn and Rey are platonic. I also like how much more real the stormtroopers seem.    I don&#x27;t mind the setup with the resistance, Republic and First Order. It makes sense--the Republic is the new government in regions where the Empire totally folded, the First Order is where Imp forces retained control, and Resistance are funded partisans in FO territory.    Minor quibbles: the Han-Ren scene got milked for too long. It&#x27;s a bit ridiculous that the FO have this planet sized super death star but no fleet to protect it. Wish Han found them on the Falcon because he was searching for it and not due to random chance. And Rey is ridiculously force talented, able to defeat an experienced darksider with zero training.",
  "date": "2015-12-18 00:01:41",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154253828953912#10154253863413912",
  "source_obj": {
    "id": "10154253863413912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&__tn__=R",
    "text": "Sorry bout that, forgot that fb auto deletes extra carriage returns.   :  :  :  :  :  :  :  :  :  :  :  :  :  :  :  V  So I mostly liked it, and it successfully evoked the old vibe. The bits on the desert world were beautiful. And I like that Finn and Rey are platonic. I also like how much more real the stormtroopers seem.    I don't mind the setup with the resistance, Republic and First Order. It makes sense--the Republic is the new government in regions where the Empire totally folded, the First Order is where Imp forces retained control, and Resistance are funded partisans in FO territory.    Minor quibbles: the Han-Ren scene got milked for too long. It's a bit ridiculous that the FO have this planet sized super death star but no fleet to protect it. Wish Han found them on the Falcon because he was searching for it and not due to random chance. And Rey is ridiculously force talented, able to defeat an experienced darksider with zero training.",
    "attachments": [],
    "date": "Dec 18, 2015",
    "replyto": "10154253852683912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10154253828953912#10154253852683912"
}