{
  "id": "904ebc50-b97b-4dad-bbe4-b8c21b67744e",
  "name": "David Ramirez",
  "url": "https://www.facebook.com/profile.php",
  "text": "Spoiler thread!!",
  "date": "2015-12-18 00:00:00",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154253828953912#10154253852683912",
  "source_obj": {
    "id": "10154253852683912",
    "poster": "David Ramirez",
    "poster_url": "/profile.php?id=827533990&refid=52&_ft_=mf_story_key.10154253828953912%3Atop_level_post_id.10154253828953912%3Atl_objid.10154253828953912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10154253828953912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Spoiler thread!!",
    "attachments": [],
    "date": "Dec 18, 2015",
    "replies": [
      {
        "id": "10154253858043912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Grabe Dave, I was kidding! People will see that!",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154253863413912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "Sorry bout that, forgot that fb auto deletes extra carriage returns.   :  :  :  :  :  :  :  :  :  :  :  :  :  :  :  V  So I mostly liked it, and it successfully evoked the old vibe. The bits on the desert world were beautiful. And I like that Finn and Rey are platonic. I also like how much more real the stormtroopers seem.    I don't mind the setup with the resistance, Republic and First Order. It makes sense--the Republic is the new government in regions where the Empire totally folded, the First Order is where Imp forces retained control, and Resistance are funded partisans in FO territory.    Minor quibbles: the Han-Ren scene got milked for too long. It's a bit ridiculous that the FO have this planet sized super death star but no fleet to protect it. Wish Han found them on the Falcon because he was searching for it and not due to random chance. And Rey is ridiculously force talented, able to defeat an experienced darksider with zero training.",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154253865018912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Yung training nya is only slightly more ridiculous than Luke's was, who had like a couple of hours on the Falcon and a few days on Dagobah. Also, incompetent kasi si dark side guy  :p  (and wounded from the bowcaster)",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154253870428912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "Hmm. I'm not sure if my spoiler hiding still works the way fb displays. Let me rearrange that.",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154253871728912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "+1 sa incompetent",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154253881573912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "Hmm, I get mixed feels on not-so-competen t Ren. Kinda feel like, if he's that so-so, hopefully we see other darksiders in the next movies, but most likely he'll be supposed to suddenly be boosted from 'completing his training.'    Like, in ep. 4, Luke is trained just enough to touch the Force, and he uses it to be super-pilot. But even after training with Yoda in 5, Vader manhandles him and easily chops his hand off. Actually, not sure what the canon says, but my headcanon is that Luke was on Dagobah for weeks while Han and Leia were fixing the Falcon and then waiting around while Lando gave them the runaround  =P    So, Ren being the only apprentice of Snoke we see (another minor quibble: kind of a lousy name) is a bit underwhelming given that total zero training Rey gets force visions from just touching a lightsaber and can instantly handle herself. Even with the wounded KR.",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154254150738912",
        "poster": "Mark Timothy Agarrado",
        "poster_url": "/magarrado?__tn__=R",
        "text": "Well he's not yet a Darth, so the fight was mostly between two force n00bs. My headcanon of Rey's affinity to the force is that maybe she's already started Jedi training with Luke at a very young age. Then KR went batshit crazy - halting Luke's next-gen Jedi training and forces him into hiding.    At least that's what went through my head when the visions/ flashbacks were shown. But yeah - considering KR has enough skill with the Force to stop a freakin' blaster shot - it's a bit hard to reconcile. Even with his injury. Haha.",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154254153868912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "Oh yeah, the stopped blaster shot. That was terrible. It should have flickered out soon after he stopped it. The only way that makes scifi sense the way it's shown is that Ren can create bubbles of stopped time.",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154254392058912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Grabe, we should stop. Looks like FB still shows a preview even if it's replies to a subthread. Baka may naspoil na tayo  :p",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154254650328912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": "Ur, fb and its random changes to visibility.... They should add spoiler tags that let people hide stuff until clicked on....",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154255176708912",
        "poster": "Jonathan Sahagun",
        "poster_url": "/aj.sahagun?__tn__=R",
        "text": "<spoiler>  .  .  .    On stopped blaster shot: If it was a projectile made of some sort of highly energized matter, then maybe it could have made sense?    About Kylo Ren: I guess his behaviour was pretty spot on for a Dark Side noob -- super emo with episodes of uncontrolled anger.",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154255220388912",
        "poster": "Joy Reyes-Madamba",
        "poster_url": "/joyapreyes?__tn__=R",
        "text": "It's possible that Rey had training as a kid. Medyo malaki na sya nung iniwan sya sa Jakku and some Jedi get trained very early di ba?",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154255282058912",
        "poster": "Joy Reyes-Madamba",
        "poster_url": "/joyapreyes?__tn__=R",
        "text": "Or, just a thought, maybe her use of the Force is electromechanic al in nature? She used her early training to learn what to scavenge and survive in Jakku, which kinda honed her use of the Force? (I wish I had that ability  😊 )",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154255305543912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "Joy Reyes-Madamba  oooh. a technopath.",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154255309123912",
        "poster": "Joy Reyes-Madamba",
        "poster_url": "/joyapreyes?__tn__=R",
        "text": "( Wes  I'm assuming napanood mo na hehe) That could explain how she knows her way around anything technical.",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154255330623912",
        "poster": "David Ramirez",
        "poster_url": "/profile.php?id=827533990&__tn__=R",
        "text": ":  :  :  :  :  :  :  I was thinking more than just tech touch. I was thinking psychometry at a really high level, like not just getting memories out of touching objects, but also skills. Like the (oh he's not blind, just frail) guy, Kaos, in Alita. It would also allow her to self educate just from touching things.    I think of the blaster bolts as plasma, so while the stopped blast could still have energy for a while, it ought to have rapidly flickered away as it lost energy to the atmosphere. So, sf think: stopped time, or he contained its energy perfectly without losing any while he was stalking around and talking.",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      },
      {
        "id": "10154255361028912",
        "poster": "Dominic Ortega",
        "poster_url": "/dominic.ortega.758?__tn__=R",
        "text": "Annoying Orange is a character in Star Wars. Well, the voice isn't annoying anymore.",
        "attachments": [],
        "date": "Dec 18, 2015",
        "replyto": "10154253852683912"
      }
    ]
  }
}