{
  "id": "d07a43e0-f10a-44ec-8fb6-63b7374d66f4",
  "name": "Roy Tang",
  "url": "https://www.facebook.com/stephen.roy.tang",
  "text": "As soon as a determination is made that they are doing something illegal and morally wrong, I have no concern with meting them the punishment that society deems is acceptable (even if I dont personally agree with the punishment, ie death penalty).     And in any modern society, the processes for vetting them in order to make that determination includes both the due process of the courts and a respect for human rights. Those processes exist not only to protect the guilty, but the innocent as well. So it is also in my own self-interest to defend the concept of human rights, since if I&#x27;m ever put in a position where people would suspect me of doing something illegal and morally wrong, human rights and due process would protect me as well.",
  "date": "2017-02-01 00:03:24",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10155329397348912#10155330084953912",
  "source_obj": {
    "id": "10155330084953912",
    "poster": "Roy Tang",
    "poster_url": "/stephen.roy.tang?__tn__=R",
    "text": "As soon as a determination is made that they are doing something illegal and morally wrong, I have no concern with meting them the punishment that society deems is acceptable (even if I dont personally agree with the punishment, ie death penalty).     And in any modern society, the processes for vetting them in order to make that determination includes both the due process of the courts and a respect for human rights. Those processes exist not only to protect the guilty, but the innocent as well. So it is also in my own self-interest to defend the concept of human rights, since if I'm ever put in a position where people would suspect me of doing something illegal and morally wrong, human rights and due process would protect me as well.",
    "attachments": [],
    "date": "Feb 1, 2017",
    "replyto": "10155330045413912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10155329397348912#10155330045413912"
}