{
  "id": "a66128de-afc2-48dc-8506-b4d64a1bd322",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "Di ba?  I don&#x27;t think anyone objects to Leni as VP.  Pwedeng may iba silang kandidato, pero hindi end of the world for anyone pag nanalo si Robredo.    Now, sa mga Presidentiables , maraming objections kay Duterte, this post highlighting one of them.  Maraming objections kay Mar and his teka-teka style.  Maraming objections kay Poe na Amerikano, at kay Binay na corrupt.    Ano ang objectiion kay Miriam?  Certainly not her academic achievements.  Not her experience in the 3  branches of government, and in the international sphere.  Not the fact that she has taught thousand of students and authored thousands of bills.    Ang masasabi mo lang na masama sa kanya, may sakit sya, baka hindi nya matapos term nya.  In which case, kesa mag-abstain for Pres and Robredo for VP, eh di boto mo na lang si MDS for Pres and Leni for VP.  That way, you either have MDS as President, or she dies and Robredo assumes the Presidency.      Let&#x27;s face it: in the Consti, the VP&#x27;s one job is to wait for the death or incapacity of the President.  She can decline all cabinet positions, and it&#x27;s not like in the States where the VP is the the Senate President also.  Dito, walang trabaho ang VP pag di sya tumanggap ng cabinet position.    At kahit ayaw mo din talaga kay Miriam, ang masasabi ko lang, si Miriam may sakit, yung 4 na kalaban nya, ewan ko lang, alam mo naman ang masamang damo, baka never na mamatay mga yun.    So, elect Miriam.  Again, her one failing is that she may die soon.  If she doesn&#x27;t, we&#x27;ll have a seasoned politician.  If she does, though, then that thrusts VP Robredo into the Presidency, and isn&#x27;t that what we really want?",
  "date": "2016-04-20 00:11:41",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154541937978912#10154544137393912",
  "source_obj": {
    "id": "10154544137393912",
    "poster": "Weng Santos",
    "poster_url": "/weng.santos.9?__tn__=R",
    "text": "Di ba?  I don't think anyone objects to Leni as VP.  Pwedeng may iba silang kandidato, pero hindi end of the world for anyone pag nanalo si Robredo.    Now, sa mga Presidentiables , maraming objections kay Duterte, this post highlighting one of them.  Maraming objections kay Mar and his teka-teka style.  Maraming objections kay Poe na Amerikano, at kay Binay na corrupt.    Ano ang objectiion kay Miriam?  Certainly not her academic achievements.  Not her experience in the 3  branches of government, and in the international sphere.  Not the fact that she has taught thousand of students and authored thousands of bills.    Ang masasabi mo lang na masama sa kanya, may sakit sya, baka hindi nya matapos term nya.  In which case, kesa mag-abstain for Pres and Robredo for VP, eh di boto mo na lang si MDS for Pres and Leni for VP.  That way, you either have MDS as President, or she dies and Robredo assumes the Presidency.      Let's face it: in the Consti, the VP's one job is to wait for the death or incapacity of the President.  She can decline all cabinet positions, and it's not like in the States where the VP is the the Senate President also.  Dito, walang trabaho ang VP pag di sya tumanggap ng cabinet position.    At kahit ayaw mo din talaga kay Miriam, ang masasabi ko lang, si Miriam may sakit, yung 4 na kalaban nya, ewan ko lang, alam mo naman ang masamang damo, baka never na mamatay mga yun.    So, elect Miriam.  Again, her one failing is that she may die soon.  If she doesn't, we'll have a seasoned politician.  If she does, though, then that thrusts VP Robredo into the Presidency, and isn't that what we really want?",
    "attachments": [],
    "date": "Apr 20, 2016",
    "replyto": "10154544126473912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10154541937978912#10154544126473912"
}