{
  "id": "950bc7ee-29da-4f5a-a7f7-fbdca402120e",
  "name": "Roy Tang",
  "url": "https://www.facebook.com/stephen.roy.tang",
  "text": "Okay, here we go. Re: form and substance, it actually feels to me a bit like the opposite. His statement could technically be considered an apology I guess, it kind of takes the form of an apology: the word sorry is there after all. But yung substance is lacking. He displays no remorse for it, no understanding of why his words were a problem. He further trivializes rape in the same interview by calling a rival candidate unrapeable and implying ganyan talaga magsalita mga lalaki lalo sa mga mahihirap (kawawa naman mga mahihirap parati na lang nastereotype). It feels like a half-assed apology at best. You know how when you&#x27;re a kid and you do something bad but you don&#x27;t understand why it&#x27;s bad except all the adults are telling you that you should say sorry, so you say sorry kasi sabi nila e? That&#x27;s what it feels like for me.    To put another way: There&#x27;s currently a controversy with the LP about giving out envelopes or such during campaign rallies. How would you feel if Roxas made a statement like &quot;I am sorry in general. I am sorry for the Filipino people. It is our style, ganyan talaga ang rallies namin&quot;, would you feel satisfied by that statement? Would it feel like a sincere apology? I&#x27;m sure many supporters of your candidate would jump at that statement.    Anyway, if you consider that already an apology then more power to you. I already posted above what I think (for me) an acceptable response would have been. Even half that might have been okay. But that&#x27;s fine, I don&#x27;t expect or want him to make any further statement. I&#x27;ve accepted that he is who he is (as I&#x27;m sure you have as well). This post was mostly geared towards the supporters who seem to feel like no apology at all is necessary. Seriously, one of your fellow supporters made a post leading with &quot;NO APPOLOGIES&quot; (typo included). Madami ding post from supporters saying ok lang kasi kesyo pinatay naman nya yung mga criminal, etc, as if that makes everything better.     People need to understand why those words were a problem and why an apology would be necessary and why people should not be thinking like that.",
  "date": "2016-04-18 00:05:11",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154541937978912#10154542235593912",
  "source_obj": {
    "id": "10154542235593912",
    "poster": "Roy Tang",
    "poster_url": "/stephen.roy.tang?__tn__=R",
    "text": "Okay, here we go. Re: form and substance, it actually feels to me a bit like the opposite. His statement could technically be considered an apology I guess, it kind of takes the form of an apology: the word sorry is there after all. But yung substance is lacking. He displays no remorse for it, no understanding of why his words were a problem. He further trivializes rape in the same interview by calling a rival candidate unrapeable and implying ganyan talaga magsalita mga lalaki lalo sa mga mahihirap (kawawa naman mga mahihirap parati na lang nastereotype). It feels like a half-assed apology at best. You know how when you're a kid and you do something bad but you don't understand why it's bad except all the adults are telling you that you should say sorry, so you say sorry kasi sabi nila e? That's what it feels like for me.    To put another way: There's currently a controversy with the LP about giving out envelopes or such during campaign rallies. How would you feel if Roxas made a statement like \"I am sorry in general. I am sorry for the Filipino people. It is our style, ganyan talaga ang rallies namin\", would you feel satisfied by that statement? Would it feel like a sincere apology? I'm sure many supporters of your candidate would jump at that statement.    Anyway, if you consider that already an apology then more power to you. I already posted above what I think (for me) an acceptable response would have been. Even half that might have been okay. But that's fine, I don't expect or want him to make any further statement. I've accepted that he is who he is (as I'm sure you have as well). This post was mostly geared towards the supporters who seem to feel like no apology at all is necessary. Seriously, one of your fellow supporters made a post leading with \"NO APPOLOGIES\" (typo included). Madami ding post from supporters saying ok lang kasi kesyo pinatay naman nya yung mga criminal, etc, as if that makes everything better.     People need to understand why those words were a problem and why an apology would be necessary and why people should not be thinking like that.",
    "attachments": [],
    "date": "Apr 18, 2016",
    "replyto": "10154542012048912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10154541937978912#10154542209463912"
}