{
  "id": "3e8b1563-4d8c-4d5f-9acc-1202b77461b3",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "Maoi said it.  Ours is a democratic country that is proliferated by kingmakers.    BBM has machinery on the ground.  This is important for MDS, given her limited capacity to campaign.  Nobody campaigns successfully without logistics.  Sad but true.    Anyway, the choice of running mate is not that important in RP politics, because the P and VP are elected independently of each other.  I guess the moral issue is what&#x27;s making people think twice, but GPL has Cojuangco and Ang, Binay has the Makati Taxpayer&#x27;s money in his pocket, Duterte has rabid supporters, and Mar is an Araneta with the biggest party backing him up.  MDS needs resources; BBM is the only VP aspirant who has them and is not running with anybody else.    OR, maybe, MDS believes that it&#x27;s time to separate BBM from FEM.  While it&#x27;s true that BBM was not a kid when martial law happened and to this day he is the executor of the Marcos estate which is involved in pending litigations in court, the biggest objection to BBM, apart from the &quot;thievery&quot; cases which are pending in court, is FEM&#x27;s martial law reign.  But under the 1987 Constitution, it is impossible now to call for general martial law without the concurrence of Congress, and without a judicial review of the factual necessity of martial law by the SC.",
  "date": "2016-04-20 00:12:02",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154541937978912#10154546567368912",
  "source_obj": {
    "id": "10154546567368912",
    "poster": "Weng Santos",
    "poster_url": "/weng.santos.9?__tn__=R",
    "text": "Maoi said it.  Ours is a democratic country that is proliferated by kingmakers.    BBM has machinery on the ground.  This is important for MDS, given her limited capacity to campaign.  Nobody campaigns successfully without logistics.  Sad but true.    Anyway, the choice of running mate is not that important in RP politics, because the P and VP are elected independently of each other.  I guess the moral issue is what's making people think twice, but GPL has Cojuangco and Ang, Binay has the Makati Taxpayer's money in his pocket, Duterte has rabid supporters, and Mar is an Araneta with the biggest party backing him up.  MDS needs resources; BBM is the only VP aspirant who has them and is not running with anybody else.    OR, maybe, MDS believes that it's time to separate BBM from FEM.  While it's true that BBM was not a kid when martial law happened and to this day he is the executor of the Marcos estate which is involved in pending litigations in court, the biggest objection to BBM, apart from the \"thievery\" cases which are pending in court, is FEM's martial law reign.  But under the 1987 Constitution, it is impossible now to call for general martial law without the concurrence of Congress, and without a judicial review of the factual necessity of martial law by the SC.",
    "attachments": [],
    "date": "Apr 20, 2016",
    "replyto": "10154544126473912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10154541937978912#10154544126473912"
}