{
  "id": "a5665e30-29c0-4bc6-9c78-60aef1c8b5f5",
  "name": "Cats Calunsod",
  "url": "https://www.facebook.com/catherine.calunsod",
  "text": "I actually agree to what she said.. I couldn&#x27;t care less about his personal life, i didn&#x27;t think it was a problem na babaero sha, lasinggero, goons or what not. I couldn&#x27;t care less if he isn&#x27;t religious or uses God in his speeches. (I am actually very wary of people who use God in their proclamations and speeches) Because i wanted to vote for him before! I wanted him to wipe out all those bad guys- and that&#x27;s just me with wishful thinking. I am now scared of what he stands for, and how people look up to him no matter how wrong he is. Because, HE might have the best intentions, HE might just use the excuse that lalaki lang sha kaya ganyan sha magsalita, HE might be the savior that the Philippines is looking for.. But what about the rest who defend him? Ok lang yun? Hindi pwede mag sorry? Lalaki lang ako, uy maganda rapeable, etc? He can do all the good in the world, and he can also say sorry for his shortcomings. But by saying he isn&#x27;t sorry just perpetuates that culture, and i&#x27;m scared of those people who can just let that pass. Because, no matter how good his intentions are, how about the intentions of the others who think that way too?",
  "date": "2016-04-18 00:06:41",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154541937978912#10154542363623912",
  "source_obj": {
    "id": "10154542363623912",
    "poster": "Cats Calunsod",
    "poster_url": "/catherine.calunsod?__tn__=R",
    "text": "I actually agree to what she said.. I couldn't care less about his personal life, i didn't think it was a problem na babaero sha, lasinggero, goons or what not. I couldn't care less if he isn't religious or uses God in his speeches. (I am actually very wary of people who use God in their proclamations and speeches) Because i wanted to vote for him before! I wanted him to wipe out all those bad guys- and that's just me with wishful thinking. I am now scared of what he stands for, and how people look up to him no matter how wrong he is. Because, HE might have the best intentions, HE might just use the excuse that lalaki lang sha kaya ganyan sha magsalita, HE might be the savior that the Philippines is looking for.. But what about the rest who defend him? Ok lang yun? Hindi pwede mag sorry? Lalaki lang ako, uy maganda rapeable, etc? He can do all the good in the world, and he can also say sorry for his shortcomings. But by saying he isn't sorry just perpetuates that culture, and i'm scared of those people who can just let that pass. Because, no matter how good his intentions are, how about the intentions of the others who think that way too?",
    "attachments": [],
    "date": "Apr 18, 2016",
    "replyto": "10154542332893912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10154541937978912#10154542340318912"
}