{
  "id": "2cce3ba8-14fd-4194-806e-c774cbc61e47",
  "name": "Cats Calunsod",
  "url": "https://www.facebook.com/catherine.calunsod",
  "text": "People defending that comment really made my skin crawl. Like you said, pwede naman mag sorry. But he didn&#x27;t and his supporters don&#x27;t seem to be sorry about it either. And that what makes me suddenly scared. I could easily believe all that he has done for davao, i also believe that he truly wants to get rid of crime and criminals.. But you really have to think about what he is also and what he stands for, and you get to see how his mind really works with his comments.. And for me that makes him a dangerous person. Not because that he might do good for this country, and really, i&#x27;m coming this close to believing that he might be the one to actually put everyone in order (coz like you, i don&#x27;t mind if he wipes out the rest of the rapists and pedophiles and psychopaths and killers) but seeing his supporters defend him on his every flaw makes me scared of the general mindset of the people who want him to be president. (Do they think that way too? Sayang Maganda to, dapat nauna nalang ako dito..? ) pwede naman mag sorry...",
  "date": "2016-04-18 00:00:04",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154541937978912#10154542332893912",
  "source_obj": {
    "id": "10154542332893912",
    "poster": "Cats Calunsod",
    "poster_url": "/catherine.calunsod?refid=52&_ft_=mf_story_key.10154541937978912%3Atop_level_post_id.10154541937978912%3Atl_objid.10154541937978912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10154541937978912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "People defending that comment really made my skin crawl. Like you said, pwede naman mag sorry. But he didn't and his supporters don't seem to be sorry about it either. And that what makes me suddenly scared. I could easily believe all that he has done for davao, i also believe that he truly wants to get rid of crime and criminals.. But you really have to think about what he is also and what he stands for, and you get to see how his mind really works with his comments.. And for me that makes him a dangerous person. Not because that he might do good for this country, and really, i'm coming this close to believing that he might be the one to actually put everyone in order (coz like you, i don't mind if he wipes out the rest of the rapists and pedophiles and psychopaths and killers) but seeing his supporters defend him on his every flaw makes me scared of the general mindset of the people who want him to be president. (Do they think that way too? Sayang Maganda to, dapat nauna nalang ako dito..? ) pwede naman mag sorry...",
    "attachments": [],
    "date": "Apr 18, 2016",
    "replies": [
      {
        "id": "10154542340318912",
        "poster": "Nick Solana",
        "poster_url": "/nicksolana?__tn__=R",
        "text": "here's a perspective:  https://web.facebook.com/zayapono/posts/10209323149614895?pnref=story",
        "attachments": [],
        "date": "Apr 18, 2016",
        "replyto": "10154542332893912"
      },
      {
        "id": "10154542363623912",
        "poster": "Cats Calunsod",
        "poster_url": "/catherine.calunsod?__tn__=R",
        "text": "I actually agree to what she said.. I couldn't care less about his personal life, i didn't think it was a problem na babaero sha, lasinggero, goons or what not. I couldn't care less if he isn't religious or uses God in his speeches. (I am actually very wary of people who use God in their proclamations and speeches) Because i wanted to vote for him before! I wanted him to wipe out all those bad guys- and that's just me with wishful thinking. I am now scared of what he stands for, and how people look up to him no matter how wrong he is. Because, HE might have the best intentions, HE might just use the excuse that lalaki lang sha kaya ganyan sha magsalita, HE might be the savior that the Philippines is looking for.. But what about the rest who defend him? Ok lang yun? Hindi pwede mag sorry? Lalaki lang ako, uy maganda rapeable, etc? He can do all the good in the world, and he can also say sorry for his shortcomings. But by saying he isn't sorry just perpetuates that culture, and i'm scared of those people who can just let that pass. Because, no matter how good his intentions are, how about the intentions of the others who think that way too?",
        "attachments": [],
        "date": "Apr 18, 2016",
        "replyto": "10154542332893912"
      }
    ]
  }
}