{
  "id": "9fb93d79-03cb-40eb-ad56-5c627faf8318",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "Boto na lang natin si Robredo, tapos pagdasal na mamatay sino man ang Presidente.  Or boto natin si Miriam na Presidente, tutal ang objection naman sa kanya is her health and longevity.  If the objection holds true, the reward is a Robredo presidency.",
  "date": "2016-04-19 00:00:06",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154541937978912#10154544126473912",
  "source_obj": {
    "id": "10154544126473912",
    "poster": "Weng Santos",
    "poster_url": "/weng.santos.9?refid=52&_ft_=mf_story_key.10154541937978912%3Atop_level_post_id.10154541937978912%3Atl_objid.10154541937978912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10154541937978912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Boto na lang natin si Robredo, tapos pagdasal na mamatay sino man ang Presidente.  Or boto natin si Miriam na Presidente, tutal ang objection naman sa kanya is her health and longevity.  If the objection holds true, the reward is a Robredo presidency.",
    "attachments": [],
    "date": "Apr 19, 2016",
    "replies": [
      {
        "id": "10154544126763912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Lol, ang galing mo mangampanya ah, binaliktad mo yung disadvantage",
        "attachments": [],
        "date": "Apr 19, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154544137393912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Di ba?  I don't think anyone objects to Leni as VP.  Pwedeng may iba silang kandidato, pero hindi end of the world for anyone pag nanalo si Robredo.    Now, sa mga Presidentiables , maraming objections kay Duterte, this post highlighting one of them.  Maraming objections kay Mar and his teka-teka style.  Maraming objections kay Poe na Amerikano, at kay Binay na corrupt.    Ano ang objectiion kay Miriam?  Certainly not her academic achievements.  Not her experience in the 3  branches of government, and in the international sphere.  Not the fact that she has taught thousand of students and authored thousands of bills.    Ang masasabi mo lang na masama sa kanya, may sakit sya, baka hindi nya matapos term nya.  In which case, kesa mag-abstain for Pres and Robredo for VP, eh di boto mo na lang si MDS for Pres and Leni for VP.  That way, you either have MDS as President, or she dies and Robredo assumes the Presidency.      Let's face it: in the Consti, the VP's one job is to wait for the death or incapacity of the President.  She can decline all cabinet positions, and it's not like in the States where the VP is the the Senate President also.  Dito, walang trabaho ang VP pag di sya tumanggap ng cabinet position.    At kahit ayaw mo din talaga kay Miriam, ang masasabi ko lang, si Miriam may sakit, yung 4 na kalaban nya, ewan ko lang, alam mo naman ang masamang damo, baka never na mamatay mga yun.    So, elect Miriam.  Again, her one failing is that she may die soon.  If she doesn't, we'll have a seasoned politician.  If she does, though, then that thrusts VP Robredo into the Presidency, and isn't that what we really want?",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154544171663912",
        "poster": "Chang Ronque",
        "poster_url": "/chang.ronque?__tn__=R",
        "text": "Pwede!",
        "attachments": [],
        "date": "Apr 19, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154545268543912",
        "poster": "Ruby Davo",
        "poster_url": "/ruby.davo.3?__tn__=R",
        "text": "Sa totoo lang  Weng  naisip ko din yan hahahaha",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154545892278912",
        "poster": "Arthur Abon",
        "poster_url": "/arthur.abon?__tn__=R",
        "text": "Tama na  Weng  nako-convince mo na ko! Hahaha.",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154545913268912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "health...    ... and choice of allies. delikado din yun.",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154545933588912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "But ang running mate nya, si BBM.  Na by vote din lang makakapwesto, at hindi pwedeng i-appoint for 1 year, and whoesever she appoints will need the agreement of the Commission on Appointments (who are lawmakers, mostly), so this means also na ang labanan talaga ay sa choice of senators  =)",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154545937043912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "I dont think she's even benefitting from the \"alliance\" with BBM, never naman sya prinopromote nun. At this stage flipping on him would probably earn her more votes than she loses",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154545937698912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "di lang appointees. yung mga kakampihan niya din pagdating ng panahon. medyo may history siya dun. staunch ally, oo. pero yari tayo pag may maling kinampihan.",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154545944443912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Well, ang masasabi ko lang dyan, every candidate here has allies we don't like.  In voting for MDS, for me kasi sya yung least objectionable, unlike kay Robredo na for me sya ang most qualified.",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154545970083912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "may time na kinampanya ko din yang MirLeni.",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546051378912",
        "poster": "Leah Aguirre",
        "poster_url": "/leahaguirre?__tn__=R",
        "text": "So far, this is my combo.",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546539203912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Malapit mo na ako makumbinsi Wynner. Ginagamitan mo ata ako ng lawyer tricks di ko napapansin lol",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546539293912",
        "poster": "Maoi Arroyo",
        "poster_url": "/maoi.arroyo?__tn__=R",
        "text": "Hmmm. Or we could elect Leni and assassinate the President. Hahahaha.  :D",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546548288912",
        "poster": "Oliver Quiray",
        "poster_url": "/oliver.quiray?__tn__=R",
        "text": "jokes are always half-meant, hahaha",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546550338912",
        "poster": "Joy Reyes-Madamba",
        "poster_url": "/joyapreyes?__tn__=R",
        "text": "Question still remains why she chose BBM as VP. If it was money, then she might be offered it again when she becomes president and who knows what she will have to do if she accepts. If it was for popularity (she gets voted by Marcos loyalists), would that mean she would be indebted to the Marcoses for her win and again, what would she need to do for them when she becomes President?",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546556718912",
        "poster": "Maoi Arroyo",
        "poster_url": "/maoi.arroyo?__tn__=R",
        "text": "Remind me to tell you the real way this country works next time we see each other  Joy Reyes-Madamba . It's quite elegant in a Game of Thrones way. Haha. Sigh.  # BayanKo",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546557753912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "But Maoi, haven't you heard? Change is coming!",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546559138912",
        "poster": "Arthur Abon",
        "poster_url": "/arthur.abon?__tn__=R",
        "text": "Maoi Arroyo  , in that case lets vote Binay haha",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546559288912",
        "poster": "Maoi Arroyo",
        "poster_url": "/maoi.arroyo?__tn__=R",
        "text": "Roy Tang  yes Whether we like it or else.",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546559818912",
        "poster": "Joy Reyes-Madamba",
        "poster_url": "/joyapreyes?__tn__=R",
        "text": "Maoi  if it's in a Game of Thrones way then I'm definitely not voting for Miriam haha (I don't watch the series BTW, I just read the books which is kinda worse  :P )",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546560893912",
        "poster": "Maoi Arroyo",
        "poster_url": "/maoi.arroyo?__tn__=R",
        "text": "Joy Reyes-Madamba  the series is pretty faithful to the books.  :)",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546567368912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "Maoi said it.  Ours is a democratic country that is proliferated by kingmakers.    BBM has machinery on the ground.  This is important for MDS, given her limited capacity to campaign.  Nobody campaigns successfully without logistics.  Sad but true.    Anyway, the choice of running mate is not that important in RP politics, because the P and VP are elected independently of each other.  I guess the moral issue is what's making people think twice, but GPL has Cojuangco and Ang, Binay has the Makati Taxpayer's money in his pocket, Duterte has rabid supporters, and Mar is an Araneta with the biggest party backing him up.  MDS needs resources; BBM is the only VP aspirant who has them and is not running with anybody else.    OR, maybe, MDS believes that it's time to separate BBM from FEM.  While it's true that BBM was not a kid when martial law happened and to this day he is the executor of the Marcos estate which is involved in pending litigations in court, the biggest objection to BBM, apart from the \"thievery\" cases which are pending in court, is FEM's martial law reign.  But under the 1987 Constitution, it is impossible now to call for general martial law without the concurrence of Congress, and without a judicial review of the factual necessity of martial law by the SC.",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546575448912",
        "poster": "Joy Reyes-Madamba",
        "poster_url": "/joyapreyes?__tn__=R",
        "text": "Exaclty, Miriam needs/needed the resources. What would she need to do in return?  It would be hard to separate BBM from FEM for the reason you mentioned, he is the executor of the Marcos estate, which means he's still holding (and most probably using!) the money they stole from the Filipinos. There's evidence that they have no plans of giving it back (e.g. US Supreme Court contempt ruling if I am correct) so no, I don't think anyone should separate BBM from the FEM issue.",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546587658912",
        "poster": "Maoi Arroyo",
        "poster_url": "/maoi.arroyo?__tn__=R",
        "text": "Weng Santos  analysis is accurate to what I am willing to say in public.  :)",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546593453912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "That's just one case.  There are actually many pending cases in local courts, which BBM has the duty to oppose as the executor of the estate (the executor's qualifications requires faithfulness to the estate, in the face of claims, especially given our adversarial system of proceedings).      So it's a legal matter, and the prosecution must make its cases through evidence, just like any legal matter.  That's due process.  Unfortunately, I've personal knowledge of some cases where the PCGG / OSG has miserably failed at meeting their burden of proof, or worse, where cases have been pending for 30 years without even making it to pro-trial, because of course, it's a Marcos case and nobody wants to dismiss, even if the prosecution cannot produce any evidence whatsoever.      I mean, gusto ko naman makakuha sila at maibalik sa taongbayan, pero pano naman?  Nagagalit actually ako bilang mamamayan na pinapasweldo natin yang mga yan, PCGG at OSG, tapos ganyan, they lose in court, or they win innocuously.  You know they even asked BBM na, to show his earnest bid for higher office, that he ask all his lawyers to withdraw every pending motion or opposition filed in court?  That's an admission that they can't win a fair fight, that they are asking someone to waive the \"non-waiveable\"  constitutional right to due process.    As for what MDS must do in return, I honestly don't know.  But nobody gets anything for free in this world.  Maybe, though, having MDS as running mate is enough recompense for BBM.  Let's face it, without MDS, it's all anti-Marcos.  With MDS, he gets in on conversations like these, where even a non-supporter (aka ME) is forced to defend his right to fairness.",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546595793912",
        "poster": "Weng Santos",
        "poster_url": "/weng.santos.9?__tn__=R",
        "text": "But to be clear, Miriam-Leni ako hahaha.  My mind is set.",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546596153912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Meron palang things that  Maoi Arroyo  won't say in public haha",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546597033912",
        "poster": "Maoi Arroyo",
        "poster_url": "/maoi.arroyo?__tn__=R",
        "text": "Oh Roy, you have no idea.  :)",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546598508912",
        "poster": "Joy Reyes-Madamba",
        "poster_url": "/joyapreyes?__tn__=R",
        "text": "Ply her with Scotch, maybe she'll change her mind  :D",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546599738912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Mag guest ka sa podcast namin ni  Wes Platon , baka mapa-spill ka namin lol",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154546606068912",
        "poster": "Wes Platon",
        "poster_url": "/wesplaton?__tn__=R",
        "text": "podcast na to. bago mag election.",
        "attachments": [],
        "date": "Apr 20, 2016",
        "replyto": "10154544126473912"
      },
      {
        "id": "10154547572708912",
        "poster": "Maoi Arroyo",
        "poster_url": "/maoi.arroyo?__tn__=R",
        "text": "No sorry. Evem with scotch there are things i will not say in public.",
        "attachments": [],
        "date": "Apr 21, 2016",
        "replyto": "10154544126473912"
      }
    ]
  }
}