{
  "id": "43a318cd-dfec-4f07-b530-0a1debd77c15",
  "name": "Weng Santos",
  "url": "https://www.facebook.com/weng.santos.9",
  "text": "That&#x27;s just one case.  There are actually many pending cases in local courts, which BBM has the duty to oppose as the executor of the estate (the executor&#x27;s qualifications requires faithfulness to the estate, in the face of claims, especially given our adversarial system of proceedings).      So it&#x27;s a legal matter, and the prosecution must make its cases through evidence, just like any legal matter.  That&#x27;s due process.  Unfortunately, I&#x27;ve personal knowledge of some cases where the PCGG / OSG has miserably failed at meeting their burden of proof, or worse, where cases have been pending for 30 years without even making it to pro-trial, because of course, it&#x27;s a Marcos case and nobody wants to dismiss, even if the prosecution cannot produce any evidence whatsoever.      I mean, gusto ko naman makakuha sila at maibalik sa taongbayan, pero pano naman?  Nagagalit actually ako bilang mamamayan na pinapasweldo natin yang mga yan, PCGG at OSG, tapos ganyan, they lose in court, or they win innocuously.  You know they even asked BBM na, to show his earnest bid for higher office, that he ask all his lawyers to withdraw every pending motion or opposition filed in court?  That&#x27;s an admission that they can&#x27;t win a fair fight, that they are asking someone to waive the &quot;non-waiveable&quot;  constitutional right to due process.    As for what MDS must do in return, I honestly don&#x27;t know.  But nobody gets anything for free in this world.  Maybe, though, having MDS as running mate is enough recompense for BBM.  Let&#x27;s face it, without MDS, it&#x27;s all anti-Marcos.  With MDS, he gets in on conversations like these, where even a non-supporter (aka ME) is forced to defend his right to fairness.",
  "date": "2016-04-20 00:10:25",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154541937978912#10154546593453912",
  "source_obj": {
    "id": "10154546593453912",
    "poster": "Weng Santos",
    "poster_url": "/weng.santos.9?__tn__=R",
    "text": "That's just one case.  There are actually many pending cases in local courts, which BBM has the duty to oppose as the executor of the estate (the executor's qualifications requires faithfulness to the estate, in the face of claims, especially given our adversarial system of proceedings).      So it's a legal matter, and the prosecution must make its cases through evidence, just like any legal matter.  That's due process.  Unfortunately, I've personal knowledge of some cases where the PCGG / OSG has miserably failed at meeting their burden of proof, or worse, where cases have been pending for 30 years without even making it to pro-trial, because of course, it's a Marcos case and nobody wants to dismiss, even if the prosecution cannot produce any evidence whatsoever.      I mean, gusto ko naman makakuha sila at maibalik sa taongbayan, pero pano naman?  Nagagalit actually ako bilang mamamayan na pinapasweldo natin yang mga yan, PCGG at OSG, tapos ganyan, they lose in court, or they win innocuously.  You know they even asked BBM na, to show his earnest bid for higher office, that he ask all his lawyers to withdraw every pending motion or opposition filed in court?  That's an admission that they can't win a fair fight, that they are asking someone to waive the \"non-waiveable\"  constitutional right to due process.    As for what MDS must do in return, I honestly don't know.  But nobody gets anything for free in this world.  Maybe, though, having MDS as running mate is enough recompense for BBM.  Let's face it, without MDS, it's all anti-Marcos.  With MDS, he gets in on conversations like these, where even a non-supporter (aka ME) is forced to defend his right to fairness.",
    "attachments": [],
    "date": "Apr 20, 2016",
    "replyto": "10154544126473912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10154541937978912#10154546587658912"
}