{
  "id": "f35e3630-88a1-4ca5-97ee-0fa0583a6c3f",
  "name": "Roy Tang",
  "url": "https://www.facebook.com/stephen.roy.tang",
  "text": "I am well, thank you for your words.    I guess it depends on what you mean by free. As a nation, we enjoy and freely exercise a number of freedoms that we didn&#x27;t really have or were constrained 116 years ago: freedom of thought, expression, speech, association, assembly, religion, movement are all alive and well in the country (and often abused even). The fact that we are aware of such scams as you mention tells me that not only is freedom of press also alive and well. but the awareness of the citizenry is steadily (if slowly) rising. We still have a lot of problems and many of our institutions need improvements (as can be said of many, if not most other nations in the world), but no one ever said freedom would be easy!",
  "date": "2014-06-12 00:00:01",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10153018420823912#10153019229148912",
  "source_obj": {
    "id": "10153019229148912",
    "poster": "Roy Tang",
    "poster_url": "/stephen.roy.tang?refid=52&_ft_=mf_story_key.10153018420823912%3Atop_level_post_id.10153018420823912%3Atl_objid.10153018420823912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10153018420823912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "I am well, thank you for your words.    I guess it depends on what you mean by free. As a nation, we enjoy and freely exercise a number of freedoms that we didn't really have or were constrained 116 years ago: freedom of thought, expression, speech, association, assembly, religion, movement are all alive and well in the country (and often abused even). The fact that we are aware of such scams as you mention tells me that not only is freedom of press also alive and well. but the awareness of the citizenry is steadily (if slowly) rising. We still have a lot of problems and many of our institutions need improvements (as can be said of many, if not most other nations in the world), but no one ever said freedom would be easy!",
    "attachments": [],
    "date": "Jun 12, 2014"
  }
}