{
  "id": "e46aab23-e664-4ec4-8d88-3ac671801ea2",
  "name": "Roy Tang",
  "url": "https://facebook.com/stephen.roy.tang",
  "text": "Er, so are you implying that there is some sort of vast conspiracy that is able to manipulate international media outlets and human rights organisations, including Amnesty International, Human Rights Watch, and local organisations (CHR, local media) para lang maka-advance sa local politics? Are all these people who have supposedly had their sons killed lying? I'll admit na may biases ako, all people do. One of my biases is called Occam's Razor - it's a much simpler explanation na meron ngang killings na nangyayari under his watch kesa to believe some conspiracy theory that all of these international organisations have been duped by a local politician and have not done any fact checking    You don't need to keep repeating na allegations lang sila, I know what the word means. Allegations din naman yung corruption charges vs Binay, and puro rumors lang yung talk that lahat ng businesses sa Makati have to give him a cut, but that doesn't stop me from holding it against him. Tapos yan din ang depensa nya, politically motivated daw yung mga allegations. At least si Binay nagdedeny ng corruption charges. Si Duterte naman mismo nagsasabi na \"kill all criminals\" ang gusto nya mangyari (citation:  http://newsinfo.inquirer.net/691527/dutertes-secret-in-keeping-davao-city-phs-safest-kill-criminals ).     You want to talk about facts. One of the facts is that he talks as if he condones the killings, he talks as if he's proud of killing 1,700 people. Another fact is that he has supporters who think that he *does* kill criminals and have adopted this mentality, who think that petty criminals don't deserve trials, who think that if you've been wronged you have the right to take the law into your own hands. Another fact is that he has supporters who threaten rape and violence against people who question him. That's not his fault, but he himself likes to put out this tough guy reputation that propagates such a mentality    All people have biases. Kaya nga ako nagbabasa ng mga articles and nagtatanong sa mga pro-Duterte parati, to temper those biases and try to understand the POV of the supporters. I read all the articles the pro-Duterte people post, about how he makes people feel safe and how he personally helps people. I watched the video of his proposed platform of governance. I've read about how people say he's a good man. I've done all this research because as you well know, his accomplishments  and platform are very attractive for a presidential candidate and I want to find a reason to believe. But none of these things I've read on the pro side assuade my concerns about the killings, whether he is involved or even just condoning them.     I'm not claiming to be an HR crusader. I'm not trying to convict him in a court of law. I'm not even trying to convince you not to vote for him. But maybe instead of questioning other people's biases, you might start asking if you have any biases of your own that might be keeping you from being more objective about this situation",
  "date": "2015-12-16 10:54:10 +0800",
  "photo": "",
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154250789438912#10154251141638912#10154251298438912",
  "source": "facebook",
  "spam": false,
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10154250789438912#10154251141638912"
}