{
  "id": "b8298e9d-f3a5-41c4-b8e3-ad956437333a",
  "name": "Luc Valencia",
  "url": "https://www.facebook.com/luc.valencia",
  "text": "Philippines will be another Mexico if DUdirty will be allowed to rule the country. DUdirty&#x27;s policy of fighting crime with vigilante acts can potentially escalate violence and criminality in the same way as the failed policies implemented by President Calderon of Mexico in 2006 and continued until today by President Pena Nieto. Like DUdirty, Calderon and Pena Nieto presidency centerpiece is fighting crime and openly tolerating vigilantism and human rights abuses. Instead of controlling violent crimes, it actually escalated it. In all there are about 60,000 deaths during Calderon&#x27;s 6 year term and 30,000 deaths so far trough Pena Nieto&#x27;s term, not including missing persons who are numbering to tens of thousands as well. Are all those deaths of criminal elements or members of organized crime? Mexican government claims more than 90% are, but in reality, evidence suggest numerous innocent civilians are part of this statistics as well. In addition to this, journalists and human rights activists  were also victims of targeted attacks. At the same time, organized crime groups escalated violence through revenge attacks.  The problem with leaders who tolerate vigilantism and human rights abuses is that they create a culture of impunity: killings, torture, disappearances etc. becomes ok and normal, and hence accepted by society. The scary thing is that the perception that if something happened to you then you must have been involved in some criminal activity - never mind if your are actually innocent. DUdirty style of governance can be effective in LGU scale as you can micromanage and can control individuals who are beholden to your political whims. Apply this style at the national level i.e., with all the corrupt local politicians who will do everything to protect their vested interest and consider their town/city /province as their local fiefdom, then it is a potential catastrophe may be exceeding that of what is happening now in Mexico. Political killings/ human rights abuses will be easily masked - sasabihin lang, &quot;Ay kriminal yan!&quot; Or, &quot;order yan ni DUdirty!&quot; Yan ba gusto mo  Gerard ?",
  "date": "2015-12-10 00:00:09",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154239469608912#10154239736328912",
  "source_obj": {
    "id": "10154239736328912",
    "poster": "Luc Valencia",
    "poster_url": "/luc.valencia?refid=52&_ft_=mf_story_key.10154239469608912%3Atop_level_post_id.10154239469608912%3Atl_objid.10154239469608912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10154239469608912%3Aphoto_id.10154239469193912%3Astory_location.4%3Astory_attachment_style.photo%3Athid.632418911&__tn__=R",
    "text": "Philippines will be another Mexico if DUdirty will be allowed to rule the country. DUdirty's policy of fighting crime with vigilante acts can potentially escalate violence and criminality in the same way as the failed policies implemented by President Calderon of Mexico in 2006 and continued until today by President Pena Nieto. Like DUdirty, Calderon and Pena Nieto presidency centerpiece is fighting crime and openly tolerating vigilantism and human rights abuses. Instead of controlling violent crimes, it actually escalated it. In all there are about 60,000 deaths during Calderon's 6 year term and 30,000 deaths so far trough Pena Nieto's term, not including missing persons who are numbering to tens of thousands as well. Are all those deaths of criminal elements or members of organized crime? Mexican government claims more than 90% are, but in reality, evidence suggest numerous innocent civilians are part of this statistics as well. In addition to this, journalists and human rights activists  were also victims of targeted attacks. At the same time, organized crime groups escalated violence through revenge attacks.  The problem with leaders who tolerate vigilantism and human rights abuses is that they create a culture of impunity: killings, torture, disappearances etc. becomes ok and normal, and hence accepted by society. The scary thing is that the perception that if something happened to you then you must have been involved in some criminal activity - never mind if your are actually innocent. DUdirty style of governance can be effective in LGU scale as you can micromanage and can control individuals who are beholden to your political whims. Apply this style at the national level i.e., with all the corrupt local politicians who will do everything to protect their vested interest and consider their town/city /province as their local fiefdom, then it is a potential catastrophe may be exceeding that of what is happening now in Mexico. Political killings/ human rights abuses will be easily masked - sasabihin lang, \"Ay kriminal yan!\" Or, \"order yan ni DUdirty!\" Yan ba gusto mo  Gerard ?",
    "attachments": [],
    "date": "Dec 10, 2015"
  }
}