{
  "id": "c3815830-d2a6-4354-bdfc-4d3294c617ef",
  "name": "Roy Tang",
  "url": "https://www.facebook.com/stephen.roy.tang",
  "text": "Grabe naman Gerard, we&#x27;ve been through this before. Did you see the bodies of the supposed criminals that were killed? Pwede mag-apply ng critical thinking even without first hand knowledge. Kung ganyan ang logic pano natin ma-criticize ang LP about DAP, wala naman tayong personal knowledge ng bribery, or si Binay about corruption, wala naman tayong personal knowledge sa mga deals nya. Iikot-ikot lang tayo nito e. You keep posting that video, insisting it applies to the killings tapos pag nagcite kami ng reported killings tatanungin mo kung nakita ba namin, which nde naman relevant. Walang mangyayari dito, tulog na lang tayo  :p",
  "date": "2015-12-10 00:00:19",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10154239469608912#10154239902243912",
  "source_obj": {
    "id": "10154239902243912",
    "poster": "Roy Tang",
    "poster_url": "/stephen.roy.tang?refid=52&_ft_=mf_story_key.10154239469608912%3Atop_level_post_id.10154239469608912%3Atl_objid.10154239469608912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10154239469608912%3Aphoto_id.10154239469193912%3Astory_location.4%3Astory_attachment_style.photo%3Athid.632418911&__tn__=R",
    "text": "Grabe naman Gerard, we've been through this before. Did you see the bodies of the supposed criminals that were killed? Pwede mag-apply ng critical thinking even without first hand knowledge. Kung ganyan ang logic pano natin ma-criticize ang LP about DAP, wala naman tayong personal knowledge ng bribery, or si Binay about corruption, wala naman tayong personal knowledge sa mga deals nya. Iikot-ikot lang tayo nito e. You keep posting that video, insisting it applies to the killings tapos pag nagcite kami ng reported killings tatanungin mo kung nakita ba namin, which nde naman relevant. Walang mangyayari dito, tulog na lang tayo  :p",
    "attachments": [],
    "date": "Dec 10, 2015"
  }
}