{
  "id": "04c3ffe3-39cf-40ab-bf87-cfa058d77e04",
  "name": "Jaime L. Garcia",
  "url": "https://www.facebook.com/jaime.l.garcia.779",
  "text": "TIEs aren&#x27;t jump-capable (and must always return to a capital ship if you need them to jump). But yeah... the Falcon, nor Capital ships, nor hijacked luxury cruise vessels seem to need a droid for jumping. (Although I&#x27;m still wondering why the X-wings had to dock prior to jumping in the latest movie...)    The convenient in-joke with droids-replacin g-humans for complex tasks such as soldiering and piloting (See: Separatist army) is that they weren&#x27;t good soldiers / pilots - just cheap. It&#x27;s not that big of a stretch to imagine that the Baktoid Armor Workshop (that sold the droids) from Geonosis probably suffered catastrophic losses in both factory damage and PR for backing the losing side.    Besides PR, I suspect another the in-universe reason to be economics.     I guess it&#x27;s a lot easier to justify a droid mechanic since the task is often fraught with danger, requires a lot of quick calculations and analyses, and may require space ops (which is hazardous to humans without a lifesupport suit).    That said, consistency really isn&#x27;t a Star Wars strength. XD",
  "date": "2017-12-25 00:03:21",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10156287573828912#10156288161133912",
  "source_obj": {
    "id": "10156288161133912",
    "poster": "Jaime L. Garcia",
    "poster_url": "/jaime.l.garcia.779?__tn__=R",
    "text": "TIEs aren't jump-capable (and must always return to a capital ship if you need them to jump). But yeah... the Falcon, nor Capital ships, nor hijacked luxury cruise vessels seem to need a droid for jumping. (Although I'm still wondering why the X-wings had to dock prior to jumping in the latest movie...)    The convenient in-joke with droids-replacin g-humans for complex tasks such as soldiering and piloting (See: Separatist army) is that they weren't good soldiers / pilots - just cheap. It's not that big of a stretch to imagine that the Baktoid Armor Workshop (that sold the droids) from Geonosis probably suffered catastrophic losses in both factory damage and PR for backing the losing side.    Besides PR, I suspect another the in-universe reason to be economics.     I guess it's a lot easier to justify a droid mechanic since the task is often fraught with danger, requires a lot of quick calculations and analyses, and may require space ops (which is hazardous to humans without a lifesupport suit).    That said, consistency really isn't a Star Wars strength. XD",
    "attachments": [],
    "date": "Dec 25, 2017",
    "replyto": "10156287961078912"
  },
  "reply_to": "https://www.facebook.com/stephen.roy.tang/posts/10156287573828912#10156287961078912"
}