{
  "id": "478a4847-fa9d-49e6-9b0a-ef4610647e1e",
  "name": "Jaime L. Garcia",
  "url": "https://www.facebook.com/jaime.l.garcia.779",
  "text": "Don&#x27;t AstroMech droids also calc hyperspace launch trajectories? IIRC, X-Wings are jump capable.",
  "date": "2017-12-25 00:00:01",
  "photo": null,
  "source_url": "https://www.facebook.com/stephen.roy.tang/posts/10156287573828912#10156287961078912",
  "source_obj": {
    "id": "10156287961078912",
    "poster": "Jaime L. Garcia",
    "poster_url": "/jaime.l.garcia.779?refid=52&_ft_=mf_story_key.10156287573828912%3Atop_level_post_id.10156287573828912%3Atl_objid.10156287573828912%3Acontent_owner_id_new.632418911%3Athrowback_story_fbid.10156287573828912%3Astory_location.4%3Athid.632418911&__tn__=R",
    "text": "Don't AstroMech droids also calc hyperspace launch trajectories? IIRC, X-Wings are jump capable.",
    "attachments": [],
    "date": "Dec 25, 2017",
    "replies": [
      {
        "id": "10156288056308912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "I actually didn't remember if BB8 was an astromech, but yeah sure. The list isn't exhaustive. It does make you wonder, why do X-Wings need a droid to do their jump calculations? TIE fighters don't, the Falcon didn't. Star Destroyers aren't shown to need droids for calculations.    Another thing: if they already have the AI communications technology, why are ships like X-Wings and the Falcon and TIE fighters and Star Destroyers piloted manually? Why not by voice command, with feedback in tones and beeps? Or if piloting is too complicated for a computer, why not at least have some simpler functionality like comms handled by droid-like AIs? (Similar to Star Trek)",
        "attachments": [],
        "date": "Dec 25, 2017",
        "replyto": "10156287961078912"
      },
      {
        "id": "10156288161133912",
        "poster": "Jaime L. Garcia",
        "poster_url": "/jaime.l.garcia.779?__tn__=R",
        "text": "TIEs aren't jump-capable (and must always return to a capital ship if you need them to jump). But yeah... the Falcon, nor Capital ships, nor hijacked luxury cruise vessels seem to need a droid for jumping. (Although I'm still wondering why the X-wings had to dock prior to jumping in the latest movie...)    The convenient in-joke with droids-replacin g-humans for complex tasks such as soldiering and piloting (See: Separatist army) is that they weren't good soldiers / pilots - just cheap. It's not that big of a stretch to imagine that the Baktoid Armor Workshop (that sold the droids) from Geonosis probably suffered catastrophic losses in both factory damage and PR for backing the losing side.    Besides PR, I suspect another the in-universe reason to be economics.     I guess it's a lot easier to justify a droid mechanic since the task is often fraught with danger, requires a lot of quick calculations and analyses, and may require space ops (which is hazardous to humans without a lifesupport suit).    That said, consistency really isn't a Star Wars strength. XD",
        "attachments": [],
        "date": "Dec 25, 2017",
        "replyto": "10156287961078912"
      },
      {
        "id": "10156288221453912",
        "poster": "Roy Tang",
        "poster_url": "/stephen.roy.tang?__tn__=R",
        "text": "Merong TIEs that are jump-capable. Notably, Vader's TIE at the battle of yavin was jump capable (allowing him to survive the death star destruction). Also, when Finn and Poe escape in a TIE at the start of TFA, he expects the TIE to be able to jump away from Jakku, IDK if that means First Order TIEs are more advanced in general",
        "attachments": [],
        "date": "Dec 25, 2017",
        "replyto": "10156287961078912"
      },
      {
        "id": "10156288418228912",
        "poster": "Luis Formilleza",
        "poster_url": "/luis.formilleza?__tn__=R",
        "text": "TIE Advanced kay Vader. Also pinacompute lang ata ni Luke kay R2 dahil tinatamad siya",
        "attachments": [],
        "date": "Dec 25, 2017",
        "replyto": "10156287961078912"
      }
    ]
  }
}