{
  "id": "wp-Roy-20060201225700",
  "name": "Roy",
  "url": "http://www.blogger.com/profile/1694272",
  "text": "Eh, I&#39;m fine.\n \n \nI wrote this towards the end of a particularly heavy week. While what I do\neveryday closely approximates what I wrote here, it seldom reaches the stress\nlevels that the essay could imply.\n \n \nIn the case of promotions, your concern is unneeded, as there&#39;s really no such\nthing as a *promotion* in our company which has a flat hierarchy thingy.\nBesides, one of my roles in the current project is Technical Lead, which means\nthat it actually *is* my job to handle technical questions within the project.\n \n \nThe fact that I also handle a good number of technical concerns from *outside*\nthe project is a result of two concepts: mentoring and subject experts; I\ndon&#39;t know how it works in other industries, but typically in software, senior\ndevelopers are expected to mentor junior developers to help them gain\nexperience/knowledge. And there&#39;s a particular reporting tool we use where I&#39;m\nconsidered as the sole &quot;subject expert&quot; on its&#39; use, so almost all technical\nquestions concerning this tool are handled by me.\n \n \nThere are formal procedures for pretty much everything, including sending\nclarifications, and most people will always ask if I&#39;m busy before sending\nsomething my way. But I guess it&#39;s actually my own preference to answer as\nmany clarifs as quickly as I can. I&#39;m also pretty sure that addressing each\nissue as soon as it possibly can is the best way to go; (This is one of the\noverriding philosophies in the Getting Things Done methodology esposed by\nDavid Allen) If I let the questions pile up I&#39;d have a long list of them which\nwould be daunting to go through.\n \n \nIt&#39;s not like I&#39;m doing ten thousand things at once; I at least know how to\nsequence my tasks. If I&#39;m in the middle of something which requires 100% of my\nconcentration, I will typically ignore most incoming requests until I can get\nto some break point which allows me to successfully shift gears. And in some\ncases I will even welcome the distraction; somehow my mind thinks better after\nI have temporarily focused on some other problem.\n \n \nThe firefighting thing takes up 50% of my time at most, and only if I allow it\nto. I always have the option of saying I don&#39;t have time or asking somebody to\ncheck it for me.\n \n \n&quot;I mean, you can manage the load now, but if your company ever expands...&quot;\n \n \nNote that I never said I was the only one doing this. :D In fact, I think the\ncurrent practice is scaling pretty-well re: the size of the company. We have\nroughly 160 people working in technical positions, and I&#39;m one of maybe around\n5-8 who can handle these concerns on the same level (or better). About two\nyears ago, there were around 3 such guys to handle concerns for around 80\npeople.\n \n \nMy current workload levels are more of a problem of lack of senior developers\nassigned to our project more than anything else, and despite that I still do\nnot normally work overtime. Today was awesome though, with all the work I\nmanaged to clear last week, it seems like all the heavy lifting had already\nbeen done and most of my day was pretty light :D",
  "date": "2006-02-01 22:57:00",
  "photo": ""
}