{
  "id": "3f0541e4-6cf4-403a-8b47-6fb5e92dfa49",
  "name": "ptbreakeven",
  "url": "https://www.reddit.com/u/ptbreakeven",
  "text": "Oh this is such a thing, and I don’t understand nor do I agree with the logic. \n\nAdjectiveless X-Men does indeed have its own legacy numbering. Without having all the details in front of me, it’s essentially the numbering from Claremont and Lee’s 1991 X-Men #1 through Morrison’s New X-Men, Carey’s X-Men Legacy, and maybe Spurrier’s(?) renumbered X-Men Legacy featuring Legion all totaling up to 300 issues, none of them featuring “Uncanny” in the title. Apologies if I’ve left anything out there. \n\nUncanny X-Men numbering includes everything from Lee and Kirby’s 1963 X-Men #1 (even though many of these issues do not include “Uncanny” in the title, that didn’t start until issue 142) along with Gillen’s, Bendis’, Bunn’s, and Brisson & Rosenberg’s relaunches (again apologies if I’m leaving some out). This totals to somewhere just north of 600 (I think ~641 but could be wrong). This is all generally accepted as making some degree of logical sense. \n\nHow we get to 700 is less straightforward. “Uncanny” now includes the three issue War of the Realms Uncanny X-Men limited series (OK it has “Uncanny” in the title and during those months was the only Uncanny series), along with Hickman’s 21 issues and Duggan’s 35 issues of “X-Men”. Those last two runs are specifically adjectiveless yet they go to Uncanny numbering.\n\nWhat irks me most though is that there was another choice here. While I get why Marvel would maybe not do this, they could have included the 300 issues of X-Men with the 700 issues of “Uncanny” and made issue 35 of the current series legacy number X-Men #1000. My brain gravitates to this mostly because you’re not adding an “Uncanny” where it’s not, but it would have denied publishing an issue 700, 800, and 900. \n\nAnyway… this is where we are and I am clearly displaying some deep feelings here. As a philosopher once said “the numbers don’t lie, and they spell disaster for you.”",
  "date": "2024-06-06 19:28:46 +0800",
  "photo": null,
  "source_url": "https://www.reddit.com/r/comicbooks/comments/1d8tl0a/wpl_new_comics_discussion_for_652024_pull_of_the/l7cv6vo/",
  "source": "reddit",
  "spam": false
}